{"id":4002,"date":"2020-03-03T08:50:00","date_gmt":"2020-03-03T08:50:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=4002"},"modified":"2021-01-14T17:43:11","modified_gmt":"2021-01-14T17:43:11","slug":"10-social-media-metrics-to-track-and-how-to-do-it","status":"publish","type":"post","link":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/","title":{"rendered":"10 Social Media Metrics to Track (And How to Do It)"},"content":{"rendered":"\r\n<p>You’ve been leveraging social media advertising for your business growth for a while, that’s a very good idea but do you know if social media advertising is working for you? <\/p>\r\n\r\n\r\n\r\n<p>Are you using social media advertising correctly and is it generating the optimal results for your business? If your answer is a yes, then how did you know? How did you report on your social media advertising efforts?<\/p>\r\n\r\n\r\n\r\n<p>The only way to know if you’re using the right strategies in your social media advertising is to measure your performance using social media metrics. <\/p>\r\n\r\n\r\n\r\n<p>Social media metrics are your chance to evaluate the value of your social media advertising strategies and the impact of the smart decisions you’ve made.<\/p>\r\n\r\n\r\n\r\n<p>Social media metrics generate the right data needed to assure business owners that their investment in social media advertising is generating results and paying off. <\/p>\r\n\r\n\r\n\r\n<p>Business owners can also use data from these metrics to make smarter, more data-driven decisions for their business growth and success.<\/p>\r\n\r\n\r\n\r\n<p>Now let’s consider 10 social media metrics every savvy business owner must track to evaluate the performance of their social media marketing efforts.<\/p>\r\n\r\n\r\n\r\n<h2>1. <strong>Audience Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>This is undoubtedly the first metric to track. The audience metric will help you to determine the characteristics of your audience – who your audience is. <\/p>\r\n\r\n\r\n\r\n<p>Note that if you have the wrong set of audience – audience alignment issue – your business will suffer.<\/p>\r\n\r\n\r\n\r\n<p>For instance, if your supposed target audience is primarily 45 years to 55 years old men located in Dallas, but your Facebook following is 85% women between ages 20 and 50 from all over the world.<\/p>\r\n\r\n\r\n\r\n<p>Then you’re attracting the wrong audience with your social media content and wasting your time and money. <\/p>\r\n\r\n\r\n\r\n<p>Audience metrics to track include:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li># of female followers<\/li>\r\n<li># of male followers<\/li>\r\n<li>New accounts you follow<\/li>\r\n<li>Your new followers<\/li>\r\n<li>Primary age group<\/li>\r\n<li>Primary location<\/li>\r\n<li>Total followers<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Tracking the audience metric will help you to ensure that you only have real human followers.<\/p>\r\n\r\n\r\n\r\n<p>Some tools you can use to track audience metric on social media include:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li><a href=\"https:\/\/followerwonk.com\/\">Followerwonk<\/a> – works for Twitter.<\/li>\r\n<li><a href=\"https:\/\/friendsplus.me\/\">Friends+Me<\/a> – works for Facebook, LinkedIn, Twitter, and Pinterest.<\/li>\r\n<li>Google Analytics Audience report – tracks the gender and location of your audience.<\/li>\r\n<li>Social media insights – tracks the gender and location of your audience.<\/li>\r\n<li><a href=\"https:\/\/www.tailwindapp.com\/\">Tailwind<\/a> – works for Instagram and Pinterest.<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>The essence of tracking your audience metric is to know your audience, track their origin and steps, and ensure that the audience engaging with you on social media is the one you’re trying to target.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/SSD305_L-CUnt4LjIrLJBR4NyMDpOQ9soEseIrPS5DISRTKyQKtJOcSPpQJKGVw1a-QbiAyn6kZluv8Pma4CBDWwLy9TeWjWoYDHS3_mipdKJAQkK6EylgTLwmQ4lOWVJ4aOJgYa\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\social-media-metrics-audience-google-analytics-600.png\" \/><\/figure>\r\n\r\n\r\n\r\n<h2><strong>2. Content Metric<\/strong>s<\/h2>\r\n\r\n\r\n\r\n<p>Your content – original content, text posts, image posts, video posts, link posts, etc. – is an important tool to attract and engage the audience to your business brand. Your content is what your audience engages with.<\/p>\r\n\r\n\r\n\r\n<p>Hence, tracking content metrics enables you to evaluate the content you share on the social platform and in what specific pattern they are.<\/p>\r\n\r\n\r\n\r\n<p>Note that the content metric is not the same as the engagement metric. The content metric only evaluates the content you post based on the <a href=\"https:\/\/www.itsma.com\/importance-of-developing-effective-personas\/\">personas<\/a> of your target audience. <\/p>\r\n\r\n\r\n\r\n<p>Are 85% of your social posts image-based while only 15% are text posts? Do you have any video posts? These are questions that the content metric will answer.<\/p>\r\n\r\n\r\n\r\n<p>Content metric will also give you a breakdown of original content versus content posted by others for your business i.e. posts from an influencer or industry expert for your business.<\/p>\r\n\r\n\r\n\r\n<p>Content posted by others includes industry infographics, reviews, guest posts, testimonials, etc. To track this metric, use tools like <a href=\"https:\/\/www.agorapulse.com\/\">Agorapulse<\/a> and <a href=\"https:\/\/buzzsumo.com\/\">BuzzSumo<\/a>. <\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh6.googleusercontent.com\/xtwh8mr9lO15KiYlInbl29bCBdEQXVM1p9oGIdtStsbD6ckiev26fgUQVi88WGRmqwtW0Rs1pJS_vsPzNg-fm9_9cJMPRRYPhLm0F9H0k3T1KsLJ51-mmStsEMay9YOOsiAtUlRi\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\social-media-metrics-tools-buzzsumo-600.png\" \/><\/figure>\r\n\r\n\r\n\r\n<p>These tools would automatically generate a list of how much content and what kind of content you post on social media.<\/p>\r\n\r\n\r\n\r\n<h2><strong>3. Engagement Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>These metrics are usually the first metrics that business owners consider when evaluating the performance of their social media advertising efforts. <\/p>\r\n\r\n\r\n\r\n<p>However, this shouldn’t be because “who your audience is” and “what your audience would engage with” should be of top priority. <\/p>\r\n\r\n\r\n\r\n<p>Except if your primary goal of running social media advertising is to generate likes and comments, the engagement metric should be your prime target.<\/p>\r\n\r\n\r\n\r\n<p>Nevertheless, this is always the easiest metric to track as you can easily see under your posts.<\/p>\r\n\r\n\r\n\r\n<p>Engagement metrics include: <\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Total engagements<\/li>\r\n<li># of individual engagements by type – likes, comments, shares, link click, retweets, etc.<\/li>\r\n<li>Engagement rate – percentage increase or decrease<\/li>\r\n<li># of mentions received<\/li>\r\n<li># of direct messages received<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>As stated above, you can quickly determine your engagement metric in the frontend underneath your post. You can also find your engagement metrics in the social media page insights, especially for link click. <\/p>\r\n\r\n\r\n\r\n<p>However, as a professional digital marketer, I would recommend using social media scheduling tools, such as Agorapulse, Sprout Social, or Hootsuite. They are not only professional but also easier to use.<\/p>\r\n\r\n\r\n\r\n<h2><strong>4. Conversion Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>Another thing you shouldn’t forget to track is your conversion metric. The audience may engage well with your social content but what is the effectiveness of this social engagement?<\/p>\r\n\r\n\r\n\r\n<p>Tracking conversion metrics will enable you to determine the effectiveness of your social engagement. Some of the conversion metrics to track are:<\/p>\r\n\r\n\r\n\r\n<p>The conversion rate: this is the number of audiences that eventually got converted after reading your content, taking an action, or clicking on a link in your post against the total number of audience that visited your page.<\/p>\r\n\r\n\r\n\r\n<p>For instance, a user may find your posts interesting, likes it and even add a comment, but never take any further action like accepting your offer, making a purchase, downloading any content, etc.<\/p>\r\n\r\n\r\n\r\n<p>A high conversion rate means the engagement generated by your content is valuable and effective at compelling your target audience. A high conversion rate is evidence that your content was relevant to your offer.<\/p>\r\n\r\n\r\n\r\n<p>To be able to track your conversion metrics, you must ensure that all of your content has a clear CTA link. You can use a URL shortener for your link to make it trackable.<\/p>\r\n\r\n\r\n\r\n<p>Use tools like Social media insights, and other campaign reporting tools to track the total number of clicks and conversions generated by your content.<\/p>\r\n\r\n\r\n\r\n<p>Note that conversion rate is independent of traffic rate i.e. you may have low traffic to your page and yet get a high conversion rate for your content.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/wDAav7r-nR5bx9DsQINK9CW3JfgxIipvlB9_aMhd78WED7Rof1OtztAA53lBcdvwiv4dBv5Kjm7M4qgjxLFHZ1XlDevZInEdX_LkC3VlBZ9kzkE7b00cmVGuQllhnbM7pofKV-iG\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\total-conversions-social-media-metrics-1024x622.png\" \/><\/figure>\r\n\r\n\r\n\r\n<h2><strong>5. Listening Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>Engagement from your target audience is not enough as you need to listen to what is involved in their engagement. <\/p>\r\n\r\n\r\n\r\n<p>You need to dig deeper and listen to what your audience is saying and commenting about your business on social media. You can use these conversations for sentiment analysis (positive, neutral, or negative).<\/p>\r\n\r\n\r\n\r\n<p>By monitoring the conversations from engagements and analyzing them, you would be able to determine how to respond to your audience, address customers’ issues, give praise when needed, and solve any issues that may arise.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/S-MPDFFUEskmUm3nOo-OC4xrakNnnhC_fn1aXGwZW7lRBdaG-MBvPxBlKQnILCLXWEW5SV2QBoheKIGLTMD6vdA1q-NLwHedzYE0tCVV9xAg9FcltsJ0KA8oMf7hIoInsNXyjqWo\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\bad-review-7.jpg\" \/><\/figure>\r\n\r\n\r\n\r\n<p>Listening metrics include:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li># of Brand Mentions<\/li>\r\n<li># of Positive Sentiments<\/li>\r\n<li># of Neutral Sentiments <\/li>\r\n<li># of Negative Sentiments<\/li>\r\n<li>Primary Mentioner<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>To track listening metrics on social media, here are some best tools to consider:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li><a href=\"https:\/\/www.brandwatch.com\/\">Brandwatch<\/a> <\/li>\r\n<li><a href=\"https:\/\/www.semrush.com\/\">SEMrush<\/a><\/li>\r\n<li><a href=\"https:\/\/tweetdeck.twitter.com\/\">TweetDeck<\/a><\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Although these tools make listening metrics easier, you can also listen to engagement manually to keep up with the conversation.<\/p>\r\n\r\n\r\n\r\n<h2><strong>6. Social Traffic Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>This metric is very important to you if your main reason for running a social media advertising campaign is to generate traffic to your website.<\/p>\r\n\r\n\r\n\r\n<p>When the audience sees your post or content, you want them to take some certain actions through the CTA that would impact your website, product pages. <\/p>\r\n\r\n\r\n\r\n<p>So you need to track what happens when an audience clicks on the CTA or link and heads to your landing page or website. <\/p>\r\n\r\n\r\n\r\n<p>Social traffic metrics would help you to know your bounce rate for social traffic. For instance, are your audience leaving your website immediately and returning to the social media platform? <\/p>\r\n\r\n\r\n\r\n<p>That means your web content is possibly different from what you posted on social media or not properly aligned with it and you need to make some adjustments.<\/p>\r\n\r\n\r\n\r\n<p>Or are your visitors taking the right actions you wanted them to take? These are what tracking the social media metric would help you to determine.<\/p>\r\n\r\n\r\n\r\n<p>Social traffic metrics include: <\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Number of links shared on social media<\/li>\r\n<li>Total sessions<\/li>\r\n<li>Pages per session<\/li>\r\n<li>Total page views<\/li>\r\n<li>Average session duration <\/li>\r\n<li>Bounce rate<\/li>\r\n<li>Mobile vs. Desktop traffic<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Tools for tracking social traffic metrics include:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li><a href=\"https:\/\/ahrefs.com\/\">Ahrefs<\/a><\/li>\r\n<li>Google Analytics<\/li>\r\n<li>SEMrush<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh4.googleusercontent.com\/RyT10740uSTDIkD5m8Y9yeeSGNMYfmpuXDL8afizpFvT5JPewCTqHqH7Gm4915Sl0hF_LWrrMCK7enhGnQt1-9T_22w1dCcqf75GyetofgyLdQoPLU0shcFN5OcgSwok-n_avjCp\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\social-media-metrics-traffic-google-analytics-600.png\" \/><\/figure>\r\n\r\n\r\n\r\n<h2><strong>7. Competitor Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>You’re not the only one within your industry to use social media advertising. Your competitors as well are using the strategy to grow their business. <\/p>\r\n\r\n\r\n\r\n<p>So, tracking what your competitors are doing on social media can help you to better manage and benefit more from your social media marketing strategy.<\/p>\r\n\r\n\r\n\r\n<p>Although tracking competitor metrics wouldn’t let you know how successful your competitors’ social media advertising efforts are contributing to their business success or how it will contribute to your business success.<\/p>\r\n\r\n\r\n\r\n<p>Business owners can use the data generated from the metric to make smart decisions and generate new tactics, strategies, and ideas.<\/p>\r\n\r\n\r\n\r\n<p>Competitor metrics include:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>% of Engagement Difference<\/li>\r\n<li>Competitor Strengths<\/li>\r\n<li>Competitor Weaknesses<\/li>\r\n<li>New Opportunities<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>To track competitor metrics, you need to follow your competitors’ accounts on social media. This will enable you to view their ads, posts, and content just as other users do.<\/p>\r\n\r\n\r\n\r\n<p>You also need to take note of what type of content your competitors are sharing on social media and if they’re making use of influencers or not.<\/p>\r\n\r\n\r\n\r\n<p>Some potent tools you can use for competitor metrics include BuzzSumo, SEMrush, <a href=\"https:\/\/phlanx.com\/\">Phlanx<\/a>, <a href=\"https:\/\/likealyzer.com\/\">Likealyzer<\/a>. Effective use of these tools would help you get a deeper and better insight into your competitors.<\/p>\r\n\r\n\r\n\r\n<h2><strong>8. Branding Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>Aside from seeing how your audience engages with your posts and content, you need to ensure that all of your posts and content align with your business. After all, you wouldn’t post content that is irrelevant to your business brand.<\/p>\r\n\r\n\r\n\r\n<p>The essence of tracking your branding metrics is to evaluate how well your posts and content on social media align with your business.<\/p>\r\n\r\n\r\n\r\n<p>Are your posts clear and consistent with your brand’s voice? Do your image posts have a similar feel to your brand? Can your target audience see any connection between your posts to your brand name?<\/p>\r\n\r\n\r\n\r\n<p>It is important for you to outlines some important branding specifications when curating your social content, such as:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Basic do’s and don’ts<\/li>\r\n<li>Business naming, including abbreviation and capitalization policy<\/li>\r\n<li>Mission statement to follow<\/li>\r\n<li>Public relations policies<\/li>\r\n<li>Terminology to use or avoid<\/li>\r\n<li>Visual marketing guidelines<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Here are some branding metrics to track:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Do all social posts and content match or follow your brand guidelines? Y\/N<\/li>\r\n<li>Do you need to make any changes to branding? Y\/N<\/li>\r\n<li>Do your posts or comments reflect these changes? Y\/N<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>More so, you need to evaluate your branding on social media to ensure consistency.<\/p>\r\n\r\n\r\n\r\n<p>For instance, if you’ve posted earlier using an abbreviation for your business name instead of the full business name, make sure that your subsequent posts bear the abbreviation of your business name. <\/p>\r\n\r\n\r\n\r\n<p>Otherwise, you need to address the issue of inconsistency. Remember social users are so swift to notice any changes to your brand’s style.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh5.googleusercontent.com\/IEL8nZqBl0GzI-zufgJayvUondtlDJn3HvW4tG6U15aPHOrexuhD2Il8CpcwwKZtpFJAlC4nQcdVV0zifjCFLSiBdt_Pxg9XxAVNNygOxKwxYBTUTOlZL-VD6aDSGgKfkO1JOvhu\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\social-media-metrics-tools-semrush-600.png\" \/><\/figure>\r\n\r\n\r\n\r\n<h2><strong>9. Social Media Management Metrics<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>This is one metric that business owners always neglect to track. It’s either they don’t know it or don’t consider its importance.<\/p>\r\n\r\n\r\n\r\n<p>As business owners expect social users to engage with their social content, they must also ensure that they interact well and promptly with the audience that engages with them.<\/p>\r\n\r\n\r\n\r\n<p>But social media management is important because it helps business owners to measure how well they interact with the audience that engages with them.<\/p>\r\n\r\n\r\n\r\n<p>Here are some social media management metrics to track:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Who manages your social media?<\/li>\r\n<li>How many people are on your social media management team?<\/li>\r\n<li>What is your average response time to post engagement (comments, etc)?<\/li>\r\n<li>What is your average response time to a direct message?<\/li>\r\n<li>Who is in charge of making reports on findings?<\/li>\r\n<li>How often is this reporting done?<\/li>\r\n<li>Is there any correlation between the size of your management team and the number of goals achieved?<\/li>\r\n<li>Has there been any public relations issue and how was it handled?<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>Tracking social media management metrics doesn’t require any specific tools. You can simply use any means to find answers to the questions above.<\/p>\r\n\r\n\r\n\r\n<p>Tracking social media management metrics effectively will enable you to find patterns in your social media management team that can either affect your social media marketing efforts to help you achieve business success.<\/p>\r\n\r\n\r\n\r\n<h2><strong>10. Revenue Tracking<\/strong><\/h2>\r\n\r\n\r\n\r\n<p>One of the ultimate results of increasing social followers, engagement, website traffic, conversion, etc., is to generate more revenue for your business. So you need to ensure that your conversion eventually leads to increased sales. <\/p>\r\n\r\n\r\n\r\n<p>A very good way to access your social media ROI is to see how much revenue social media generated for your business. <\/p>\r\n\r\n\r\n\r\n<p>Google Analytics is a good tool that enables you to set website goals for each conversion point. For instance, you can set a dollar value for each conversion. <\/p>\r\n\r\n\r\n\r\n<p>So if you know the source of each conversion (<em>from audience metrics above<\/em>), you can easily calculate the revenue generated by this source.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image\"><img src=\"https:\/\/lh3.googleusercontent.com\/014sxgz6po96HcwG4qcNsiHGgEoyu31zZh_N8v1Wiln5qQ1qqTTyXa-KZFZ7G7dKd0_dVl1OrzG3jLMrGRLRYYrjBMDLTX7PImuaR9yRgOnXH6HM2GZI35KSOxvoJMx1tDKI5z_0\" alt=\"C:\\Users\\Apostle Tim\\Downloads\\revenue-social-media-metrics-1024x585.png\" \/><\/figure>\r\n\r\n\r\n\r\n<p>If you run an eCommerce website or another website that sells products, you would understand that conversions mean sales. So you already have a product with a specific value you can use to measure your revenue metrics.<\/p>\r\n\r\n\r\n\r\n<p>Even if you render services, you can use the average amount a customer pays to calculate your revenue.<\/p>\r\n\r\n\r\n\r\n<p>However, there are tools like Ontraport and Marketo that can help you to better track your customers’ journey from their first conversion. <\/p>\r\n\r\n\r\n\r\n<p>These tools help you to know what customers pay per year. With this, you can appreciate the revenue that your social media advertising generated.<\/p>\r\n\r\n\r\n\r\n<h2><strong>Conclusion <\/strong><\/h2>\r\n\r\n\r\n\r\n<p>The major reason for adopting a social media advertising strategy is to achieve your overall business goals. <\/p>\r\n\r\n\r\n\r\n<p>Hence, social media metrics should be evaluated based on how you’re implementing this strategy in pursuit of those goals.<\/p>\r\n\r\n\r\n\r\n<p>Data generated from tracking social media metrics can be leveraged to make smart data-driven decisions about how to better position your business in the marketplace. <\/p>\r\n\r\n\r\n\r\n<p>Remember the effectiveness of your social media efforts will go a long way in proving its value to the business and the only way to measure effectiveness is by tracking its metrics.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>You’ve been leveraging social media advertising for your business growth for a while, that’s a very good idea but do you know if social media advertising is working for you?  Are you using social media advertising correctly and is it generating the optimal results for your business? If your answer is a yes, then how [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7099,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[17],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>10 Social Media Metrics to Track (And How to Do It) - Socialistics<\/title>\n<meta name=\"description\" content=\"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"10 Social Media Metrics to Track (And How to Do It) - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-03-03T08:50:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:43:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png\" \/>\n\t<meta property=\"og:image:width\" content=\"772\" \/>\n\t<meta property=\"og:image:height\" content=\"434\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png\",\"width\":772,\"height\":434},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#webpage\",\"url\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/\",\"name\":\"10 Social Media Metrics to Track (And How to Do It) - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#primaryimage\"},\"datePublished\":\"2020-03-03T08:50:00+00:00\",\"dateModified\":\"2021-01-14T17:43:11+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"10 Social Media Metrics to Track (And How to Do It)\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"10 Social Media Metrics to Track (And How to Do It) - Socialistics","description":"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/","og_locale":"en_US","og_type":"article","og_title":"10 Social Media Metrics to Track (And How to Do It) - Socialistics","og_description":"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.","og_url":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-03-03T08:50:00+00:00","article_modified_time":"2021-01-14T17:43:11+00:00","og_image":[{"width":772,"height":434,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/03\/image-38.png","size":"full","id":7099,"alt":"","pixels":335048,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/03\/image-38.png","width":772,"height":434},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#webpage","url":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/","name":"10 Social Media Metrics to Track (And How to Do It) - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#primaryimage"},"datePublished":"2020-03-03T08:50:00+00:00","dateModified":"2021-01-14T17:43:11+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"Paying attention to your social media metrics is critical if you want to maximize your social media results. Here are 10 you should prioritize.","breadcrumb":{"@id":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/10-social-media-metrics-to-track-and-how-to-do-it\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"10 Social Media Metrics to Track (And How to Do It)"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/4002"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=4002"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/4002\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7099"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=4002"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=4002"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=4002"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}