{"id":4029,"date":"2020-02-19T08:07:00","date_gmt":"2020-02-19T08:07:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=4029"},"modified":"2021-01-14T17:43:34","modified_gmt":"2021-01-14T17:43:34","slug":"b2b-social-media","status":"publish","type":"post","link":"https:\/\/socialistics.com\/b2b-social-media\/","title":{"rendered":"Why B2B Social Media Matters &#038; How It Can Work For Your B2B Business"},"content":{"rendered":"\r\n<p>There are so many misconceptions around B2B social media that some brands have written it off completely, simply because they don&#8217;t know how to unlock the full potential these platforms offer.<\/p>\r\n\r\n\r\n\r\n<p>For example, what if you could 10 X your sales in six months?<\/p>\r\n\r\n\r\n\r\n<p>Find new customers exactly like your very best customers? What about reaching a new market in another city or even country?  <\/p>\r\n\r\n\r\n\r\n<p>And who wouldn’t want to grow their email marketing list 5000 X in a few days—with high quality, relevant leads who have already demonstrated that they are interested in your message?<\/p>\r\n\r\n\r\n\r\n<p>These are some of the reasons B2C marketers have gone wild over social media, but B2B companies have been slower to see the same lift. In reality, there are some important differences in how and why B2B companies should leverage social media. While B2C companies are looking to drive immediate action using emotionally potent and urgent messaging, B2B companies with a longer sales cycle will want to nurture the process by positioning their brand as a trusted source of quality information and ongoing support. <\/p>\r\n\r\n\r\n\r\n<h2>A well-designed B2B social media strategy can deliver big results:<\/h2>\r\n\r\n\r\n\r\n<ul>\r\n<li>Drive more traffic to a website, landing page or ad <\/li>\r\n<li>Distribute your content more widely and generate engagement <\/li>\r\n<li>Find highly relevant audiences and markets—across the world or just around the corner  <\/li>\r\n<li>Generate leads for your email marketing campaigns and grow your list <\/li>\r\n<li>Support and nurture your active customers, turning them into brand advocates<\/li>\r\n<li>Keep your brand top of mind and build brand affinity <\/li>\r\n<li>Build relationships with partners, high-value customers and influencers in your ecosystem<\/li>\r\n<li>Expand your networking footprint and amplify on the ground efforts of marketing and sales<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p><em>If the benefits are so great, why have so many B2B companies shied away from social media? <\/em><\/p>\r\n\r\n\r\n\r\n<p>The reasons are myriad, but they all point back to one important fact: Mastering social media requires a huge shift in how companies engage with their customers, and <em>this change can bring a lot of uncertainty, vulnerability and personal risk.<\/em><\/p>\r\n\r\n\r\n\r\n<h3>Social media requires continuous innovation <\/h3>\r\n\r\n\r\n\r\n<p>In short, to harness the tremendous power and exponential growth social can drive, companies have to be willing to try something different, challenge their assumptions, and get down to the level of the customer. This level, human-to-human requires new strategies and tactics for companies who have always maintained a certain distance. With social media, what has always been true is more obvious than ever: you are marketing to people. Sales has always understood this, and the relationship model behind digital marketing is built on it. <\/p>\r\n\r\n\r\n\r\n<p>Companies that get this and are willing to engage on this level can find huge value in social media. <\/p>\r\n\r\n\r\n\r\n<p>In fact, the B2B brands that are using social with the greatest results frequently showcase customer and partner stories frequently in their feeds. For example, social media powerhouse Cisco has a great blend of posts on their twitter feed, mixing up different medias and formats along with sharing the perspectives of their community.  Likewise, Salesforce often features employee stories and creates a space where people can engage on LinkedIn.<\/p>\r\n\r\n\r\n\r\n<p>It&#8217;s worth noting that although these are top companies with huge budgets, they don&#8217;t use a lot of overproduced images and copy. On Facebook, Cisco&#8217;s background image is simply a bridge overlaid with a simple tagline, the look and feel is relatable, authentic and simple:<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4031\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/Screen-Shot-2020-02-14-at-6.05.31-AM-1024x381.png\" alt=\"b2b social media header\" \/><\/figure>\r\n\r\n\r\n\r\n<p>Square is another great example of how powerful this kind of marketing can be. By just showing up, telling stories, and featuring small businesses they&#8217;ve been able to build a strong network and quickly expand into new markets. They&#8217;ve completely flipped the power dynamic: the customer is the hero, and Square quietly supports them with a great POS and a lot of support and encouragement.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4032\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/Screen-Shot-2020-02-14-at-12.41.58-PM-1024x785.png\" alt=\"b2b social media highlight\" \/><\/figure>\r\n\r\n\r\n\r\n<p>They have a continuous presence: people can trust that Square will be there, because they <em>are<\/em> always there. This ongoing presence allows small businesses to entrust them with their most valuable and sensitive information: customer data and payment information.<\/p>\r\n\r\n\r\n\r\n<p>Square also takes time to engage with their audience. Their social listening skills have helped them better understand their customer, and develop successful new products, and their responsiveness engages and builds their audience.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4033\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/Screen-Shot-2020-02-14-at-12.55.25-PM-1024x691.png\" alt=\"b2b social media exchange\" \/><\/figure>\r\n\r\n\r\n\r\n<p><em>Social media can pay huge dividends, but it requires an investment of time, money and patience, a willingness to think outside the box and be human and personal, and to shine the spotlight on your community. <\/em><\/p>\r\n\r\n\r\n\r\n<h2>Passive vs active <\/h2>\r\n\r\n\r\n\r\n<p>Most B2B companies have a website and are sold on email marketing, but many have written off social media as a waste of time.  Either they have tried to engage on social and didn’t see any value, or they treat social media as passive resource, like a website or storefront, putting up some content and maintaining a presence without really digging into the functionality of the platform.  Without seeing much impact, they hesitate to invest more effort. <\/p>\r\n\r\n\r\n\r\n<p>They may have great resources, like whitepapers, blogs and videos, but this content may not be getting any engagement or delivering any meaningful ROI. In the hopes of attracting customers, many companies turn to search, hoping again to attract customers. This can work if you have a product that a lot of people already understand and are looking for, but search doesn’t make sense for everyone. SEO is also becoming increasingly competitive—many companies are outranked by the dominant players and simply cannot afford to compete. However, if you do have a viable SEO strategy, social media can really help drive it home. <\/p>\r\n\r\n\r\n\r\n<p><em>If not, social can accomplish literally everything search can, and more. <\/em><\/p>\r\n\r\n\r\n\r\n<p>This is why social media will become even more important for B2B companies over the next decade, especially If they are looking for exponential growth or funding from VC’s. There is a reason why social engagement means so much to investors: it is literally proof of concept. <\/p>\r\n\r\n\r\n\r\n<p>This is only going to increase as more users access digital media and social platforms on their mobile phones. Each year the amount of time users spends on mobile vs desktop creeps up. As people spend more time on mobile, they spend more time on social media, messaging, sharing, watching videos, and consuming short, bite-sized content that they don’t have to dig for. <\/p>\r\n\r\n\r\n\r\n<h2>Digital is social<\/h2>\r\n\r\n\r\n\r\n<p>You can’t have a digital marketing strategy without social media.<\/p>\r\n\r\n\r\n\r\n<p>At the same time that social media platforms are growing increasingly complex, audiences are demanding great content at the level of engagement, challenging companies to turn their marketing models inside out. <\/p>\r\n\r\n\r\n\r\n<p>What does this mean? It means <strong>surfacing your best content and resources<\/strong> and providing value <em>right where people are<\/em>, on social media and other digital platforms, having conversations, consuming content and sharing what is most interesting with their own communities.  <\/p>\r\n\r\n\r\n\r\n<p>IBM does a great job of creating value and putting consumable content and bite-sized insights right into their feed. Although their posts are short and visually appealing, they are also thought provoking and meaningful.<\/p>\r\n\r\n\r\n\r\n<figure class=\"wp-block-image size-large\"><img class=\"wp-image-4034\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/Screen-Shot-2020-02-13-at-5.19.26-PM-1024x618.png\" alt=\"IBM b2b social media\" \/><\/figure>\r\n\r\n\r\n\r\n<h2>The continuing evolution of social and digital media<\/h2>\r\n\r\n\r\n\r\n<p>Social media isn’t going away, but it is constantly changing. According to <a href=\"https:\/\/www.pewresearch.org\/internet\/fact-sheet\/social-media\/\">Pew Research<\/a>, 7 out of 10 Americans are on social media today. On average, individuals spend about 3 hours a day on social media. Of course, this is only an average. For power users, influencers and thought leaders, it is often more. In addition, not all engagement is created equal. Social media is made up of communities and groups focused around a shared interest or topic. These niche communities are a great way to engage with a focused audience with whom your message is particularly relevant.<\/p>\r\n\r\n\r\n\r\n<p><em>Some of these influencers or micro influencers and audiences are smaller, but also more engaged and active.<\/em><\/p>\r\n\r\n\r\n\r\n<p>For example, we recently helped Trupanion, one of the largest pet insurance companies in North America, grow their niche community of veterinarians and staff. In the end, our <em>best performing audience achieved a cost per link click of just $0.63.<\/em> In total, we garnered 3,544 link clicks leading to the landing page where users could download guide.<\/p>\r\n\r\n\r\n\r\n<p>Read more about the <a href=\"https:\/\/socialistics.com\/how-we-grew-trupanions-veterinary-social-media-community\/\">Trupanion&#8217;s successful B2B Facebook marketing campaign<\/a> in our latest blog.<\/p>\r\n\r\n\r\n\r\n<h2>Social media today<\/h2>\r\n\r\n\r\n\r\n<p>Globally, there are now <a href=\"https:\/\/thenextweb.com\/podium\/2019\/07\/17\/over-3-5-billion-people-are-on-social-media-facebook-still-biggest-with-teens-esports-on-the-rise\/\">3.5 billion social media users<\/a>, almost half the planet. Facebook is the most popular site overall, with 2.4 billion users but <a href=\"https:\/\/foundationinc.co\/lab\/b2b-marketing-linkedin-stats\/\">LinkedIn<\/a> is the platform of choice for B2B companies.  The platform currently has over 660 million registered users, and half of them are very active. <\/p>\r\n\r\n\r\n\r\n<p>90 million users are senior-level influencers and decision makers. <\/p>\r\n\r\n\r\n\r\n<p>B2B marketers survey via the <a href=\"https:\/\/www.socialmediaexaminer.com\/social-media-marketing-industry-report-2019\/\">Social media Examiner: <\/a><\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>89% use LinkedIn<\/li>\r\n<li>88% use Facebook<\/li>\r\n<li>83% use Twitter<\/li>\r\n<li>55% use YouTube<\/li>\r\n<li>39% use Pinterest<\/li>\r\n<li>26% use Instagram<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p><em>For companies who need to grow quickly, social media represents the biggest marketing opportunity today<\/em><\/p>\r\n\r\n\r\n\r\n<p>Even on platforms where adoption has not caught up with the powerhouses, the audiences are growing: <a href=\"https:\/\/business.instagram.com\">90% of Instagram<\/a> users follow at least one business, and platforms like Twitter and YouTube have plenty of room for newcomers to make their mark. <\/p>\r\n\r\n\r\n\r\n<p>There are many opportunities and benefits for B2B companies who strategically leverage these popular sites with the right tactics and great content. Knowing what you want to achieve on social media, setting up the right metrics, and seeing your strategy through is key to seeing results that drive returns. Consistency produces scale, which allows you to gain actionable insights. The more you learn, the more effective your strategy becomes, a virtuous circle that returns results at an exponential rate.  <\/p>\r\n\r\n\r\n\r\n<h2>Getting started with B2B social media<\/h2>\r\n\r\n\r\n\r\n<p>B2B companies who are using social media effectively are creating brand affinity by building relationships and trust.  They aren’t just broadcasting a message; they are a part of the conversation. They use social to share, but also to listen and learn from their customers, a critical advantage for any company who wants to stay ahead of the curve in these disruptive times. <\/p>\r\n\r\n\r\n\r\n<p>Social media doesn’t always drive sales directly for B2B companies—these buyers aren’t typically converting right on LinkedIn and Twitter—but a strong social media presence can seriously amplify your marketing and sales and strategy, and help you find markets and potential customers who would otherwise remain elusive. <\/p>\r\n\r\n\r\n\r\n<h2>Do you want to learn more about what a B2B social media strategy can achieve for your marketing and sales team?<\/h2>\r\n\r\n\r\n\r\n<p><a href=\"https:\/\/socialistics.com\/contact-us\/\">Contact us today<\/a> to learn more about how you can use these platforms strategically to find potential buyers, move them through your sales and marketing pipeline, and ultimately increase revenue.<\/p>\r\n\r\n\r\n\r\n<p><em>Socialisitics is a B2B social media marketing agency and Seattle-based company with a client list that spans the globe. We work with businesses who are looking to grow locally or expand into global markets, helping them create and implement a social media strategy that supports their strategic goals. We help small and medium businesses grow their community, fill their pipeline, and gain critical insights into customer behavior.<\/em><\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>There are so many misconceptions around B2B social media that some brands have written it off completely, simply because they don&#8217;t know how to unlock the full potential these platforms offer. For example, what if you could 10 X your sales in six months? Find new customers exactly like your very best customers? What about [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7104,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[14],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why B2B Social Media Matters &amp; How It Can Work For Your B2B Business - Socialistics<\/title>\n<meta name=\"description\" content=\"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/b2b-social-media\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why B2B Social Media Matters &amp; How It Can Work For Your B2B Business - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/b2b-social-media\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-02-19T08:07:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:43:34+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"772\" \/>\n\t<meta property=\"og:image:height\" content=\"434\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/b2b-social-media\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg\",\"width\":772,\"height\":434},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/b2b-social-media\/#webpage\",\"url\":\"https:\/\/socialistics.com\/b2b-social-media\/\",\"name\":\"Why B2B Social Media Matters & How It Can Work For Your B2B Business - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/b2b-social-media\/#primaryimage\"},\"datePublished\":\"2020-02-19T08:07:00+00:00\",\"dateModified\":\"2021-01-14T17:43:34+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/b2b-social-media\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/b2b-social-media\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/b2b-social-media\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Why B2B Social Media Matters &#038; How It Can Work For Your B2B Business\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why B2B Social Media Matters & How It Can Work For Your B2B Business - Socialistics","description":"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/b2b-social-media\/","og_locale":"en_US","og_type":"article","og_title":"Why B2B Social Media Matters & How It Can Work For Your B2B Business - Socialistics","og_description":"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.","og_url":"https:\/\/socialistics.com\/b2b-social-media\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-02-19T08:07:00+00:00","article_modified_time":"2021-01-14T17:43:34+00:00","og_image":[{"width":772,"height":434,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/02\/image-40.jpg","size":"full","id":7104,"alt":"","pixels":335048,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/b2b-social-media\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/02\/image-40.jpg","width":772,"height":434},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/b2b-social-media\/#webpage","url":"https:\/\/socialistics.com\/b2b-social-media\/","name":"Why B2B Social Media Matters & How It Can Work For Your B2B Business - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/b2b-social-media\/#primaryimage"},"datePublished":"2020-02-19T08:07:00+00:00","dateModified":"2021-01-14T17:43:34+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"Learn how and why B2B social media can be just as effective if not more then B2C with examples and steps on how to pull it off.","breadcrumb":{"@id":"https:\/\/socialistics.com\/b2b-social-media\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/b2b-social-media\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/b2b-social-media\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Why B2B Social Media Matters &#038; How It Can Work For Your B2B Business"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/4029"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=4029"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/4029\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7104"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=4029"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=4029"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=4029"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}