{"id":5168,"date":"2020-08-30T16:24:00","date_gmt":"2020-08-30T16:24:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5168"},"modified":"2021-01-14T17:39:07","modified_gmt":"2021-01-14T17:39:07","slug":"hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar","status":"publish","type":"post","link":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/","title":{"rendered":"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar"},"content":{"rendered":"\r\n<p>This week I sat down with Hooman Radfar, CEO of Hyke, a tax planning and management service for small business owners and freelancers. We&#8217;ve been with Hyke for about a year and they&#8217;ve been a tremendous partner by managing all our tax needs. We discuss how Hyke came to be, how they disrupt, and Hooman&#8217;s impressive entrepreneurial background and insights into the world of business and freelancing.<\/p>\r\n\r\n\r\n\r\n<p>Socialistics listeners can save 50% off their first 2 months by visiting: <a href=\"https:\/\/hyke.me\/socialistics\" target=\"_blank\" rel=\"noreferrer noopener\"><strong>https:\/\/hyke.me\/socialistics<\/strong><\/a><\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5188315\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5188315-hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar.js?container_id=buzzsprout-player-5188315&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [00:08]<\/strong>     Hey, and welcome to another episode of the Socialistics podcast: Social Media Agency Stories. I am really excited about our guest today. It has been planned for a few weeks. Full disclosure, we are a client of Hyke and they are an awesome, awesome partner of ours. They are basically an online concierge financial platform for those that are self-employed. They help me not worry about my finances and taxes and things of that nature, and they do it in a really cool way, basically using Slack. I have a team at my disposal and the biggest frustration point that I&#8217;ve had in my business in the first few months is having to worry about stuff that I don&#8217;t know anything about, which is basically the financial and tax side of things. So I tried the old fashioned methods and then a colleague of mine referred me to Hyke and I haven&#8217;t looked back since.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [01:06]       <\/strong>It&#8217;s just such a valuable partner to have direct access to on a regular basis. When I have questions, it&#8217;s great that I can ask them in Slack and get those answers. It&#8217;s just been so awesome and I really wanted to bring them on today to talk a little bit about their journey as a company and how they can help agencies because I think if anybody out there owns an agency or is thinking about it, this is definitely something to consider that lets you focus on what you do best and then have a partner in place that&#8217;s going to help you with the things that you don&#8217;t want to be thinking about. So today I want to welcome Hooman Radfar, who is the CEO of Hyke. Welcome to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:<\/strong>  <strong>[01:42]<\/strong>     Thanks for having me. I&#8217;m pumped.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong><strong>       [01:43]<\/strong>     Absolutely. I&#8217;m really excited. So let&#8217;s just dive right in. Tell the audience a little bit about yourself, your background and how that led you to Hyke.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:<\/strong><strong>  [01:54]<\/strong>     Sure. So I was born in London, raised in the States. I actually grew up in Pittsburgh, so no Steelers comments please on this whole entire podcast. But I&#8217;ve always been interested in tech. I grew up coding, designing and when I went to school, there was a little thing called the dot-com boom and burst. I got hooked on the idea that you could use tech to start making change, so I got into entrepreneurship then right after grad school. So started my first company AddThis, which was a marketing automation platform, some of your audience might be familiar with it, might have even used it. It&#8217;s tools for website providers, helps them increase traffic and engagement. We also provide a number of other tools that involve personalization of data. Ended up selling that to Oracle &#8211; it became part of Oracle Data Cloud &#8211; and then continued the journey around entrepreneurship, this time, instead of me building the company, helping others build their companies. So became a founding partner at Expa, and it&#8217;s a venture capital firm that builds and invests in startups. My partners were amazing. One of my partners started StumbleUpon and Uber, the other started Foursquare. We were just a group of entrepreneurs that wanted to help other entrepreneurs succeed. It&#8217;s been a blast working there for the last couple of years building up that program. We’ve worked with over 50 companies, and that&#8217;s really what led me to Hyke.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [03:27]<\/strong>       So when we were at Expa helping entrepreneurs, one of the things we saw, Jason, that was really interesting is it really sucks when you&#8217;re trying to set up and run your company. So we had this program called Startup in a Box, where it would tell you how to form your company, how to choose an accountant, how to set up your credit card, the whole thing. And the realization I had is what do you do if you&#8217;re a small business and you don&#8217;t have venture capital, and you don&#8217;t have this program? So that inspired me to explore this idea of how do you help the largest group of entrepreneurs which are SMBs. And I met my co-founders and they were actually interested in the same concept in parallel, but for self-employed people who were businesses of one. And I thought to myself, “Wow, if it was really tough for a small business that has, I don&#8217;t know, 10, 20 people, how bad is it if you&#8217;re just starting out, hanging up your shingle, and you&#8217;re one person?” That&#8217;s really what inspired Hyke and what set it going. And our vision is pretty simple. We want to make sure that you can focus on your passion, not your paperwork. It&#8217;s too complicated to start running these things, and we want to be your back office, your partner helping you be the hero in the background. So that&#8217;s how I got here.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong><strong>       [04:41]<\/strong>     Awesome. So I love that you brought up Uber because I use this example or this story. One of my favorite words that I use all the time is just “disrupt” or “disruption”. And usually, I tee it up because I envision, not that I was in the room, but I would have loved to have been a fly on the wall when Uber was invented. I just think to what that scenario must have been like, sitting in the room, “What sucks about getting a taxi or trying to get a ride somewhere? What are the things that people absolutely hate about it?” And I imagine making this list and like, “Tipping is always a pain in the ass. I don&#8217;t understand that” or just all the things that people really just despise about that experience. And then just imagining them, “Okay, well, we&#8217;re going to do it this way or this&#8211;“, creating the ideal experience for a consumer to get from place A to place B. That&#8217;s the line of thinking that I&#8217;ve tried to have as an agency is, “How can we disrupt? How can we do things that companies despise about working with agencies?” So my question to you is, how does Hyke disrupt? In your opinion, what are the disrupting things that you guys do that flips this sort of service offering from traditional methods?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:<\/strong><strong>  [05:54]<\/strong>     Well, I think our disruption is in simplicity. So before us, if you were self-employed, you&#8217;re setting up your business of one &#8211; and you know this better than anyone, Jason &#8211; it&#8217;s basically you and Google. So you&#8217;re trying to figure out “All right, well, how do I form my company? Am I an LLC? Am I S corp? I heard my friend saying I could save money as an S corp but what&#8217;s the difference?” Then you use Google to go ahead and figure out “Okay, well, what do I need? I need a bank account. Oh, wait, what&#8217;s that EIN thing? Is that first or last?” Effectively, it&#8217;s you researching, figuring out this path by hook or by crook. And much like I think Uber is an interesting analogy, Uber said, “Hey, wait, I&#8217;m going to simplify the process of you getting a ride down to one button. You&#8217;re going to hit this button and you&#8217;re going to have a personal driver.” What we&#8217;re saying is we&#8217;re going to simplify that process of you thinking about how to start, how to set up your QuickBooks, how to set up Gusto, how to set up that whole stack, and having an expert in case you have any questions down to signing up for one service, and that’s Hyke.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [07:07]       <\/strong>So that simplification is really the common thread because our belief is, these things are important, they&#8217;re necessary but that&#8217;s not the core of your business. The core of or businesses is the ingenuity you&#8217;re going to bring on, the advice that you bring to your clients, whatever designer, that insight they have, they should be spending their time there, not on how their chart of accounts is set up, not on whether or not they have compliance due, and the millions of other problems. So that&#8217;s what we&#8217;re about. We&#8217;re about making your life simple. And I think if we create that one place, that we can make it simple, and you get peace of mind&#8211; And by the way, we make sure you make more money, which is the interesting part about the way we do things with focusing on S corporations. We think that&#8217;s going to really help the entrepreneurs in the communities that we want to serve.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [07:55]<\/strong>     Yeah, I love that. You&#8217;ve touched on this a little bit, maybe you can go a little bit deeper into what the actual experience is like for business owners, but especially for marketing agencies. How can a marketing agency or somebody that&#8217;s starting out as a freelancer really benefit from using Hyke?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [08:13]<\/strong>     Well, I think the benefit starts from the beginning of our process, which is typically the beginning of most processes, which is what entity do I form? Where do I start? So we work with people who are great freelancers, who are serious about this being their core business. And the structure we recommend highly and we designed our whole back office process around is this S corp, and where we get you started is we’ll form you for free. So how great is that? We&#8217;ll go ahead and set up that S corp &#8211; so set up LLC and elect it, and a lot of people you&#8217;d be surprised don&#8217;t understand the benefits of that. I&#8217;ve invested in 30 plus companies personally, I&#8217;ve started businesses, I didn&#8217;t understand how much money is being left on the table by people not electing to be an S corp until I dug into it and it&#8217;s really phenomenal. You&#8217;re talking about billions of dollars that are going to the government that are meant for you. That&#8217;s a lot when you&#8217;re making one hundred or $200,000 and you get five to $10,000 back.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [09:23]       <\/strong>So it&#8217;s really meaningful for us to be able to help people realize that and that&#8217;s really where we start. We have an online wizard you can go [to]. It&#8217;s really easy to help set that up and you have someone to call if you have an issue. That&#8217;s the theme of what we want to have. We want to have technology and software that helps guide you through it but there is a person who is your concierge and a team. You mentioned Slack, you&#8217;re assigned a team that can help you because you have your own business, you have your own questions. There are always subtleties there and we want to make sure you don&#8217;t feel like you have to sit there and go to Google and go to other places. That’s really our aspiration.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [10:00]<\/strong>     Yeah, I really want to highlight that. There&#8217;s a lot of benefits that I&#8217;ve gleaned from partnering with you guys. I think, really, the biggest one that stands out for me is just you touched on simplicity, but I would add another word &#8211; accessibility. I think what I&#8217;ve experienced as a business owner, using traditional accounting or bookkeeping services is just like you have a question and you need it answered and you try to pick up the phone or you send an email and maybe they&#8217;ll get back to you that day. There isn&#8217;t that instantaneous or quick turnaround to get the information that you need to be able to not have to worry about something. So for me, that has been the biggest takeaway in terms of why this has worked so well, especially in the current environment and the world that we live in, just to be able to have access to a team in a short period of time to get the answers to the questions you have. It&#8217;s just been game-changing. I absolutely have loved having that kind of accessibility. So I just really want to try&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [11:01]<\/strong>     And we think that that&#8217;s something that we want to get better and better and better at. And the beauty of technology is that we&#8217;re going to enable the folks that are serving you that are on your team. I love that word partner that you used because we don&#8217;t want to be viewed as anything other than working with you as part of that team. Because look, I&#8217;ve built companies that are pretty large at this point, I&#8217;ve invested in a couple of unicorns that are multi-billion dollar companies and I&#8217;ll tell you, even you hear this mythology about the founder, right? And you have these herculean stories of jobs, but they&#8217;re as good as the people around them, and we want to be those people. We&#8217;re okay that you don&#8217;t hear about us. In fact, that&#8217;s our goal. We want to be in the background. But that really is gratifying for us to serve you guys as a community to build that out because the largest sector of entrepreneurs in the country are the solopreneurs and it&#8217;s growing fast with COVID in particular. I&#8217;m sure you&#8217;ve seen your friends. How many people are you seeing jumping into it, Jason? It&#8217;s got to be crazy. And marketing, in particular, it&#8217;s got to be a groundswell.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [12:08]<\/strong>      Yeah, well, I think you guys are positioned really well because I think we were already headed in this direction anyway, and then the pandemic has just reinforced, or probably turbo-boosted more and more people working from home, more and more people wanting to do their own thing. So I think the model that you have just makes sense. We live in a world where people have an expectation of getting answers and getting what they need quickly. So I think the companies that are able to do that are the ones that are going to thrive and the ones that don&#8217;t are going to be left behind. So on that note, what does the future look like for Hyke? What are you excited about, passionate about in terms of what the evolution of this company looks like?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [12:50]<\/strong>     Well, I think first and foremost, we always think about our members and our community first. So what we want to do is we want to deliver that peace of mind to you. And we&#8217;ve been able, I think, to start to realize that vision with, “Hey, we&#8217;re going to help you set up the company, we&#8217;re going to help you set up the chart of accounts and tools, and we&#8217;re going to help you set up the payroll.” That&#8217;s the basics, and we want to continue that. But what we&#8217;re hearing back from our partners &#8211; and I love that word &#8211; our members is that “Hey, look, there&#8217;s more to do. I want to retire. I want my 401(k). I want to have insurance.” So we&#8217;re realizing through feedback from our community that there&#8217;s a bigger platform to be built here if we want to realize that vision. So I think we&#8217;re excited about trying to keep understanding how we can better serve the community and you guys. And I think these other additions are going to be helpful because we can be that Startup in a Box, we can deliver that business in a box and make it simple, because why should you have to go to an accountant and a lawyer and have maybe some assistant do your compliance? There are so many people that you&#8217;d have to orchestrate to do what we do, and we just think that that&#8217;s not the future. The future is simple.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [14:18]<\/strong>     Yeah, I&#8217;ve got another example I want to give is, I&#8217;ve had two particular instances that were unique to us that you guys have been great around, like with the PPP loan program. We were lucky to get in on that but there&#8217;s just so much unknown about that, how it works and navigating that. And you&#8217;re right, Google, you go there and you just have no idea how to navigate this thing and having folks on your team that are like, “ Oh, by the way, what do I need to be thinking about this?” And just the ability to ask those questions, getting answers, get guidance for things that just get thrown at you is just a tremendous value add. So I&#8217;ve gotten help navigating that. I&#8217;ve had somebody that&#8217;s interested in investing in us and I have no idea like, “How do I figure out a valuation for where I&#8217;m at right now? How do I navigate that?” I&#8217;ve been able to count on your team to help me navigate that because they&#8217;ve been intimate with our business and how it&#8217;s grown and they&#8217;re in a position to provide that value. And maybe that&#8217;s not even in the Terms of Service but they had no problem being able to help me navigate that and provide that information. So it&#8217;s been a really great experience. I&#8217;m really excited about what you guys have built, and I&#8217;ve seen it evolve even over the past six months as it&#8217;s continued to get better and better, so that&#8217;s been awesome. So that&#8217;s great about that. I want to talk a little bit more about just you in general and what you&#8217;re seeing in the landscape, but you&#8217;ve been around the block, you&#8217;ve done a lot and I&#8217;m just kind of curious about what your thoughts are on the freelance space in general, especially considering our current situation. Where do you see it going, and how do you see that impacting how we do business in the near future?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [16:09]<\/strong>     Well, I think the freelance space is going to become more significant, and at least in my mind, I&#8217;m starting to think about it differently. So just by way of background, I have invested in Uber, I invested in an on-demand company called Convoy that is in the trucking space. I&#8217;ve seen this happen more and more, even when you&#8217;re looking at contractors that are going into the restaurant business with companies like Sweetgreen that I was lucky enough to work with. I think what we&#8217;re seeing is the continuation of a pretty huge macro trend right now, and the estimates are hard, but you see 20, 30 million people that are businesses of one. And I think what you&#8217;re seeing with COVID now, because everyone&#8217;s moving to this remote environment, and because there&#8217;s more uncertainty, that traditional companies have been more inclined both to hire remote workers, but also contractors in their local markets, and that&#8217;s creating this boom effect. So I think you&#8217;re going to see a huge acceleration in this marketplace. But unfortunately, it&#8217;s not easier. It&#8217;s not like the government&#8217;s coming out and saying, “Oh, you know what, I just realized that there&#8217;s X percent more growth in this sector, let&#8217;s make it easy for you to form your entity, let&#8217;s make it easy for you to file taxes, let’s make it easy.” That&#8217;s not the case.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [17:34]<\/strong>       So, I think that there are going to be a lot more companies in and around this space, whether it&#8217;s from what we&#8217;re doing and helping you on the back office or even on the front end, more tooling on things like invoicing, things like tracking mileage. There&#8217;s a whole stack that there&#8217;s this massive pressure that&#8217;s being created where people say, “I need something now.” And I think you&#8217;re going to see a lot of innovation around that. It&#8217;s actually being driven also, by again, the companies themselves. Some interesting debates that are going to occur around this now are &#8211; you see what&#8217;s happening with Uber and Lyft in the California market. How will you classify some of the workers that are in this “gig economy”? In particular, these mobile workers who are either delivery driving and whatnot, I think that&#8217;s going to have some ripple effects across the states depending on how that gets sorted out in that particular segment. But believe it or not, while it is a large part of the segment, you, people like you are much more indicative of that economy actually. There are realtors, there are doctors, there are solo practitioners, this is a large phenomenon that has only been growing and so yeah, it&#8217;s going to be interesting to see how these things play out.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [18:56]<\/strong>     How would you if you were going to advise somebody who is wanting to go off on their own, whether it&#8217;s starting a business, whether it&#8217;s being a freelancer, what are the top two or three things that come to mind that you would advise them on to really be thinking about out of the gate to set themselves up for success?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [19:15]<\/strong>     That&#8217;s a good question. So I think it depends on when you say they&#8217;re going out there, for example, to start out on their own, if they&#8217;re committed to doing it wholeheartedly, meaning they&#8217;re not going to do it as a side gig, I would say there are some simple things that you can do right away. I would immediately get a business banking account or a banking account and have one credit card and start swiping your expenses in one credit card. I know that sounds simple, but the number of people you&#8217;ll see that start jamming up their personal card and then later have another card. It creates a nightmare for you administratively later on, but if you can go to an accountant maybe later when you’ve decided to commit to that field and say, “Hey, everything is on this one card”, you&#8217;ve really reduced your cost of accounting and simplified your life. So that&#8217;s one thing I would say is really important.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [20:10]<\/strong>       I&#8217;d say the other one that&#8217;s important is what&#8217;s your go-to market? What&#8217;s your differentiation? So I don&#8217;t care how big you are, when you’re hanging up your shingle it&#8217;s a pretty competitive world out there. If you understand how you&#8217;re different, that&#8217;s when you can start using marketing effectively, and I&#8217;m sure some of your clients see this. I think sometimes people think because they&#8217;re a freelancer, they don&#8217;t have to worry about their personal positioning, their personal branding, what makes them distinct, and I think actually, you have to worry about even more. So I would invest and tactically just get one card. Get on that if you&#8217;re going to start doing business on your own, but the other is, okay, what&#8217;s your angle? That&#8217;s going to help you then reflect so whether it&#8217;s in your social media, or in some cases, people are even doing paid marketing, whether it&#8217;s local on Yelp. It depends on again, your contract or whatnot but I&#8217;ve seen people make mistakes on that front because they think, “Oh, I&#8217;m just going to go out there and get going and start.”<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [21:09]<\/strong>     Yeah, I love that first piece of advice. I did not do that but I moved to it pretty quickly &#8211; getting a credit card under the business, not only just to build up credit for it, but it keeps everything so organized and separate from personal and probably the biggest thing is if you get the right one, you’ve earned thousands of dollars in free points, just running normal business practices.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [21:32]<\/strong>     Exactly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [21:36]<\/strong>     I knew that stuff existed but I think when you run a business, you&#8217;re spending a lot more typically than you are personally and that adds up. I can&#8217;t even say how amazing that has been.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [21:50]<\/strong>     Exactly. You might have $30-40,000 in expenses. You&#8217;re talking about a lot of money, that could pay for flights, that could pay for meals. It&#8217;s real and so I think that&#8217;s another great reason to do that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [22:04]<\/strong>     No, absolutely. That&#8217;s a great point. So just you personally, obviously, you&#8217;ve had quite a bit of success in your career. I&#8217;m just kind of curious, what are the things that you pay attention to or use to continue to learn, stay on top of the curve? What do you read? What do you listen to, just things along those lines?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [22:27]<\/strong>     So I think, a lot of my team that you know will tell you I&#8217;m a bit of a nerd here. One of my favorite things to say is, “Everyone should continuously improve” and I think I love this idea of beginner&#8217;s mind. There&#8217;s a Japanese word called Kaizen, which means continuous improvement. So that&#8217;s one book that I love. It&#8217;s specifically around a process that they did for manufacturing, but the principle of it I like, and so I love this question. In terms of staying up to date, I&#8217;m just a pretty voracious reader. I read about a book or two a week and I try to follow accounts on social media for people that are interested in self-improvement, productivity hacks, whatnot, and I engage in conversation. I&#8217;m constantly posting. I&#8217;m actually very active, asking people for recommendations either on Twitter or Facebook for book lists, for things to read. So I think much like what we believe at Hyke in terms of us engaging the community to help us chart our future, I actually leverage social media pretty heavily to understand what the people I admire, what the people I think are doing great things are learning and reading, and then I can curate my list of improvements.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [23:44]<\/strong>     Awesome. Love it. I always love asking this question. So to me, I always believe that life really stems down to what do you get excited about. I&#8217;m always pursuing things that I get excited about personally and professionally, so I&#8217;m kind of curious. In your life, personally or professionally, what is it that you&#8217;re super passionate about that you’re excited about above all in terms of what you do?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [24:09]<\/strong>     So I don&#8217;t know if you&#8217;re a Disney fan, but at Disney World and in the Disney Empire, they have this term called Imagineer.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [24:21]<\/strong>     Yep.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [24:22]     <\/strong> And they are forging a reality that they envision with their imagination. So I always think of myself that way. So from a young age, I was drawing all the time or I play guitar or I&#8217;m writing or I&#8217;m coding. So for me, taking something from an idea and seeing it come to life is a huge joy for me, which is why for me, entrepreneurship is the ultimate creative platform. You create a business [that] didn&#8217;t exist before. And not only are you seeing your dream come to life but in the case of Hyke, we have a bunch of people who are aligned on the same mission, and what we&#8217;re doing is now we&#8217;re unlocking your dreams. You come and work with us and we&#8217;re helping you unleash that. So it&#8217;s this exponential compounding of that joy, if you will, of creativity. So I would say anything that involves creating a more positive world. Sometimes I want to do a one on one, draw a picture or jam on my guitar, but the realization that truly has been entrepreneurship, being an entrepreneur, and now serving entrepreneurs at a huge scale I hope. Hundreds of thousands of people we can help and make their lives better and realize those dreams.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [25:41]<\/strong>     Yeah, no, I love that. It was a while ago but I got to go on that tour. They have a tour where you can go behind the scenes at Disney and see how they do what they do. It&#8217;s pretty amazing how the&#8211; Most people don&#8217;t realize what goes into everything that they create and provide in terms of that experience, so that speaks to me. I definitely know what that&#8217;s all about. So this has been great. Is there anything that I didn&#8217;t ask you today that you think might be helpful for the audience that you&#8217;d want to share?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [26:15]<\/strong>     I would say the only thing, you had asked me about some tips, I&#8217;m going to give a free one.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [26:20]<\/strong>     All right. I like it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [26:21]<\/strong>     For those folks that are in business for themselves, or they&#8217;ve been operating either as an LLC or a sole profit and they&#8217;ve been hearing about S corps. If you form as an S corp, let&#8217;s call it ballpark before September 15<sup>th<\/sup>, even though you&#8217;ve been operating in a different formation structure, whether it&#8217;s us, whether it&#8217;s another accountant, they can take all of that revenue and expenses and you can realize the benefits of an S corp even though you weren&#8217;t operating as it. So I would say run and get that done before the 15<sup>th<\/sup>. Have someone set that up for you so you can realize that savings because as you know, it&#8217;s a lot of money. So if you don&#8217;t do it, then this entire year of revenue and expense will be classed as what you had before and you might be leaving $5-10,000 on the table. So hopefully I just gave whoever&#8217;s listening here five, 10 grand.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [27:15]<\/strong>     Yeah, I can firsthand say that that has been the case for us. We got that advice from you and immediately reclassified as that, and we&#8217;ve definitely saved a ton of money. And that&#8217;s something I would never have known. As a business owner, you don&#8217;t think about these things. Another great example, I had a mortgage lender friend of mine just throw out there a couple months ago, “Hey, have you thought about refinancing?” Because I am not thinking about it. I’m running a business. Then I did and we saved a ton of money. It&#8217;s just business owners are so busy just running their business, they don&#8217;t have time to think about these sorts of things. So it&#8217;s stuff like that, that you really stand to benefit from when you have an ongoing partner like Hyke. I love what you&#8217;ve done from a disruption standpoint with this type of offering. I think every business should really take a hard look at it because it&#8217;s been fantastic for us. So before we head off, the last thing I want to just throw out there is where can people find you?<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [28:14]<\/strong>     So, if you are interested in Hyke, please check us out at H-Y-K-E.me, hyke.me. If you want to follow me, I&#8217;m @hoomanradfar on Twitter, H-O-O-M-A-N Radfar R-A-D-F-A-R on Twitter.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [28:29]<\/strong>     Awesome. And just for Socialistics listeners, you actually get to say 50% off your first two months. You can either use the code “socialistics20” or just go ahead and click the link below in the show notes or wherever you see it and you can save yourself a few bucks getting started with Hyke, again, I highly recommend it. Hooman, thank you so much for your time today. It was a pleasure talking to you and getting to learn more about Hyke and your background and I’m just really excited about continuing to work with you guys in the future.<\/p>\r\n\r\n\r\n\r\n<p><strong>Hooman:  [29:02]<\/strong>     Thanks so much for hosting and I look forward to continue to partner with you and hopefully we can do this again sometime.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:       [29:06]<\/strong>     Awesome. Thanks a ton again. That&#8217;s it for this episode of Socialistics. We will catch you next time. Thanks for listening.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Hooman Radfar, CEO of Hyke, a tax planning and management service for small business owners and freelancers. We&#8217;ve been with Hyke for about a year and they&#8217;ve been a tremendous partner by managing all our tax needs. We discuss how Hyke came to be, how they disrupt, and Hooman&#8217;s [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7058,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Hooman Radfar, CEO of Hyke, a tax planning and management service for small business owners and freelancers. We&#8217;ve been with Hyke for about a year and they&#8217;ve been a tremendous partner by managing all our tax needs. We discuss how Hyke came to be, how they disrupt, and Hooman&#8217;s [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-30T16:24:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"27 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-hooman-radfar\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#webpage\",\"url\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/\",\"name\":\"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#primaryimage\"},\"datePublished\":\"2020-08-30T16:24:00+00:00\",\"dateModified\":\"2021-01-14T17:39:07+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/","og_locale":"en_US","og_type":"article","og_title":"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics","og_description":"This week I sat down with Hooman Radfar, CEO of Hyke, a tax planning and management service for small business owners and freelancers. We&#8217;ve been with Hyke for about a year and they&#8217;ve been a tremendous partner by managing all our tax needs. We discuss how Hyke came to be, how they disrupt, and Hooman&#8217;s [&hellip;]","og_url":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-08-30T16:24:00+00:00","article_modified_time":"2021-01-14T17:39:07+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/08\/image-19.jpg","size":"full","id":7058,"alt":"socialistics-podcast-hooman-radfar","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"27 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-19.jpg","width":560,"height":315,"caption":"socialistics-podcast-hooman-radfar"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#webpage","url":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/","name":"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#primaryimage"},"datePublished":"2020-08-30T16:24:00+00:00","dateModified":"2021-01-14T17:39:07+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Hyke: Revolutionizing Tax Management For Agencies with CEO Hooman Radfar"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5168"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5168"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5168\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7058"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5168"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5168"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5168"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}