{"id":5174,"date":"2020-09-10T17:37:00","date_gmt":"2020-09-10T17:37:00","guid":{"rendered":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar-copy\/"},"modified":"2021-01-14T17:39:00","modified_gmt":"2021-01-14T17:39:00","slug":"the-power-of-saying-no","status":"publish","type":"post","link":"https:\/\/socialistics.com\/the-power-of-saying-no\/","title":{"rendered":"The Power Of Saying No"},"content":{"rendered":"\r\n<p>Sometimes walking away from an opportunity is the best thing you can do. Not every potential client will be a good fit, and in this week&#8217;s episode, I share:<\/p>\r\n\r\n\r\n\r\n<ul>\r\n<li>Why learning to say no is one of the best things you can do as an agency owner<\/li>\r\n<li>What&#8217;s it&#8217;s critical to establish what you&#8217;re worth and stick with it<\/li>\r\n<li>How to establish early on with leads so you can save time<\/li>\r\n<\/ul>\r\n\r\n\r\n\r\n<p>If you&#8217;re an agency owner be sure to check out <a href=\"https:\/\/jasonswenk.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Jason Swenk<\/a> and all his incredible agency resources as well as <a href=\"https:\/\/www.poddecks.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Pod Decks<\/a> for some great insight on podcasting.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5310457\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5310457-the-power-of-saying-no.js?container_id=buzzsprout-player-5310457&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>[00:01]<\/strong>     In this week&#8217;s episode, I&#8217;m flying solo, but sharing some really great insight into the power of no and how being more selective with who you work with can save you a tremendous amount of time, money, and potential headaches. It&#8217;s made a huge difference for our agency and I hope sharing our experiences can help you do the same.<\/p>\r\n\r\n\r\n\r\n<p><strong>[00:29]<\/strong>     Hello, and welcome to another episode of the Socialistics podcast &#8211; Social Media Agency Stories. This week I want to take a little bit of a break from our interviews and dive a little bit more deeply into some internal happenings with our agency as promised. It&#8217;s been a crazy week, a crazy month to be completely honest with what&#8217;s been going on with us here at the agency. Lots of leads are coming in. We&#8217;ve been in business for about two and a half years, and the advice I was given early on is that most agencies hit their sweet spot at about the three-year mark, and I think it&#8217;s true. For whatever reason, we&#8217;ve basically started to hit our stride. The pandemic certainly threw us for a loop a bit, so what things have looked like for us this year has been a little bit unique. But now that businesses are realizing that they got to get serious about their digital marketing, things are getting somewhat back to normal, at least from a business standpoint. So it&#8217;s been crazy. It&#8217;s really exciting. And our ultimate goal to become a million-dollar agency is well on its way. I don&#8217;t know if we&#8217;ll hit it by the end of the year but with the pace that we&#8217;re going at, it won&#8217;t take too long before we hit that which is crazy to think that we&#8217;re that close, so that&#8217;s pretty exciting.<\/p>\r\n\r\n\r\n\r\n<p><strong>[02:04]<\/strong>     Some other things, I&#8217;ve joined a digital agency mastermind group. Some of you that are listening that are either agency owners or in the agency world have probably heard of the name Jason Swenk. I&#8217;m a big fan of his podcast. This podcast is a direct result of his constant advice around having a podcast if you have an agency. But his stuff is great and I pulled the trigger and decided to join their digital mastermind group and literally one group call in and it&#8217;s paying dividends. I&#8217;m really excited about being a part of that group and really sharing what I learned from that group. Being surrounded by other agency owners, many of which are much more successful than we are is a good thing. We have a lot to learn, and I&#8217;m excited to be a part of that group.<\/p>\r\n\r\n\r\n\r\n<p><strong>[02:52]     <\/strong>And then lastly, this podcast has just been&#8211; I really love doing this, especially in the current environment, when it&#8217;s difficult to connect with folks, it just is an outlet for me, and the opportunity to speak with really interesting, smart, successful people is a lot of fun. So I really hope that this continues to grow and provides value to whoever&#8217;s listening to it. And one of the things I went through this past week is doing a little bit of what&#8217;s called a Fearless Feedback that I went through with a group called Pod Decks. It&#8217;s an interesting little group that basically of folks just learning about podcasting. And I kind of put myself out there, put this podcast out there for some feedback, and learned some really great things. And one of the things that I was well aware of, but hearing it from other folks just reinforced it, is I got to work on my “uhs” and “ums”. So this episode is another attempt at me really trying to work at that. So if you&#8217;re listening to this, take note or keep doing an “um” or “uh” tracker and let me know how I actually do. I&#8217;m literally thinking about it in my head right now, trying to force myself to be comfortable with pauses and not filling those gaps with “uhs” and “ums”, so hopefully this is a step in the right direction.<\/p>\r\n\r\n\r\n\r\n<p><strong>[04:14]<\/strong>     So, there we go. But this week, I wanted to talk about the power of no and how it can be the most powerful word in your vocabulary as an agency owner. It seems like a simple thing, but when you&#8217;re just starting out and you&#8217;re in the beginning stages, it&#8217;s really hard to do that. It&#8217;s still hard, even for me to say no to new opportunities. At the end of the day, when you&#8217;re running an agency, you want to drive revenue. You want to make sure that you&#8217;re thriving, that you have work for your people, and that you build a buffer so that you get to that point where not only do you feel like you&#8217;ve turned the page and you never have to look back but you want to grow, and it&#8217;s hard to say no to opportunities. So that&#8217;s one of the biggest things that I&#8217;ve learned over time and continue to learn, how to do that and why to do that. I know when we first started out, I took everything. Practically any new opportunity that presented itself to us, we took in, for the most part, you kind of have to in the beginning when you&#8217;re just starting your agency. You have to take some risks, and maybe take a little bit less than what you&#8217;re comfortable with, and that&#8217;s expected. You can&#8217;t be too super picky in the beginning, so this advice really doesn&#8217;t apply to if you&#8217;re starting out in day one. I mean, it does but not as significantly as it might once you kind of build a little bit of a portfolio of work and get some momentum going. But you do got to get to a point where you&#8217;re a little bit more selective about the work that you take on, and we&#8217;ve learned that the hard way.<\/p>\r\n\r\n\r\n\r\n<p><strong>[06:08]<\/strong>     People ask me, what makes a great client for Socialistics? And it&#8217;s never really a specific industry or anything like that. What it really comes down to is usually three things. And the first is that the business that I&#8217;m talking to doesn&#8217;t have to be convinced that they need to have a marketing budget. If a business doesn&#8217;t agree with that or isn&#8217;t comfortable with marketing being a line item in their P&amp;L, in their planning, and their budget, that&#8217;s a bad situation. That&#8217;s a super big red flag for me because you&#8217;re going to get somebody that will not have the patience and realistic expectations about what marketing can and should do for their business, and it&#8217;s not going to end well. So that&#8217;s a big red flag. Number two is do they have a product or service that&#8217;s wanted or needed, can differentiate, is unique, has a story? Good marketing doesn&#8217;t fix bad products. So that&#8217;s one of the things that we look for. What they&#8217;re doing, is it a good product? Is it a good service? Are people going to want it? Is it priced well? But also what goes in hand with that is, is their website good? Is it functional? Does it actually lend itself to converting people? Do they have their shit in order? Good marketing doesn&#8217;t fix bad user experiences with a product or service. Our job is to create opportunities for business, it&#8217;s their job to close that business. So you need to make sure that some things are in order before you’re really throwing a lot of money at marketing your social media.<\/p>\r\n\r\n\r\n\r\n<p><strong>[07:59]<\/strong>     And then the third is, can we help them? Do I honestly feel like our agency can help grow their business, actually make a considerable impact on their business? Those are the three things that I look for. If I can answer confidently yes to those three things, then that&#8217;s a conversation that I want to continue. But if they don&#8217;t hit on those things, then I have to say no, and sometimes that&#8217;s really hard because maybe they hit on two out of the three. But we really have gotten to a point where we&#8217;re just a little bit more selective about that. Because one of the things that we do that differentiates us is we&#8217;re a month to month agency, which drives a lot of other agencies nuts because that is not typical, more typical now than it was when we first started out because&#8211; I am not naive. I&#8217;m not going to say that we pioneered month to month but I think a lot of other agencies are starting to move to that model because long term contracts only benefit agencies. And when I started it, I certainly intended it to be a differentiator out of the gate. Then once we kind of got some momentum, then maybe we can move into traditional long term contracts. But what I learned over the years is that it really didn&#8217;t matter. As long as we did great work, delivered results, treated clients well, they stick around anyway. Why would they leave a situation like that? We&#8217;ve had tremendous retention when it comes to clients. And not forcing clients to be a month to month contracts, they love it. It&#8217;s a great differentiator for us. But that being said, if you&#8217;re going to do that, you got to know when to say no. You don&#8217;t want to put yourself into a business relationship that isn&#8217;t going to be mutually beneficial because it&#8217;s not going to end well. So you really have to be selective about who you work with in those ways.<\/p>\r\n\r\n\r\n\r\n<p><strong>[10:08]<\/strong>     And another part of that is, you got to know your worth. You got to really work hard to feel confident and comfortable with what you charge for what you do. And nine times out of 10, most new agency owners or people starting out undervalue themselves. I know that we did. And the reality is that can change over time. You get better at what you do, you build your team out, you&#8217;re able to do more, so that can be a sliding scale. But you need to know what you&#8217;re worth and feel confident charging that. When we first started, I was all over the place with that because I was just trying to land business and I’d do whatever I had to do. As long as I could, even at the very least breakeven, I&#8217;d take it. And again, when you&#8217;re first starting out, you might have to take a couple like that but once you start getting into a rhythm, you really need to charge what you&#8217;re worth, and only you know what that is, what that number in your head is. If I&#8217;m doing this work for this amount, I feel really good about that. It allows us to be at a profitability that I&#8217;m comfortable with and where I want to be. Because the fact of the matter is, if you charge somebody less so or you take things more inexpensively, that&#8217;s what you&#8217;re worth to a client. And it&#8217;s very difficult to go back to them to raise your rates, to increase what you charge them. So you really want to make sure that you come out of the gate establishing your value.<\/p>\r\n\r\n\r\n\r\n<p><strong>[11:46]<\/strong>     And look, you&#8217;re going to lose opportunities. I&#8217;ve had plenty of leads that come in, that aren&#8217;t a fit financially. They&#8217;re not comfortable with spending a couple thousand dollars on their social media and that&#8217;s okay. I used to avoid talking about price in the beginning because it always felt so uncomfortable to me. I wanted to make sure that I could get into a level of depth with them about who we are and what we do and how we do it, and there&#8217;s some truth to that. But the fact of the matter is, when you start scaling, and you start getting a lot of leads, and you start getting a lot of phone calls, you have to start to pick your battles. You don&#8217;t want to spend 45 minutes on a phone call with somebody and then in the 43rd minute, get to the topic of price, you tell them and then they&#8217;re like, “Oh, well, I can&#8217;t afford that. That&#8217;s twice as much as what I thought it would be.” And then now you&#8217;ve just wasted 45 minutes. I&#8217;ve done that, it&#8217;s happened, it&#8217;s frustrating. Look, I&#8217;m not saying every call or every lead that you speak to out of the gate you lead with that. You just kind of have to get a sense of &#8211; and you will over time. If you do your preliminary research, you&#8217;ll get a kind of a sense of who they are and where they are at the market.<\/p>\r\n\r\n\r\n\r\n<p><strong>[13:11]<\/strong>     We do a lot of B2B work, so we can tell pretty quickly whether this is a business that&#8217;s been around. With a little bit of recon, we can tell what size company they are, and whether price is something that&#8217;s going to be an issue to them. So, for us, it&#8217;s really&#8211; We get into situations more with like startups, or businesses that are still relatively new. That&#8217;s where sometimes I feel like we need to address kind of a range of budget for what we do before going too deep. And I&#8217;ve had plenty of instances where that&#8217;s probably saved me a ton of time. And look, they appreciate it too. I always lead with, “Hey, typically I don&#8217;t lead with price, but based on where you&#8217;re at and what we&#8217;re seeing, I just wanted to make sure that I&#8217;m respectful of your time.” I always lead with that. Like, “I&#8217;m going to lead with this, in case this number kind of scares you away. It&#8217;s not where you&#8217;re at. I don&#8217;t want us to spend 30 minutes on a call and waste your time if we&#8217;re not a good fit logistically” and people appreciate that. So we do that quite a bit. And look, there&#8217;s a ton of tire kickers and window shoppers out there that their priority is spending as little as possible to have their social media managed or for marketing. That&#8217;s a big red flag. You don&#8217;t want tire kickers, you don&#8217;t want window shoppers. You don&#8217;t want people that are thinking more about “What is this going to cost me?” and less about “What is this going to do for me?” That&#8217;s a red flag. You should immediately walk away from those sorts of situations.<\/p>\r\n\r\n\r\n\r\n<p><strong>[14:48]<\/strong>     Another way to kind of gauge that is the difference between somebody doing a proposal or doing a pitch. If a client or a potential client says, you know, you spent 30 minutes on the phone with them and it sounds like there&#8217;s some opportunity there potentially and you get to a point where you&#8217;re discussing next steps and you want to kind of establish or set up a time to maybe do a pitch for them, which is much more effective than just emailing them a proposal or document. They&#8217;re not willing to do that? That&#8217;s a red flag. If they&#8217;re not willing to give you the time to&#8211; Look, it&#8217;s a lot of work to put together a pitch. And if you&#8217;re good at it, there&#8217;s some repeatable process, but you&#8217;re going to put some time into it. If they&#8217;re not willing to put any time into it, that&#8217;s a red flag because businesses don&#8217;t get to just hand this off and not be an active participant, it doesn&#8217;t work that way. They have to be involved. They have to spend a little bit of time, especially upfront with this. So if they&#8217;re not taking it seriously, if it&#8217;s not worth them spending an hour with you to go over what you can do for them, red flag. Walk the other way, say no, because if that&#8217;s the case, they&#8217;re a tire kicker. They&#8217;re just window shopping. They&#8217;re just looking for the best deal. And that&#8217;s not a situation that you want to be in.<\/p>\r\n\r\n\r\n\r\n<p><strong>[16:12]<\/strong>     It&#8217;s hard, especially when you&#8217;re starting out but if you&#8217;re thinking of starting an agency or in the beginning, you got to have patience, you better have a runway for success and take time. That&#8217;s been the most educational part of the journey that I&#8217;ve been on with this agency is I&#8217;m always wanting to grow more. I wish we had more leads. I wish we were landing clients more quickly. But the fact of the matter is, if you do things the right way, and you scale with the right clients, the velocity of your success isn&#8217;t going to be, you know, it’s not going to all happen as quickly as you would like. Good clients are hard to find. There are a lot of competing agencies, so it takes time. I&#8217;ve been fortunate to have had a little bit of a runway to allow for getting good clients and having the patience for those opportunities and being able to say no to the ones that I know aren&#8217;t going to end well.<\/p>\r\n\r\n\r\n\r\n<p><strong>[17:13]<\/strong>     If you&#8217;ve got people out there that are just shopping, send them to the $99 socials, the 98 bucks socials. These outfits that just churn out content and slap it on their social media channels, it accomplishes nothing. All the power to them. There are plenty of small businesses that can&#8217;t afford to spend thousands of dollars on their social media but I always tell clients like what&#8217;s the point? What is the point of paying somebody to do your social media if it does nothing other than just making you feel better because there&#8217;s stuff out there? So what? My question to potential clients is, how many leads can you attribute to your social media efforts? How many sales can you attribute to what you&#8217;re doing with social? And if you can&#8217;t answer that question, what are you doing? Why are you wasting all the money on that? You need to work with somebody that holds himself accountable to that. And honestly, that ain&#8217;t cheap. It isn&#8217;t. Being able to specifically measure leads, sales, measurable results for businesses, results-oriented reporting, it&#8217;s not cheap. You need experienced, intelligent people that take a good amount of time with your marketing for your business, and it&#8217;s not cheap. The right businesses know that, and you&#8217;ll know that when you get on the calls with them.<\/p>\r\n\r\n\r\n\r\n<p><strong>[18:48]<\/strong>     So saying no can be an incredibly powerful thing for your agency, and it&#8217;s uncomfortable, but it&#8217;s the best thing that we&#8217;ve ever done because it saved me a ton of time. It makes the lead analysis easier when you’re just upfront when you have to be with opportunities that you&#8217;re not sure of based on limited information. It&#8217;s always good to lead with those things a little bit because you&#8217;ll know quickly if somebody&#8217;s just window shopping or if they&#8217;re really serious about working with a strategic partner, and aren&#8217;t scared of spending what it takes to do that. So it&#8217;s one of the best things that we&#8217;ve ever done and I hope that taking you through what we&#8217;ve experienced, helps you in some way if you&#8217;re an agency owner, aspiring agency owner, or maybe a prospective client. Maybe this was hopefully interesting to you.<\/p>\r\n\r\n\r\n\r\n<p><strong>[19:51]<\/strong>     So that&#8217;s going to be it for this week, so thank you again, for listening. Please share this with any of your colleagues, friends, your networks. And I think I did pretty good on the “ums” and “uhs”. I think I did about four or five. Definitely a lot less than previous episodes. So I&#8217;ve got to work on that. Thank you for listening. Please like, share, leave a review, and we will catch you next week with another episode of Socialistics. Take care, everybody,<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Sometimes walking away from an opportunity is the best thing you can do. Not every potential client will be a good fit, and in this week&#8217;s episode, I share: Why learning to say no is one of the best things you can do as an agency owner What&#8217;s it&#8217;s critical to establish what you&#8217;re worth [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7056,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Power Of Saying No - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/the-power-of-saying-no\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Power Of Saying No - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Sometimes walking away from an opportunity is the best thing you can do. Not every potential client will be a good fit, and in this week&#8217;s episode, I share: Why learning to say no is one of the best things you can do as an agency owner What&#8217;s it&#8217;s critical to establish what you&#8217;re worth [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/the-power-of-saying-no\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-10T17:37:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"17 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/#webpage\",\"url\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/\",\"name\":\"The Power Of Saying No - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/#primaryimage\"},\"datePublished\":\"2020-09-10T17:37:00+00:00\",\"dateModified\":\"2021-01-14T17:39:00+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/the-power-of-saying-no\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-saying-no\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Power Of Saying No\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Power Of Saying No - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/the-power-of-saying-no\/","og_locale":"en_US","og_type":"article","og_title":"The Power Of Saying No - Socialistics","og_description":"Sometimes walking away from an opportunity is the best thing you can do. Not every potential client will be a good fit, and in this week&#8217;s episode, I share: Why learning to say no is one of the best things you can do as an agency owner What&#8217;s it&#8217;s critical to establish what you&#8217;re worth [&hellip;]","og_url":"https:\/\/socialistics.com\/the-power-of-saying-no\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-09-10T17:37:00+00:00","article_modified_time":"2021-01-14T17:39:00+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/09\/image-18.jpg","size":"full","id":7056,"alt":"socialistics-podcast","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"17 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/the-power-of-saying-no\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-18.jpg","width":560,"height":315,"caption":"socialistics-podcast"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/the-power-of-saying-no\/#webpage","url":"https:\/\/socialistics.com\/the-power-of-saying-no\/","name":"The Power Of Saying No - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/the-power-of-saying-no\/#primaryimage"},"datePublished":"2020-09-10T17:37:00+00:00","dateModified":"2021-01-14T17:39:00+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/the-power-of-saying-no\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/the-power-of-saying-no\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/the-power-of-saying-no\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Power Of Saying No"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5174"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5174"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5174\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7056"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5174"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5174"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5174"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}