{"id":5179,"date":"2020-08-09T16:05:00","date_gmt":"2020-08-09T16:05:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5179"},"modified":"2021-01-14T17:39:42","modified_gmt":"2021-01-14T17:39:42","slug":"website-agency-disruption","status":"publish","type":"post","link":"https:\/\/socialistics.com\/website-agency-disruption\/","title":{"rendered":"Website Agency Disruption With Leland Dieno, VP at Agency.Media"},"content":{"rendered":"\r\n<p>This week I sat down with Leland Dieno, Vice President at Agency.Media, a website design and development house based outside of Vancouver, B.C. We&#8217;ve had a terrific experience thus far partnering with them on our web projects, and in this episode we discuss all things website development and agency partnerships.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-4855037\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/4855037-website-agency-disruption-with-leland-dieno-vp-at-agency-media.js?container_id=buzzsprout-player-4855037&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [00:09]<\/strong>      Hey, and how are you doing? This is Jason Yormark for the Socialistics episode. Welcome to the fifth episode. We&#8217;re having an incredible time doing this and I&#8217;m excited today with our guest. Full disclosure, we partner with them. It&#8217;s called Agency Media and they do some incredible work around web. And I had the opportunity to go out there and meet with the team and I&#8217;ve been really looking forward to making the partnership work. As soon as we had some clients have some web needs and we&#8217;ve started to work together, it&#8217;s been a fantastic partnership. I really like these guys. To me, the name of the game is &#8220;stay in your lane, do what you do, and when you have clients that have other needs, have partnerships to fill the gaps&#8221; and that&#8217;s certainly been the case here. So I want to welcome Leland Dieno from Agency Media. Welcome.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [01:00]<\/strong>      Awesome. Thank you for having me. When you came up, were you able to jump in a helicopter?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [01:05]<\/strong>      No. That was the plan and then it was too cloudy, so we couldn&#8217;t do it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [01:09]<\/strong>      That&#8217;s right. So once the COVID thing settles down, we have to get you back up then now.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [01:14]<\/strong>      It&#8217;s the only way I&#8217;ll probably ever get into a helicopter. So, I am down for that. I&#8217;m definitely down for that. So, I look forward to it. So welcome to the show. I really loved spending time with you guys, super impressive, but let&#8217;s just dive right in. I want the audience to learn a little bit more about you and Agency Media. So, kind of give us the background around all that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [01:36]<\/strong>      Awesome. Yeah, so I&#8217;m the vice president of Agency Media. We&#8217;re located in Langley British Columbia, which is a community just outside of Vancouver, on the West coast. Our primary verticals in the marketing space are video production and web development\/SEO. So, we do a lot of high-end videos &#8211; a lot of our video productions have ended up on TV &#8211; and then on the flip side, we work with entrepreneurs and startups on lower priced video, but still that same quality. Then on the other side, we have web, and in web we&#8217;re super passionate about web development and we chatted earlier about the word disrupt but on disrupting our focus was originally starting on [disrupting] the local web industry but that&#8217;s kind of grown to almost more of a North American disruption. At the end of my days hopefully, I&#8217;ll be able to write a book about it or something, some geeky title like Disrupting the Web Industry.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [02:37]<\/strong>        I&#8217;ll go through my background really quickly. I&#8217;m a seasoned guy in digital marketing. I have a tech background. I worked for a large grocery company up here in the IT department for several years, but while I was working in IT, I was always building websites and working on digital strategy for my own initiatives and friends and family. So I eventually created a position for myself within the grocery company named Save-On-Foods up here in the marketing department, but as kind of their digital tech guy, and it was just as everything was kind of moving in a tech direction. Social media was starting to be actually taken seriously. Websites had to be looked at pretty regularly. So I kind of created this position and I found myself to be a solid threat in my environment because I had the tech background. So, my role there was digital strategist and I primarily worked on managing web development projects, growing social media and things like that but my passion was definitely web.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [03:44]<\/strong>        From there, I went on to work at a university and managed their digital marketing department there. Again, web was kind of the bulk of my work. And over the years I found myself always being involved in managing web projects. So managed a lot of web developers hired and fired a lot of web development agencies. That&#8217;s kind of my claim to fame is that I&#8217;ve fired too many to count &#8211; agencies &#8211; for not bringing the value that I thought that they should have. But also had the opportunity to work with some really great ones throughout the years on multiple web projects from being the first grocery company to offer e-commerce delivery in Canada, to small microsites and a university website overhaul working with some great partners. So although that&#8217;s probably 10 to 15 years of my career.<\/p>\r\n\r\n\r\n\r\n<p><strong>                 [04:31]       <\/strong>Then I bumped into this entrepreneur named Andrew Westland up here who owns our company. And we&#8217;re a part of a group of companies as there&#8217;s about 12 of us now. It ranges from a helicopter company to a wireless cellular dealer to a drone training company and then to us, Agency Media. We were originally birthed to service the internal companies with video production and digital marketing, but over the years, it expanded to servicing our own clients. And we work with clients as big as our government-owned ferries company up here to big grocers. And then, <strong>[John Deere Deere attaching 05:09]<\/strong> to some smaller startups and things like that. So we&#8217;re right in the trenches and we work with multiple different variations of clients and services that they need in terms of price points. But where my expertise&#8211; Sorry, this is long-winded. I didn&#8217;t plan for it to be this long. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [05:28]<\/strong>      Not a problem. Good stuff.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [05:30]<\/strong>      Where my expertise came in was, I&#8217;m really passionate about web and I realized that, after hiring a lot of web agencies and working on so many web projects, you know, hundreds over, over a decade plus, there was a lot of gaps in the process and those gaps, I felt really were a detriment to the value of the end product. I think you kind of run into some agencies that are heavily designed focused and they want to make the best-looking website possible, and there&#8217;s a lengthy process around that that costs a lot of money. Then on the other side, you have web agencies that are not focused at all on the design and look and feel, and it&#8217;s more functional. And then you either end up with one or the other, but an over hierarchy or an overarching issue was the lack of performance. So, I remember I was in a situation where a website was launched and I reached out and I asked a few questions about like, where&#8217;s the site map, so I can add it to Google search console and make sure our SEO is performing. And they&#8217;re like, “Well, you have to pay us more for that”, and the reality was, I knew it took five minutes to do that. So, anyways, go to go back to meeting Andrew Westland, he kind of got fed up with the web industry himself. He was like, “You know, this is costing so much money and these websites aren&#8217;t performing. They look great but we need to do something here. We got to disrupt this. How can you help me build a model to be able to go out to clients and offer them a much better price point with the same process?” And that&#8217;s essentially what we did.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [06:56]<\/strong>        So, I&#8217;m an operations guy heavily focused on creating processes, stress testing them over and over until they&#8217;re optimal. Built that out; we ended up doing over a hundred websites in a year at a really effective price point and I think we did disrupt the local industry quite a bit. Obviously, we acquired that many clients, which took it away from other web agencies that weren&#8217;t delivering that same value, but basically from there, we went on to partnering. I kept being asked by local agency friends and business owners that I knew like, “How are you guys doing this?” And I just came back to “It&#8217;s process, it&#8217;s process”. And so we started realizing, “Hey, there&#8217;s an opportunity to start partnering with other agencies in North America that aren&#8217;t in our vertical. So there&#8217;s not going to be overlapping and worrying about competition and help them scale their web division of their business. And that&#8217;s what we&#8217;ve been doing for about the last six months and so far so great.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[07:53]<\/strong>      Yep. That&#8217;s one of my favorite words is disruption and I&#8217;ve talked about it a little bit in previous episodes. When I launched [Socialistics], I put myself in the mindset of the client that I wanted to attract. And I really tried to think “What do they hate about agencies? What are the things that frustrate them? If they could design an agency and what that would look like, what would be the top three or four things that would really make it an incredible experience for them?” And that&#8217;s really where we built from. So I&#8217;m kind of curious, when you think about Agency Media and what you&#8217;ve been able to do in terms of disruption, what are the top two or three things that you really feel separate you guys from the pack that has allowed you to kind of disrupt and attract more business than competitors?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:<\/strong>    <strong>[08:42]<\/strong>      I think, yeah, it&#8217;s a great point or it&#8217;s great to point out that I think, like you said previously to me before we started, every agency and digital marketing person out there says that they&#8217;re doing something unique and it&#8217;s a better price point or whatever the case may be. I think it comes down to value. I think where we started, especially even with our web businesses&#8211; Okay, you have a website and it&#8217;s a property online and it needs to look good and there needs to be a lot of effort put into the process of building it, but how is it impacting your business? If you&#8217;re going to send traffic to it with social, organic or paid, is it actually benefiting your business or is it a detriment? That&#8217;s where the thinking always comes in terms of how we go about building our processes. But the other thing again is just value.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [09:33]<\/strong>        I know including copywriting and SEO and keyword research throughout a web development process is almost unheard of. I don&#8217;t think I ever encountered that when I had hired agencies, even the best ones I worked with. So it was a no brainer for me to figure out how to process, with the right people involved, how to do those things for our clients. And it makes you come across like you care &#8211; because we do &#8211; but it also provides the client with a lot of value. So keyword research is the big one, right? So, okay, we&#8217;re developing a website for a company, “Here, Mr. and Mrs. Client. Did you know that this is what your actual target market is searching for on Google relating to your products and services? So why don&#8217;t we, instead of just building out these standard pages while we&#8217;re developing this site, let&#8217;s build some pages that cater right to those search terms so you can start acquiring that traffic? So I think it&#8217;s that thought process, and then creating the processes to do it because like you know, agencies become bloated very quickly which makes them have to make their price points very high. And then it&#8217;s also difficult to be able to come in and deliver a bunch of that value operationally when you&#8217;re paying your employees a ton and you&#8217;re having to pay a ton to execute a project.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[10:49]<\/strong>      Yeah, I love that. I always like to use the analogy with websites. We&#8217;ve had a lot of experience. We decided from day one that we didn&#8217;t want to be in the website game, but we knew that a lot of the clients that we would come across needed help with it. We don&#8217;t want to take their money if their website isn&#8217;t effective and where it needs to be. I always use the analogy, “Your house needs to be in order before you invite everybody to the party.” I don&#8217;t want you spending thousands of dollars on paid social campaigns if your website sucks. So a good percentage of the time we come across clients, that needs to be addressed. So having good partnerships where you know you can count on that to get that piece right is critical. The website game is so varied in pricing. I&#8217;ve had opportunities come to me saying they&#8217;ve been quoted 10,000, 50,000, 20,000 for sites that really aren&#8217;t that complex. A lot of times people just get, it&#8217;s a tangible thing. So it&#8217;s like, they can be wowed by, “Oh wow, this looks great.” It&#8217;s like buying a car like, “Oh man, I want that car, it looks amazing.” “Well, have you looked under the hood? Do you know what this car actually can do and what&#8217;s important?” These clients don&#8217;t understand the right questions to ask. And I think that&#8217;s one of the things that I&#8217;ve really enjoyed working with you guys is that you&#8217;re really putting the client&#8217;s best interests first in terms of what&#8217;s going to make their website perform for them and not just be this nice looking thing that acts as a glorified business card. So that&#8217;s really been something that we&#8217;ve really enjoyed with you guys.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [12:25]<\/strong>      Yeah. I think it&#8217;s interesting because right now the web sector is like consumers in general. So a business owner as just a person sitting at home is seeing TV commercials from GoDaddy and other page builders telling them how easy it is to build their own website or to rent a website for so much a month and then at the end of it, there&#8217;s no performance, there&#8217;s no tangible metrics for them to look at to measure if there was an ROI on their investment. And at the same time, yeah, that was kind of the game we were in. It was like, we were in a space of these custom WordPress websites being developed and costing between 20 to 30K. And I was like, “We need to bring that cost way down and we can still do it at a fraction of the price point”, and that was the space we&#8217;re in.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [13:21]       <\/strong>But there&#8217;s also a kid that just graduated university living in his parent&#8217;s basement that&#8217;ll offer to build your website for $500. And then there are all these different things coming at business owners right now and it&#8217;s difficult for them to know which path to go down. So that&#8217;s why we heavily focus so much in those discovery phases with potential clients and showing them what we&#8217;ve done but also conveying that value. Like the importance, like, “Listen, we do believe that it&#8217;s important and it&#8217;s incredibly important that you have a website that&#8217;s built, that looks great. That there&#8217;s a user experience that&#8217;s gone through all those complex processes to put you in a state of where you can measure some success, but you also don&#8217;t need to invest like&#8211;” For me, I tell clients all the time, if you have $25,000 as your marketing budget, I would much rather see you spend five on a website and then the 20 on your ecosystem around it. So build a website that&#8217;s going to perform and that&#8217;s optimal to send traffic to, and then start running, whether it&#8217;s paid social or ads or whatever the case may be, really optimize that ecosystem around your website to deliver the right traffic.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [14:35]<\/strong>      Yeah. I think there are so many times that clients aren’t asking the right questions or partnering with agencies that are helping them get the answers to the right questions, which typically for us, and I&#8217;m sure it&#8217;s similar to web, is, what do you want people to do? What is the action that you want to achieve? Do you want them to provide their email address? Are they purchasing something? What is the action that you want them to do? Who is it that you&#8217;re trying to target? You need to ask those kinds of questions because that&#8217;s going to determine how to develop the user experience. And not only where people end up, but how you try to get in front of them and how you pull them into that ecosystem.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [15:16]<\/strong>      Exactly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [15:16]<\/strong>      So, I think that if there&#8217;s anybody that&#8217;s an agency owner or does something that isn&#8217;t directly involved [with] web and you really need to ensure that you have good partners that know that part of the business. I mean the value for us, I don&#8217;t have to worry about it. The minute I have a client and they have a website need, I know I&#8217;ve got this partnership, they&#8217;re going to take care of them, they know what they&#8217;re doing, they&#8217;re going to set them up correctly. I don&#8217;t have to invest a lot of my time in ensuring that the right process and the ultimate end result is going to be exactly what I need it to be. As an agency owner, it&#8217;s very powerful. That&#8217;s where partnerships work is when you can literally know they&#8217;re just an extension of your business. They&#8217;re going to get it right. I&#8217;m not going to have to invest a lot of time in this piece of it, other than just being informed. And I can concentrate on what our core competency is, in our case, social media. And we just need to wait for that website to be ready to go. So that&#8217;s definitely where we find the value.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [16:17]<\/strong>      In building out a partnership model, which is what&#8211; Basically, so everyone listening kind of understands how that works is we&#8217;re an entrepreneurial company. It&#8217;s a different type of company than I&#8217;ve ever worked for before, but basically, we tracked Jason down online, and we were like, “Okay, this is a company we want to work with.” We reached out and said, “Hey, we&#8217;re going to fly you up here and get you in a helicopter. We want to build this with you.” But where my accountability is for our company and the team that I lead here is that when we deliver something that you&#8217;ve referred, it has to be on point. It has to put you in a situation where, when that&#8217;s done, you&#8217;re now in the most optimal state for you to execute what you need to do, and then have a client relationship going forward, it benefits everybody. I think though, I should point out though as we&#8217;re talking about [it], social media is not something to be taken lightly. In terms of operating an agency and executing social, we&#8217;ve kind of stepped away from it other than our internal stuff because just as much as we talk about web being a difficult process to manage with clients, social is one of those ones where it&#8217;s like, there might not always be an immediate result. But also what I found brutal, and we don&#8217;t need to maybe steer the conversation down this path, but it&#8217;s kind of a kudos to you is dealing with the back and forth of what content looks like on social because the revisions there were what always drove me nuts, I think.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [17:39]<\/strong>       Yeah, the agency game is changing where agencies that are either starting out or shifting towards a niche-based model or focusing in a particular lane, I kind of wrestled with, should we be a generalist because then we&#8217;re going to open ourselves up to more opportunities, or do we pick a lane like social media? And while we won&#8217;t get as many leads, we might have to walk away from some opportunities, but, it&#8217;ll allow us to have a level of depth and expertise that we otherwise couldn&#8217;t have if we were spread out across multiple things. And it&#8217;s been the smartest move that we&#8217;ve made because now it&#8217;s where it&#8217;s paying its dividends. It takes time though. If you&#8217;re an aspiring agency owner, you better have some patience because if you&#8217;re going to take a niche-based approach or pick a lane, it&#8217;s going to take time before that really bears fruit. So if you&#8217;re in it for a quick win, this isn&#8217;t the place for you, but if you&#8217;re really wanting to build something over time, that&#8217;s the way to go, because agencies are consolidating, they&#8217;re buying each other. I&#8217;m waiting for the day that we reach a certain point where one of the bigger ones start knocking on our door and saying, “Hey, we want to talk”, which in and of itself is a validator.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [18:54]<\/strong>       But, yeah, I mean, certainly, back to [what] we were talking about originally is these partnerships have been great for us. But one thing I wanted to kind of glean from this from you actually, to help people that are listening and people that are listening that are either looking for partnerships, but more so  when they think about website, if you had to think about what are the three most critical components of a website or the three most critical questions that a business owner should be thinking about as it pertains to their website, what are the things that you would advise them to really prioritize thinking about when they&#8217;re pursuing a project like that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [19:28]<\/strong>      Yeah. So the first one, and this might counter or be the opposite of what a lot of people in my position would say is, are you able to measure your website&#8217;s performance? It&#8217;s amazed me how many business owners don&#8217;t have insight into what&#8217;s happening on their website, not just analytics, but conversion reporting and search data and things like that. So I think the ability to measure is super critical. And then the second one is, is your website built for longevity? And that&#8217;s a big one is, you need to make sure when you make a decision of embarking on a web development project, that it&#8217;s not being developed nearsighted. So what I mean by that is that it&#8217;s not a quick win for an agency to make a bunch of money off of you, develop a website, and then in three years you have to basically go to the table and redo it again. You need to make sure that as you&#8217;re looking at your website and it is a property, it&#8217;s adaptable, it&#8217;s built on a platform that can adapt and react and assist you in pivoting. I mean, we learned that with COVID quicker than I think&#8211; I think businesses learned that the hard way, but quicker than they ever have before. And that&#8217;s created a lot of conversations for us as we had to change our services to kind of gear more to online, but we had no way to do it on our website because our website was hand coded and it locked us out and we would have to pay five grand just to update it, which we didn&#8217;t have because of the situation.<\/p>\r\n\r\n\r\n\r\n<p><strong>               [20:56]<\/strong>        And then I think the third one is just the general user experience. I think making sure that you are putting thought into what happens when a user gets to your website. So a user from social is expecting something much different than a user from search. It&#8217;s a different intent, right? Whereas when you&#8217;re working on social media, you&#8217;re doing a lot of intrusive advertising and content where they&#8217;re not actively always searching. So you&#8217;re putting content in front of them to get their attention and then get them over to your website and then that experience needs to carry on, and your website needs to be able to be built to handle that. But the fourth one that I will add just to that is just keyword research. I&#8217;m a big advocate of understanding what your consumers are searching for and how that relates to how your website&#8217;s performing. But most importantly, it&#8217;s just great business intelligence to have.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [21:44]<\/strong>      Yeah. When you think about your history at Agency Media, what&#8217;s been the biggest surprise for you, things that you didn&#8217;t see coming in your role or with the business that kind of stands out?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [22:03]<\/strong>      The business of running an agency, the sales system has been surprising for me. I was always on the receiving end of it. So if this message is for people that are looking or thinking about starting an agency or other agency leaders or freelancers, wherever the case may be is you have to have an effective sales system that&#8217;s driven by value. It has to be give, give, give, provide knowledge and value because it is all about long-lasting relationships but to be completely honest, one of the things that&#8217;s been different for me is managing so many creatives. It&#8217;s a different environment. As I said, I&#8217;m an operational guy, so we have a big video team, a brilliant team of creatives that are out shooting content but there was a learning process for me to understand how I could bring my operational processes into a creative environment.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [23:00]<\/strong>      Yeah. I love that. Everybody in Canada says process.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [23:03]      <\/strong>Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [23:04]<\/strong>      We say process down here.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [23:06]      <\/strong>Process,yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [23:09]<\/strong>      I&#8217;m going to start saying it that way because I&#8217;m hearing it that way more often than not. I dig it. When you think about where you guys are at and where you&#8217;re headed, any exciting developments, new things on the horizon that you&#8217;re really excited about?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [23:30]<\/strong>      Yeah, for me, right now. So our web model is a machine and I have a great team here and then a large team of developers and it&#8217;s like, we&#8217;re producing great products for our clients. What&#8217;s come up recently and that I&#8217;m actually really excited about is SEO. So SEO has always been a part of our process, but we basically had this situation happen where we own a spa, and I&#8217;m not sure if it was open when you were up here, but there&#8217;s a spa at the bottom of our building. And we basically built the building that all of our companies operate out of, it’s this crazy building. If you want to Google it, Google “The Westlund Building”. There&#8217;s a golf putting green on the roof and a bar, it&#8217;s insane. But there&#8217;s a spa at the bottom and the spa moved from another location and it ended up on page 37 of Google for all of our focus keywords. So we all kind of huddled around and we&#8217;re like, “Obviously we let this slip…” and this was a few months ago, “…but we need to get on this”.<\/p>\r\n\r\n\r\n\r\n<p><strong>               [24:27]        <\/strong>And so basically we took our SEO processes, I got to sit down for a few hours and just build out this model &#8211; basically our process on steroids &#8211; and then execute it. And within like 37 days, we went from page 30 plus to page one for our focus keyword. And then what happened after that was “Okay, we&#8217;ve done this now. We&#8217;ve been actively doing it for some clients, but we&#8217;ve really done a case study that we can show this in a very competitive space. How do we now communicate that out to our client base and potential clients and then start scaling it and offering it as a service?” And it just kind of overnight just happened. We had a few discussions about it and now, especially through the pandemic, everyone was turning to where their website was situated on Google search and a lot of businesses realized there was no effort made into it when they originally embarked on their web journey. So it kind of just overnight turned into one of our third vertical that we&#8217;ve always kind of done. We just didn&#8217;t put a lot of priority on though.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [25:28]<\/strong>       I love those stories. One of the things we found so successful for us that&#8217;s really building momentum is you had mentioned case studies. And if you look at a lot of websites, typically they&#8217;re artwork portfolio, it&#8217;s really just kind of window dressing. It&#8217;s like you get a couple of pictures, a couple of things, and full disclosure, we have that on our site right now. But what we started doing is we started using our blog for case studies and I&#8217;d have the team write about their work, provide more depth and insight into what we do &#8211; screenshots of results, narratives around the work that we&#8217;ve done, really specific around industries. We have a case study around a pool supply company. I never thought in a million years. We&#8217;ve got this pool supply company out of Buffalo because of a gal that&#8217;s based out of there. Never thought in a million years they&#8217;d sign with us, and they did and I was skeptical.<\/p>\r\n\r\n\r\n\r\n<p><strong>               [26:16]        <\/strong>I&#8217;m like “A pool supply company? It&#8217;s not really, you know&#8211;” Just killing it for them! They sold out of everything and all they say is every customer&#8217;s coming in, they love their content. They find it so engaging and helpful. And I was blown away like, “Holy cow, we did this for a pool supply company in Buffalo”, because that&#8217;s usually not our demographic because it&#8217;s kind of a retail business and local. So typically their budgets are a little smaller and it&#8217;s really regionalized, but man, we just knocked it out of the park. We got to write a case study. So we wrote this case study and it&#8217;s this fantastic piece of content that we can now do outreach for. Like I jumped on LinkedIn Sales Navigator, I find myself some pool supply owners or business owners and just send them an email like, “Hey, check this out. You want this?” So I love that. I love when I hear stories of agencies that kind of stumble across success like that. But I think it&#8217;s so powerful to tell those stories and be transparent about it because, to me, that&#8217;s what moves the needle in terms of getting new business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [27:21]<\/strong>      Exactly. And I mean, I would love to see the content you guys put out because that is one of those ones where if that had come across our table I would have been like, “Oh, how are we going to do this?” And back when we did a lot of social &#8211; we&#8217;ve switched our social to more of a paid strategy if we do it, but we ended up with a lot of engineering companies and it was tough to build content for them. But, yeah, I think it&#8217;s exactly what you just pointed out goes back to my comment on the sales system and how important it is to drive a sales system for your agency with value. Like here you did something great for a client. Obviously, they were okay with you writing it out as a case study, and then you&#8217;re able to provide that value to a bunch of other businesses and regardless of them immediately reacting and signing with you, it gets their mind starting to understand that, hey, there is something we can do out there, and then when that decision time does come you&#8217;re top of mind.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [28:19]<\/strong>      Sure. So a couple more questions, before we kind of wrap things up, I want to touch on. So especially for folks that are either in agencies or building agencies or thinking about it, can you provide a little bit more insight as to what do partnerships look like for folks that maybe own an agency and aren&#8217;t doing web that are interested in potentially working with a company like yours. Can you give a little insight as to what that might look like for them?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [28:45]<\/strong>      Yeah. I mean, we kind of have this betting program where we have our inside BizDev team reach out to prospected or potential partners, and then I end up on a call with them to make sure everything is in sync because we are about building partnerships with the right people. If you&#8217;re not building partnerships with the right people, things can go sour really quickly. And this is all about the long game, just as much as any short business game. So what we&#8217;re always looking for is people out there that are value-driven and if your aim is to provide value. And I know every agency says that. I&#8217;ve seen every agency&#8217;s website, but at your core, you know if you&#8217;re actually delivering value or if you&#8217;re just in it for the money. And if you&#8217;re one of those agency leaders or you&#8217;re starting out on your own, even we do have partners that are the&#8211; I kind of poked fun at the university student graduating and running it out of his parents&#8217; basement, but I could name probably four or five partners that are in that situation and that they&#8217;re just these people that are brilliant at what they do. They don&#8217;t do web, so they partner with us because we have resources available to help them scale their web business. We have a video production company. Once you enter a partnership program with us there are resources made available. So if you need some video content created to highlight one of your services, if you need keyword research audits, whatever the case may be, even helping you build out your own sections of your website to make sure you&#8217;re ranking for web and help you scale your web, we&#8217;re there to help and support. So that&#8217;s kind of it.<\/p>\r\n\r\n\r\n\r\n<p><strong>                [30:19]<\/strong>        If you&#8217;re in that spot where you know you don&#8217;t want to hands-on manage a web project, but you&#8217;re looking for someone reliable that can, we&#8217;re definitely that partner, but that being said, again, it goes back to your core, what you&#8217;re doing, does it align with our values? That&#8217;s probably why ours, like I said, Jason, we have a weekly leadership team to go over partners and we&#8217;ve been talking about you since you came up. Because we&#8217;re just like, “We&#8217;re ready to work with this guy. We know he&#8217;s the right fit.” And then obviously like you said, business picked up and now we&#8217;re into some great journeys of projects.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [30:55]<\/strong>      Yeah, no, I&#8217;m digging it. I love it and it&#8217;s been a great experience so far, so awesome. Is there anything I didn&#8217;t ask you that you wanted to share with the audience that we didn&#8217;t cover off?<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [31:06]<\/strong>      No, no, we went into much more than I thought I was going to be able to. So yeah, this was definitely great.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [31:13]<\/strong>      Awesome. Well, I super appreciate your time today. Like I said, I really value our partnership. I really wanted to do an episode to kind of provide a little insight into that. So look, if you&#8217;re an agency owner and you&#8217;re not doing web and you need a relationship or a partnership, you really need to check these guys out. If you&#8217;re thinking about starting something, they&#8217;re a really great resource for that. Or if you are a company or a business and you have web needs, you can&#8217;t go wrong working with these guys, I can tell you that firsthand. And make sure if you have any interests along any of those lines, make sure to reach out to Leland directly. Mention Socialistics, maybe he&#8217;ll give you a little Socialistics discount.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [31:51]<\/strong>      Definitely do. Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [31:53]<\/strong>      Awesome. Well, thanks so much, Leland, for joining us. Really excited about working with you in the near future and really appreciate your time today.<\/p>\r\n\r\n\r\n\r\n<p><strong>Leland:    [32:01]<\/strong>      Yeah. Thank you. It was great.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:      [32:02]<\/strong>      Awesome. That&#8217;s it for this episode of Socialistics, we will catch you next time. Thanks, guys.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Leland Dieno, Vice President at Agency.Media, a website design and development house based outside of Vancouver, B.C. We&#8217;ve had a terrific experience thus far partnering with them on our web projects, and in this episode we discuss all things website development and agency partnerships.   Podcast Transcription: Jason:      [00:09] [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7065,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/website-agency-disruption\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Leland Dieno, Vice President at Agency.Media, a website design and development house based outside of Vancouver, B.C. We&#8217;ve had a terrific experience thus far partnering with them on our web projects, and in this episode we discuss all things website development and agency partnerships.   Podcast Transcription: Jason:      [00:09] [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/website-agency-disruption\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-09T16:05:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:42+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"30 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/website-agency-disruption\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-leland-dieno\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/website-agency-disruption\/#webpage\",\"url\":\"https:\/\/socialistics.com\/website-agency-disruption\/\",\"name\":\"Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/website-agency-disruption\/#primaryimage\"},\"datePublished\":\"2020-08-09T16:05:00+00:00\",\"dateModified\":\"2021-01-14T17:39:42+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/website-agency-disruption\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/website-agency-disruption\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/website-agency-disruption\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Website Agency Disruption With Leland Dieno, VP at Agency.Media\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/website-agency-disruption\/","og_locale":"en_US","og_type":"article","og_title":"Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics","og_description":"This week I sat down with Leland Dieno, Vice President at Agency.Media, a website design and development house based outside of Vancouver, B.C. We&#8217;ve had a terrific experience thus far partnering with them on our web projects, and in this episode we discuss all things website development and agency partnerships.   Podcast Transcription: Jason:      [00:09] [&hellip;]","og_url":"https:\/\/socialistics.com\/website-agency-disruption\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-08-09T16:05:00+00:00","article_modified_time":"2021-01-14T17:39:42+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/08\/image-22.jpg","size":"full","id":7065,"alt":"socialistics-podcast-leland-dieno","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"30 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/website-agency-disruption\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-22.jpg","width":560,"height":315,"caption":"socialistics-podcast-leland-dieno"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/website-agency-disruption\/#webpage","url":"https:\/\/socialistics.com\/website-agency-disruption\/","name":"Website Agency Disruption With Leland Dieno, VP at Agency.Media - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/website-agency-disruption\/#primaryimage"},"datePublished":"2020-08-09T16:05:00+00:00","dateModified":"2021-01-14T17:39:42+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/website-agency-disruption\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/website-agency-disruption\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/website-agency-disruption\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Website Agency Disruption With Leland Dieno, VP at Agency.Media"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5179"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5179"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5179\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7065"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5179"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5179"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5179"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}