{"id":5183,"date":"2020-08-03T16:12:00","date_gmt":"2020-08-03T16:12:00","guid":{"rendered":"https:\/\/socialistics.com\/hyke-revolutionizing-tax-management-for-agencies-with-ceo-hooman-radfar-copy\/"},"modified":"2021-01-14T17:39:51","modified_gmt":"2021-01-14T17:39:51","slug":"pandemic-survival","status":"publish","type":"post","link":"https:\/\/socialistics.com\/pandemic-survival\/","title":{"rendered":"Agency Survival Through A Pandemic"},"content":{"rendered":"\r\n<p>This week I talk through how we have dealt with the pandemic as an agency. The ups, downs, strategies and tactics we&#8217;ve used to stay in business, and what the future holds.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-4816802\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/4816802-agency-survival-through-a-pandemic.js?container_id=buzzsprout-player-4816802&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p>Hello, and welcome to another episode of the Socialistics Podcast: Social Media Agency Stories. This week, we&#8217;re going to take a little bit of break from interviews. They are always kind of challenging to find great folks, and sometimes we just kind of want to talk about what we&#8217;ve experienced as an agency. The idea of this was always about kind of sharing insights as to who we are and what we&#8217;re doing, and if we can help other aspiring agency owners or startups avoid some of the pitfalls or mistakes that we&#8217;ve made, then we&#8217;ve done our job with this. Plus it&#8217;s somewhat therapeutic to have a place to  just talk about and talk through some of the things that we experience on the agency side of things. Especially these days, you know, you&#8217;re kind of on an island. We&#8217;re not getting to hang out in person very much and, quite frankly, even before the pandemic, we&#8217;ve been a virtual agency. So we&#8217;ve had to get creative about how we stay connected and kind of get that social interaction piece. I&#8217;ve always been pretty much an introvert and a to myself kind of guy, but everybody needs some of that in some capacity, so yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>[01:34]<\/strong>     This week, I wanted to talk about what it&#8217;s been like, as a growing agency, experiencing the pandemic and how it has impacted our agency, the business, what we&#8217;ve done to kind of work through it, and some of the things that have worked, some of the things that haven&#8217;t, and just provide a little bit of insight as to what we&#8217;ve experienced during these difficult times. I really want to preface this by saying that throughout this episode, I am not complaining. There are far worst off people right now that are hurting in terms of jobs and careers and all kinds of things. I and my team are very fortunate to be where we&#8217;re at and what we have. So this is really just about providing some insight as to what we&#8217;ve experienced, for others that are in similar boats that might be able to kind of glean something out of it, and then maybe make use of it. So full disclosure, we are fortunate to be where we&#8217;re at and what we&#8217;ve been able to do to keep the lights on. So, what have we experienced?<\/p>\r\n\r\n\r\n\r\n<p><strong>[02:42]<\/strong>     Well, I started this agency about, I want to say two and a half years ago, as a side hustle. I always wanted to create; I always had an entrepreneurial spirit. I never fit the mold of sitting behind a desk, sitting in traffic. I knew I wanted to do my own thing someday, but my personal life, personal finances really didn&#8217;t allow for a whole heck of a lot of risks. So I kind of had to wait for the right time. It was a combination of the right time and quite frankly, kind of being forced into it, you know. Marketing&#8217;s a very volatile career. There&#8217;s one thing that I learned, I was always so embarrassed by the fact that if you looked at my career path, my track record, you&#8217;d see too many stops, like tons of bus stops. I was like, “Geez, what is wrong with me?” And when I looked at it, it&#8217;s not like I had been fired, maybe once or twice, but rarely ever performance related. It always had something to do with things out of my control and it wasn&#8217;t until I looked on LinkedIn and saw that a lot of marketing people have pretty similar paths. It&#8217;s a very volatile career path. So I always knew that I wanted to do my own thing. I always was looking for stability and the stability, ironically, was starting my own thing. When I started to piece that together and finally was able to go all-in mentally, that&#8217;s when things started to take off. So I&#8217;ve been at this now full time for about a year. We were really on quite the trajectory and we were really approaching that million-dollar status that I was trying to hit. We were on a path for it, I thought we&#8217;d hit it in 2020, and then obviously, things changed. We lost some clients and you know, it happens. Our philosophy with our agency is not to force businesses into long term commitments. So we&#8217;re a month-to-month agency, most are not. I think it&#8217;s a trend that is happening. I&#8217;d like to think that we had something to do with it, but that might be a little naive. I started it as a disrupter and I thought that maybe eventually once we built a name for ourselves and we could start having long term contracts that we would, but I found that over time, it helped us land more business. It kept us on our toes, earning everybody&#8217;s work every month, and quite frankly, because we do a good job, people stuck around. So why change a good thing?<\/p>\r\n\r\n\r\n\r\n<p><strong>[05:24]<\/strong>     I certainly understand from a valuation perspective, if you&#8217;re looking to sell your agency that could be prohibitive, but we&#8217;re not thinking about that right now. Ultimately, the pandemic is a perfect example of why philosophically, we believe in the month-to-month model, because quite frankly, as much as I want to increase our revenue and make as much money as we can, not at the expense of not doing the right thing. I feel like in business, when the rubber meets the road, if they have to make a decision between spending money on marketing with an agency or paying their employees, I choose the latter. So, even though that isn&#8217;t in our best interest, it&#8217;s in theirs, and acting in that philosophy, I think is just a core value of who we are. This pandemic is a perfect example of that. We lost some clients because they just didn&#8217;t have a choice. They had to do what they had to do to survive; they kind of had to go into survival mode. Now as a marketer, I would advise businesses, especially ones that lend themselves to an online environment for their viability should probably double down in a situation like this. More people are online, not only are more people online, they&#8217;re online even longer. What else do we have to do? So, you have such a bigger, more engaged audience. If there was ever a time to invest and do more with your online marketing, now&#8217;s the time. That being said, we have what we have to work with. So even though strategically, that&#8217;s what I would advise clients, sometimes you just have to make a hard decision and you&#8217;re going to have to put things on pause.<\/p>\r\n\r\n\r\n\r\n<p><strong>[07:09]<\/strong>     So, we lost a few clients, it set us back, and it was hard because we were on a really great trajectory and it kind of made things difficult for us for a little while. So we really had to think through well, “What are we going to do? What’s the plan? How are we going to get through this?” Because I was not going to lose what we had created up to this point, come hell or high water. So, luckily we never reached a point where I had to make difficult decisions around letting people go or doing anything too drastic. We got pretty close to treading water, I would say, for the most part, but there are a few things that I and our team decided to do based on the situation that we were in. One of them was to just basically really double down on business development, and really try to figure out “how we can ensure that we&#8217;re doing everything that we can to get out in front of every opportunity that potentially exists?” Not so much today, immediately, but a couple of weeks from now, a month from now, because the fact of the matter is, we saw the writing on the wall. This isn&#8217;t going to go away anytime soon and we want to be prepared for when either:<\/p>\r\n\r\n\r\n\r\n<ol type=\"a\">\r\n<li>it does start to go away and we go back to some sort of normalcy or<\/li>\r\n<li>businesses start to realize that this is the new norm and even though it&#8217;s difficult, we have to adjust and get serious about how we market ourselves again.<\/li>\r\n<\/ol>\r\n\r\n\r\n\r\n<p><strong>[08:51<\/strong>]     So we knew that that was coming at some capacity, so we wanted to be ready for that. So we really double down on reaching out and finding qualified leads and trying to create opportunities. I could do a separate episode on each of the different tactics that we did but generally speaking, it&#8217;s been a combination of technology and just good old fashioned hard work. We&#8217;ve used tools like Seamless.AI. For those of you that don&#8217;t know what that is, it&#8217;s an intelligence platform that helps you extrapolate contact info for targeted leads. I&#8217;ve actually been really pleasantly surprised with how well that it&#8217;s worked for us. It’s not the cheapest thing in the world, but it&#8217;s not too expensive, but it works really well. It&#8217;s a Chrome extension, it bolts on and helps you identify contact info for folks. Now, you want to use it responsibly by targeting the right folks and not just by blasting out to anybody and everybody. So it&#8217;s effective when you&#8217;re actually really using it and doing good research to find the right type of people. It&#8217;s been a great piece of technology for us in helping us get contact info for people. Certainly, LinkedIn Sales Navigator is a great tool to combo with that. Even by itself, it&#8217;s a great tool to create lists and identify decision-makers especially, you know, we&#8217;re in a predominantly B2B market. So we could have a lot of success with using that tool to identify folks and kind of start conversations with. So it&#8217;s really using technology platforms like that and just being really laser targeted on who you&#8217;re going after.<\/p>\r\n\r\n\r\n\r\n<p><strong>[10:48]<\/strong>     One of the things that we found really successful is writing case studies for the work that we&#8217;ve done, and not just like your typical top of the line, information that you typically see. We wrote blog posts, we&#8217;ve gone in-depth. We really talked about the work that we did around different specific clients in their industries and we leverage those case studies for the communications that we send out to potential leads because that&#8217;s what&#8217;s going to really cut through the noise. If you&#8217;re just sending an email to thousands of people with a general message, it&#8217;s just fruitless effort. So we use these case studies to really target individual types of businesses, for example, collaborative law is an area that I&#8217;m personally passionate about, but we&#8217;ve had some success with. So we wrote a case study up for a client that we&#8217;ve done some incredible work for, and then send that out to Collaborative Law practices, sharing specific information about work we&#8217;ve done for someone that&#8217;s just like them, that&#8217;s results-oriented.  It worked really well, I mean incredible open rates, great response. That&#8217;s what they want to see. Yes it&#8217;s cold email outreach, and some people have their opinion about that but hey, if it&#8217;s relevant and timely, then most people are receptive to that. We very rarely get folks that get angry with us or tell us not to communicate with them if the message is really designed for them, even if they don&#8217;t need it right now. So that&#8217;s worked really well for us.<\/p>\r\n\r\n\r\n\r\n<p><strong>[12:26]<\/strong>     The agency game is changing. Most agencies that are popping up now are niche-focused, they&#8217;re niche or tactic-focused. So like for us, when I launched, instead of being a generalist, we decided to be a social media agency and ultimately, a b2b social media agency. If you&#8217;re not going to zero in on a specific lane like that, then picking a specific industry that you want to tailor to, whether that be like Collaborative Law. Another brand that we worked on and put out there is a sub-brand of our business called Careviva, which focuses on the home care industry. So developing some of these long term ideas that create pipelines for what we do was something that we started to develop since we had some time. If our client load started to shrink, let&#8217;s start thinking about what are the things that we can do that can build us a path to success long term. So that&#8217;s certainly something that we spent some time on and this podcast is a perfect example. I always knew that I wanted to do some sort of podcast for Socialistics. I just never knew like, “What&#8217;s the format going to be? Are people going to even care about this?” That remains to be seen, being on episode four here. But I knew I finally figured out you know, “Let&#8217;s just do it. Let&#8217;s just put it out there. Let&#8217;s just be ourselves.” And in most cases, people seem to really like the approach that we take and how we do business and how we create content. So I just felt like certainly putting out a podcast is just an extension of that work. So that&#8217;s certainly been something that we spent some time planning and putting in motion.<\/p>\r\n\r\n\r\n\r\n<p><strong>[14:15]<\/strong>     Some other things that we started to do or even I started to do is just being there for people &#8211; free education, consultations &#8211; really authentically offering help to people even if there isn&#8217;t an official business relationship there today. We&#8217;ve always taken that approach. I always feel like if you plant these seeds, if you&#8217;re authentically helpful, even if you&#8217;re not a good fit for somebody, either short or long term that good things come back to you. People remember that people; people do business and have relationships with people that they trust and they like. And if you really want to build an agency, that is sustainable with the right type of growth, then you need to double down on helping people and being that kind of person and not just thinking about the bottom line. Don&#8217;t get me wrong, everybody&#8217;s got to make money but you&#8217;ve really got to carve out a good portion of your time to be helpful to others and help them make good decisions.<\/p>\r\n\r\n\r\n\r\n<p><strong>[15:20]<\/strong>     And sometimes a client isn&#8217;t a good fit. I always say that on my calls. There&#8217;s about 30, I would say 30 to 40% of those initial calls I have with potential clients, they’re not a good fit for a variety of reasons. And I&#8217;ve learned a long time ago, to not just take the business, whether you&#8217;re having to discount heavily to meet their budget needs or their product is a little sketchy or it&#8217;s just not there yet. Great marketing doesn&#8217;t cure bad products. You don&#8217;t want to get into a situation where you&#8217;re just extrapolating money from somebody as long as you can. You want to help these folks. You want to help entrepreneurs and business leaders with the right advice, even if it&#8217;s not in your best interest. So, even though that has, for us, made an agency that grows a little bit more slowly, it just scales better because the clients that we do get are the right ones and they stick around and we do great work and then we can leverage those stories to land other great work and it&#8217;s just a multiplier effect. So, even though we could probably be doing more revenue now by just taking everybody, man the headaches that that can cause and we&#8217;ve learned the hard way. I&#8217;ve made mistakes. I have pulled the trigger on some clients that we should not have done, but I&#8217;ve learned from that. So, helping people, providing some education and consultations is a good thing. This is a tough time and just the fact of the matter is landing clients, keeping clients is a tougher thing to do right now. So even though it might be slower, you just got to continue to provide the help that you can in hopes that that leads to bigger and better things once we get on the other side of this.<\/p>\r\n\r\n\r\n\r\n<p><strong>[17:16]     <\/strong>One of the other things that came from this break was interesting. Our close rate was really high, north of 80% pre-pandemic. Now, we&#8217;re a virtual agency but I&#8217;m based in Seattle, so certainly a good number of opportunities that we get is based in this area and so there are some in-person opportunities for me. My ability to do what I do is, a lot of it has to do with getting the opportunity to meet people and sit down with them and have conversations. Because I am authentic and I tell it like it is and because I&#8217;m just not trying to land every single client I can, that resonates with people, it lands well. So when I&#8217;m able to have those types of conversations, especially in person, the proposal phase was much more successful then because I had already kind of built a relationship foundation with them. But what I found is once the pandemic hit and we were thrust into a virtual environment, I lost that opportunity and the proposal process; my close rate went down a lot. Because, now everybody&#8217;s competing for the same thing and we&#8217;re in a virtual environment, so it became a much less personable way to do things.<\/p>\r\n\r\n\r\n\r\n<p><strong>[18:46]<\/strong>     So we had to double down and we moved and shifted from using proposals. We still use it. We use Proposify, which by the way is a great platform for managing digital proposals and contracts, but we moved away from that as our primary means to present our work and what we propose for a particular client. We moved to doing virtual pitches using Google Slides or PowerPoint or whatever presentation software and then schedule a Zoom call. So instead of the process being talk to prospect, sounds like a good fit, gather information, put together a proposal, send it off, and then the follow-up nightmare, you know, emails and calls, waiting for them to make a decision. We moved to having the initial call, assessing if it&#8217;s a good fit, getting the information we need, scheduling a pitch call with them that is delivered in real-time &#8211; the next best thing to being in person. Interestingly, also realized that I&#8217;ve always felt like our proposals needed to have a lot of information in them and we live in a different world. People, their attention spans are shorter, smaller, get to the point. So I really had to work hard to get to this “less is more” mindset, really get to the point and not worry so much about spelling everything out. So we shifted our approach, we shifted the technology, the process, and our close rate went from sub 50% back up to over 90% because we were able to re-insert ourselves into somewhat of a more personal back and forth, so it&#8217;s worked really, really well.<\/p>\r\n\r\n\r\n\r\n<p><strong>[20:43]<\/strong>     So you have to get creative about how you can still connect with people in a virtual environment. And let&#8217;s be honest, even when this pandemic goes away, the lasting effects of it will not. More people are going to be working from home, more businesses are going to shift to a remote-based culture. And look, as much as I hate to admit it, this isn&#8217;t going to be the last virus and even if we have another one, and it&#8217;s not even close to the severity of this one, people are now sensitive to it. I think more and more people, like if something happens, even if it&#8217;s less severe, people are going to reel back into that remote, virtual attitude and back into those types of behaviors. So, if anything, having an agency that is virtual in nature and prepared to thrive in that type of environment is critical if you&#8217;re going to survive, and luckily, we were already kind of wired that way pre-pandemic. But still, we&#8217;ve learned a lot during these tough times about the things that we&#8217;ve needed to do to keep the lights on. And, especially over the past couple of weeks, it&#8217;s been very interesting. We&#8217;ve found that there is a lot more movement happening now, I think we&#8217;ve reached a point, a threshold where businesses realize, like I said earlier, either:<\/p>\r\n\r\n\r\n\r\n<ol type=\"a\">\r\n<li>this isn&#8217;t going away or<\/li>\r\n<li>even when it starts to, we need to really get going again. We just can&#8217;t pause and hold up and wait for everything to go back to normal.<\/li>\r\n<\/ol>\r\n\r\n\r\n\r\n<p>So we&#8217;re starting to see a lot more businesses re-engage with us and get serious about getting their social media right. So, interesting times, to say the least. That&#8217;s kind of what we&#8217;ve experienced with everything. The future is bright and I think that as long as you keep pushing hard and treat people well and do the right things that you&#8217;re going to kind of survive.<\/p>\r\n\r\n\r\n\r\n<p><strong>[22:54]<\/strong>     That&#8217;s our pandemic updates. So, really looking forward to seeing where things go. As always, anybody out there that&#8217;s listening to this, whether you&#8217;re starting an agency, whether you&#8217;re a potential client, I am an open book. Please reach out to me at jason@socialistics.com for any questions or needs that you have. Book some time with me. I love talking to people even, like I said, if it doesn&#8217;t lead to anything that benefits us, and that&#8217;s just how we do what we do. So, thank you for listening, please leave a rating, a review, subscribe, all that good stuff that helps this podcast get found. We&#8217;re just getting started. So I&#8217;m really excited with some interviews that we&#8217;ve got coming up with other folks. So thank you for listening and we will catch you next time on the Socialistics Podcast.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I talk through how we have dealt with the pandemic as an agency. The ups, downs, strategies and tactics we&#8217;ve used to stay in business, and what the future holds.   Podcast Transcription: Hello, and welcome to another episode of the Socialistics Podcast: Social Media Agency Stories. This week, we&#8217;re going to take [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7067,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Agency Survival Through A Pandemic - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/pandemic-survival\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Agency Survival Through A Pandemic - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I talk through how we have dealt with the pandemic as an agency. The ups, downs, strategies and tactics we&#8217;ve used to stay in business, and what the future holds.   Podcast Transcription: Hello, and welcome to another episode of the Socialistics Podcast: Social Media Agency Stories. This week, we&#8217;re going to take [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/pandemic-survival\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-03T16:12:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"18 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/pandemic-survival\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/pandemic-survival\/#webpage\",\"url\":\"https:\/\/socialistics.com\/pandemic-survival\/\",\"name\":\"Agency Survival Through A Pandemic - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/pandemic-survival\/#primaryimage\"},\"datePublished\":\"2020-08-03T16:12:00+00:00\",\"dateModified\":\"2021-01-14T17:39:51+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/pandemic-survival\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/pandemic-survival\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/pandemic-survival\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Agency Survival Through A Pandemic\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Agency Survival Through A Pandemic - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/pandemic-survival\/","og_locale":"en_US","og_type":"article","og_title":"Agency Survival Through A Pandemic - Socialistics","og_description":"This week I talk through how we have dealt with the pandemic as an agency. The ups, downs, strategies and tactics we&#8217;ve used to stay in business, and what the future holds.   Podcast Transcription: Hello, and welcome to another episode of the Socialistics Podcast: Social Media Agency Stories. This week, we&#8217;re going to take [&hellip;]","og_url":"https:\/\/socialistics.com\/pandemic-survival\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-08-03T16:12:00+00:00","article_modified_time":"2021-01-14T17:39:51+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/08\/image-23.jpg","size":"full","id":7067,"alt":"socialistics-podcast","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"18 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/pandemic-survival\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-23.jpg","width":560,"height":315,"caption":"socialistics-podcast"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/pandemic-survival\/#webpage","url":"https:\/\/socialistics.com\/pandemic-survival\/","name":"Agency Survival Through A Pandemic - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/pandemic-survival\/#primaryimage"},"datePublished":"2020-08-03T16:12:00+00:00","dateModified":"2021-01-14T17:39:51+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/pandemic-survival\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/pandemic-survival\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/pandemic-survival\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Agency Survival Through A Pandemic"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5183"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5183"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5183\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7067"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}