{"id":5186,"date":"2020-08-18T16:17:00","date_gmt":"2020-08-18T16:17:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5186"},"modified":"2021-01-14T17:39:30","modified_gmt":"2021-01-14T17:39:30","slug":"bohemian-rhapsody","status":"publish","type":"post","link":"https:\/\/socialistics.com\/bohemian-rhapsody\/","title":{"rendered":"What Bohemian Rhapsody &#038; The Socialistics Podcast Have In Common"},"content":{"rendered":"\r\n<p>This week we have a condensed episode touching on how my new found appreciation of Queen relates to what we&#8217;re hoping to accomplish with the Socialistics Podcast.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5034305\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5034305-what-bohemian-rhapsody-the-socialistics-podcast-have-in-common.js?container_id=buzzsprout-player-5034305&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>[00:09]<\/strong>     Hello there and welcome to another episode of the Socialistics Podcast. This week, it&#8217;s just going to be me. I’m going to take a little bit of a break from some of the interviews because hey, sometimes you just can&#8217;t get enough people for that sort of thing, but I got plenty to share. This week&#8217;s episode is an interesting one, so hang in there. I know the title is probably a little wonky, but it&#8217;ll make sense by the time we wrap things up here. But first, I just kind of wanted to thank those that have listened to this so far. I knew that this would take time to build an audience and I do this because I enjoy it. And hopefully, it&#8217;s helpful to those that are listening, whether you are an aspiring agency owner, an existing agency owner, or maybe even a potential client just trying to get a little bit more insight into who I am and what our agency is all about. So, it&#8217;s all about helping people, that&#8217;s the goal and it&#8217;s kind of therapeutic. I&#8217;m not going to lie, being able to have an opportunity to kind of talk through some of the things I experience as an agency owner is certainly something that I enjoy.<\/p>\r\n\r\n\r\n\r\n<p><strong>[01:15]<\/strong>     So last week, I went on a little bit of a camping trip. It was really the first time that I removed myself from the daily grind of being an agency owner. It was a little uncomfortable not being in front of my normal workstation. I certainly brought an iPad with me to stay on top of things, but there&#8217;s a level of discomfort that you have as a business owner, especially in a growth stage when you remove yourself from what you&#8217;re used to. Don&#8217;t get me wrong, I have an incredible team that can handle most of what happens on a daily basis, but when you think about business development and just staying on top of things, it’s hard to really disconnect from everything. I don&#8217;t know that I&#8217;m comfortable with that yet. We haven&#8217;t reached a point where I feel that I can do that yet and that&#8217;s okay. I don&#8217;t think I have a problem with that. At some point, I&#8217;d like to do that but I love what I do, and the work and the personal life kind of merge in ways that I&#8217;m comfortable with. But I know at some point that I probably need to get the agency to a certain point where I have somebody else that can really do everything that I do. That&#8217;s certainly the goal. But it was an interesting experience to kind of go through that but I’m back this week and looking forward to kind of get back to the grind.<\/p>\r\n\r\n\r\n\r\n<p><strong>[02:45]     <\/strong>It&#8217;s been a really strange time. I don&#8217;t know if others have experienced this, but the pandemic definitely slowed things down for us. I mean, we’ve lost some clients because they just had to put a pause on their marketing spending, it happens. But for whatever reason, over the past four weeks or so, things have picked up dramatically. And my theory is that it has to do with the fact that people and business owners are in a mindset of, “Well, this is either not going to go away anytime soon and we need to get back to doing business the best that we can” or folks have realized that even when this does end, or it gets back to whatever normal, it&#8217;s going to be a new normal. People have gotten so accustomed to working from home, doing more things online, that they realize that if their business hasn&#8217;t taken their online strategy seriously, well, they better do so now. So, I think it has something to do with one or both of those sorts of things. Either way, I don&#8217;t care, that&#8217;s good for us, and I&#8217;m happy to see us kind of bouncing back. I know a lot of businesses aren&#8217;t, so I feel very fortunate to be in that position. But it&#8217;s been interesting, and certainly doing this podcast has been a joy, being able to talk to some incredible people. I&#8217;ve got some great guests lined up here over the next couple of weeks and I really look forward to seeing where this goes. And I look forward to bringing my team into these and having them share their insights here soon, too. If you&#8217;ve got any feedback, I certainly appreciate it, let me know.<\/p>\r\n\r\n\r\n\r\n<p><strong>[04:22]<\/strong>     Other than that, I&#8217;ve kind of wanted to dive into this epiphany that I had a couple of weeks ago that I wanted to make a connection with. So bear with me, let me take you through what I&#8217;m thinking here. So I watched <em>Bohemian Rhapsody<\/em> for the first time a couple of months ago and you know, I&#8217;ve always liked music, movies, documentaries, my wife loves them too, so we enjoy them. I don&#8217;t go out looking for them. I&#8217;m not the first person in the theater for that sort of thing, nobody is these days, but pre-pandemic. So it&#8217;s not the kind of thing that I really look out for. It&#8217;s one of those things where when it shows up on a streaming service, then I&#8217;ll watch it. And, you know, I grew up, I&#8217;m an 80s kid, I liked Queen. I don&#8217;t know that I really went out of my way again to listen to them, but if it was on, I like it, I dig them, obviously a great band. I wouldn&#8217;t put them in my top 10 or anything along those lines. So we watched <em>Bohemian Rhapsody<\/em> a couple of months ago and I loved it. I mean, it was incredible. It was so fascinating to learn about the band and Freddie Mercury and what he did and just the creativity. They were just musical geniuses and I was just so impressed and enamored with their journey to what they did and how they did it. I was just like, &#8220;Wow, this is amazing&#8221;, and after the movie, I just started listening to the music again a lot.<\/p>\r\n\r\n\r\n\r\n<p><strong>[05:57]<\/strong>     So I went into Spotify and I made my own Queen playlist of all the songs that I was familiar with and then even some that I was mildly familiar with, and even ones that not even so much. So I built this playlist out and started listening to Queen a lot. Then we watch the movie again a couple of weeks ago and I really appreciated it, even more, watching it a second time. All I&#8217;ve been doing is listening to Queen. I’m been driving my wife nuts. That&#8217;s all I listen to lately. It&#8217;s the same thing with food, like once I am onto something I can eat that same thing for a week; the same thing with music. I&#8217;m into something and I&#8217;ll listen to it for like a couple of weeks on end and it drives her nuts but I love it. I&#8217;m a creature of habit, I guess. But definitely watching the movie made me so much more appreciate their music and it just flipped a switch for me and I can&#8217;t get enough of it. I&#8217;m listening to it all the time. I think a lot of it has to do with just the fact that I got insight and visibility into this band and what they did and their creativity and how certain songs came to be. It just increased my appreciation of the music so much more, that when I listened to it, I enjoy it on a whole other level that I never did before and it&#8217;s really cool. And as I started to think about that, I started to see parallels in what and why I wanted to do this podcast, I saw the similarities between those experiences.<\/p>\r\n\r\n\r\n\r\n<p><strong>[07:33]<\/strong>     With this podcast, what I wanted to do was&#8211; I mean, I had heard feedback, like, &#8220;Hey, if you run a business and you&#8217;re not doing a podcast you&#8217;re missing out&#8221;, but I just didn&#8217;t want to dive into something that I didn&#8217;t feel like I had value to add or like, “What am I going to talk about? Are people going to really care? Who am I? Nobody knows who I am.” Once I got past all those initial silly, kind of artificial barriers, then it became pretty clear to me what I wanted to do. I wanted to have a venue to share what I&#8217;ve done, and to provide visibility into what I&#8217;ve built with my team, who we are, why we&#8217;re different and unique, and most importantly, just trying to help other people not make the same mistakes that I made. Don&#8217;t get me wrong, making mistakes is part of any business that you start or run. That&#8217;s what makes a business great, is you learn from your mistakes. But, if there&#8217;s a way that I can help others navigate their path more efficiently, by not making the same mistakes, by providing some insight into the tools that we found to have success with and the strategies and the pitfalls, now there&#8217;s something that I think people might be interested in. I&#8217;m certainly still in the early stages of this and trying to build and find an audience, but I think if I take that authentic, helpful approach and provide visibility into who we are and what we do and how we do it, then that might be something that&#8217;s worth putting out there.<\/p>\r\n\r\n\r\n\r\n<p><strong>[09:10]<\/strong>     Here&#8217;s the connection, here&#8217;s what you&#8217;ve been waiting for. So what I&#8217;m thinking is that by doing that, by putting this out there in the way that we are, providing that visibility into who we are and what we do, maybe people, potential clients, or even people that might want to work with us will have more of an appreciation of who we are and what we do and how we do it, and have an increased likelihood to want to work with us and engage with us, whether they&#8217;re a client or a partner or whatever. And that&#8217;s the same thing with what I experienced, I think, with the film <em>Bohemian Rhapsody<\/em>. I got insight, I got visibility into their world and who they were and how they did what they did. And it created an environment where I wanted to listen to more of their music. I had a bigger appreciation for who they are and what they did and it helped me connect with their music in a more meaningful way. So I figured, well, if I can provide a similar sort of insight into who we are and what we do, and help other people, maybe that will create new opportunities for us, and even if it doesn&#8217;t, that&#8217;s not the ultimate goal here. I mean, if at the end of the day, I run this podcast and the only thing that ever comes out of it is having been helpful to other folks and being somebody that&#8217;s made a difference in other people&#8217;s lives. I can live with that. But we all need to make money and I wouldn&#8217;t be doing this if I didn&#8217;t think that it couldn&#8217;t complement what we&#8217;re trying to do from a business development standpoint.<\/p>\r\n\r\n\r\n\r\n<p><strong>[10:46]<\/strong>     But again, I think it&#8217;s a marathon. People do business with who they trust and who they like, especially in the agency game. It&#8217;s just not a point and click product. You have to build relationships. You have to have kind conversations. And it&#8217;s really hard to find those decision-makers and to get their attention for an extended period of time. So the idea is, well, if we have a podcast out there, and over time you build up 10, 20, 30 episodes, chances are out of your library of content, there&#8217;s probably a couple of episodes in there that are really going to be relevant to some of the conversations that you have with potential prospects. And then being able to point them to those episodes and say, &#8220;Hey I really enjoyed this conversation, you should really check out this episode about ‘such and such’ because I really think it hits on what we talked about.&#8221; I mean, that&#8217;s a pretty powerful follow-up to provide, I think. And that&#8217;s the thinking, that across all of these things is that&#8217;s where things are going to kind of work for us in terms of why we&#8217;re doing this and where I think it could go.<\/p>\r\n\r\n\r\n\r\n<p><strong>[11:53]<\/strong>     So that is my big connection between <em>Bohemian Rhapsody<\/em> and Socialistics. Maybe a little bit of a stretch but when you&#8217;re trying to do a weekly podcast, you got to find creative ways to come up with topics that are going to fill the meter with enough stuff. So I&#8217;ve got a pretty good list though of things that I&#8217;m looking forward to talking about. Certainly, my goal is to have it less about me and us and more about other folks, partners, technology partners. I&#8217;ve got a really cool episode coming up with this micro-influencer, which is a really compelling story. Just really cool stories that are out there. That&#8217;s the goal.<\/p>\r\n\r\n\r\n\r\n<p><strong>[12:43]<\/strong>     So that&#8217;s it. Consider this a short episode. Less is better sometimes, you know, quality over quantity. But I really wanted to get this <em>Bohemian Rhapsody<\/em> episode out while it was still in my head. So, that is it for this week but next week, we&#8217;re going to get back into our normal routine with some folks that we&#8217;re talking to. Really appreciate the listens and the time for anyone that&#8217;s listened to any of these episodes. Really would appreciate a rating and a review on whatever platform that you&#8217;re listening to. It&#8217;s the only way that this thing can grow and get in front of other people. I&#8217;ve got some exciting stuff coming up here to really help evangelize this and do some awesome things. So thanks again, for listening. We&#8217;ll catch you next week with another episode of the Socialistics Podcast. Take care.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week we have a condensed episode touching on how my new found appreciation of Queen relates to what we&#8217;re hoping to accomplish with the Socialistics Podcast.   Podcast Transcription: [00:09]     Hello there and welcome to another episode of the Socialistics Podcast. This week, it&#8217;s just going to be me. I’m going to take [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7062,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Bohemian Rhapsody &amp; The Socialistics Podcast Have In Common - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/bohemian-rhapsody\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Bohemian Rhapsody &amp; The Socialistics Podcast Have In Common - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week we have a condensed episode touching on how my new found appreciation of Queen relates to what we&#8217;re hoping to accomplish with the Socialistics Podcast.   Podcast Transcription: [00:09]     Hello there and welcome to another episode of the Socialistics Podcast. This week, it&#8217;s just going to be me. I’m going to take [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/bohemian-rhapsody\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-18T16:17:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/#webpage\",\"url\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/\",\"name\":\"What Bohemian Rhapsody & The Socialistics Podcast Have In Common - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/#primaryimage\"},\"datePublished\":\"2020-08-18T16:17:00+00:00\",\"dateModified\":\"2021-01-14T17:39:30+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/bohemian-rhapsody\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/bohemian-rhapsody\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"What Bohemian Rhapsody &#038; The Socialistics Podcast Have In Common\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What Bohemian Rhapsody & The Socialistics Podcast Have In Common - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/bohemian-rhapsody\/","og_locale":"en_US","og_type":"article","og_title":"What Bohemian Rhapsody & The Socialistics Podcast Have In Common - Socialistics","og_description":"This week we have a condensed episode touching on how my new found appreciation of Queen relates to what we&#8217;re hoping to accomplish with the Socialistics Podcast.   Podcast Transcription: [00:09]     Hello there and welcome to another episode of the Socialistics Podcast. This week, it&#8217;s just going to be me. I’m going to take [&hellip;]","og_url":"https:\/\/socialistics.com\/bohemian-rhapsody\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-08-18T16:17:00+00:00","article_modified_time":"2021-01-14T17:39:30+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/08\/image-21.jpg","size":"full","id":7062,"alt":"socialistics-podcast","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/bohemian-rhapsody\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-21.jpg","width":560,"height":315,"caption":"socialistics-podcast"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/bohemian-rhapsody\/#webpage","url":"https:\/\/socialistics.com\/bohemian-rhapsody\/","name":"What Bohemian Rhapsody & The Socialistics Podcast Have In Common - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/bohemian-rhapsody\/#primaryimage"},"datePublished":"2020-08-18T16:17:00+00:00","dateModified":"2021-01-14T17:39:30+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/bohemian-rhapsody\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/bohemian-rhapsody\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/bohemian-rhapsody\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"What Bohemian Rhapsody &#038; The Socialistics Podcast Have In Common"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5186"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5186"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5186\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7062"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5186"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5186"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5186"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}