{"id":5188,"date":"2020-07-29T18:28:00","date_gmt":"2020-07-29T18:28:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5188"},"modified":"2021-01-14T17:40:15","modified_gmt":"2021-01-14T17:40:15","slug":"cleverly","status":"publish","type":"post","link":"https:\/\/socialistics.com\/cleverly\/","title":{"rendered":"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy"},"content":{"rendered":"\r\n<p>Cam Harati, SVP of Strategy from <a href=\"https:\/\/www.cleverly.co\/\" target=\"_blank\" rel=\"noreferrer noopener\">Cleverly<\/a> joins us to discuss the power of social selling on LinkedIn and how businesses stand to benefit from integrating a LinkedIn lead generation strategy as part of their overall marketing plan. Socialistics listeners get waived setup fees on gold and platinum plans when mentioning the podcast. <\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-4757360\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/4757360-cleverly-linkedin-lead-gen-with-cam-harati-svp-of-strategy.js?container_id=buzzsprout-player-4757360&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [00:09]<\/strong>    And this is Jason Yomark for the Socialistics podcast episode two. I&#8217;m really excited for our guest today. Like I&#8217;ve said in our intro episode, the goal here is to really talk to the platforms that we personally, as an agency have had a lot of success with and really, really love. If they&#8217;re on this show, that means we&#8217;ve spent some time with them. We&#8217;ve vetted them out. We&#8217;ve had a lot of success with them, so just know just inherently, if they&#8217;re here and we&#8217;re talking to them, just know that we really love what they do. So I&#8217;m really excited to have Cam Harati from Cleverly here. Cleverly is a social sales platform slash service that helps clients navigate using LinkedIn to create new sales opportunities. So it&#8217;s a huge, huge thing that most businesses should really be doing, especially B2B if you&#8217;re not already. So I’m excited to have Cam here. Welcome to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [01:12]<\/strong>    Hey, thanks a lot. Thanks for having me, excited to be here.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [01:14]<\/strong>    Yeah, absolutely. So let&#8217;s just get right into it. Let&#8217;s start with a little bit about &#8211; I want to know more about you, your background, and then how you kind of found your way to Cleverly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [01:27]<\/strong>    Yeah, of course. So, I don&#8217;t know how far back I should start, but I’m born and raised in Houston, Texas, so I&#8217;m a Texan at heart. I went to the University of Miami, where I got a degree in marketing and then a master&#8217;s in sport administration, which led me into the first part of my career being in the sports world, doing marketing events, PR, we call it sports information. So I did that for a few years, bounced around the Hurricanes, Oregon Ducks, Houston Texans, Houston Rockets. I did some game ops for the Rockets as well, and then kind of realized that Dwight Howard and James Harden were taking all the money and just leaving pennies for me. So got an MBA from Rice University and after that, I moved out to Los Angeles to find my next role. Landed at a startup selling lease insurance called LeaseLock where my current boss, Bruce Merrill, who is the founder CEO of Cleverly, he used to work there. His big brother is the founder of that company. So we worked together a little bit at LeaseLock and then I moved over to Cleverly. Bruce asked me to join the team and help build Cleverly out. I was the fifth employee at the time. And kind of just been blowing up ever since then. It&#8217;s been a fun journey with Bruce and the guys.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [03:09]<\/strong>    Awesome. So I&#8217;m sure we&#8217;re going to have some listeners that maybe don&#8217;t understand or know what social selling is, or exactly what you guys might do. So just from a high level, kind of help the audience understand what is it exactly that you guys do and how does that benefit the businesses that you work with?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [03:29]<\/strong>    Yeah, of course. So what we do is essentially lead generation on LinkedIn by means of social selling. So what we mean by that is we really build relationships on LinkedIn via connections and direct messages. So instead of sending a full pitch message right away and being marked as spam or considered spam, we really nurture a relationship. We ask questions, show our expertise, find out the true pain points, and then once the time is right and the relationship is built, our clients step in and kind of tell their prospects how they can help out. So we call it soft to medium social selling. It&#8217;s not so direct or so forward.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [04:23]<\/strong>    So at Socialistics, obviously we&#8217;ve worked with you guys and have had a lot of success with it. We&#8217;re no stranger to conceptually social selling as a means for a business to create opportunities for themselves, but in your opinion and what you&#8217;ve experienced, why do you think using a platform like LinkedIn for this sort of thing, as opposed to email can be more effective? Not that email, isn&#8217;t an effective strategy in and of itself, but what&#8217;s the difference that you see between implementing a social sales strategy that involves LinkedIn in addition to, or opposed to a cold email campaign?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [05:05]<\/strong>    Yeah, I think LinkedIn is honestly the perfect avenue for social selling. Ultimately the end of the day, it&#8217;s a social networking site, but it&#8217;s full of business professionals and tons and tons of business is done on LinkedIn, through LinkedIn every day, every week, every year. So most people use LinkedIn either for finding a job or hiring or just networking for their business. So we do work some recruiting and job seeker campaigns as well, but mainly it&#8217;s for networking. So I think it&#8217;s a good supplement to email marketing. A lot of our clients, their aim is to get an email address to add to that funnel but it&#8217;s a lot different. Emails, for the most part, are a little bit pitchy or a little bit more forward, whereas here we can ease into a conversation and ease into a sell or a call to action rather than going straight for it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [06:11]<\/strong>    Got it. Can you provide a little bit more insight into the formula for what you guys do specifically? I mean, I know this, it&#8217;s a combination of connection requests, LinkedIn messaging and mails, all sorts of things, but can you give the audience a little bit more insight as to what does that formula look like in terms of how you actually on a tactical level do this sort of thing?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:    [06:40]<\/strong>     Yeah, of course. So the first thing&#8217;s first is that we need to know who we&#8217;re going after. So we work with our client to figure out an exact, niched down target audience. We want it to be very specific and mentionable in the copy so that it doesn&#8217;t look like we&#8217;re casting a wide net and just blasting a message out to anybody. It&#8217;s really as personalized as possible for mass outreach. So once we’ve figured that target audience out, we create a targeting list using LinkedIn Sales Navigator, which is amazing, but it has its limitations. So there are certain types of lists that are stronger than others, certain types of lists that require more or less cleaning up by the client, depending on what the filters are and how specific it is. But we get that list finalized and we send out connection requests with a short, casual, personalized connection message with the simple aim of getting the prospect to click accept. We’re not typically asking any questions or telling anybody what we do at this stage, it’s just a friendly networking connection request. And then once they accept, then we send the followup message a day later, which varies by campaign. But a lot of times it&#8217;s just a soft intro or what we call a crispy question &#8211; a question that gets the prospect to think about, realize, or tell us about a pain point that they have, which opens a door for our client to squeeze in there and tell them how they would solve that problem.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [08:34]<\/strong>    Got it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [08:35]<\/strong>    There are two more touches after that as well, if they don&#8217;t answer. People aren&#8217;t necessarily on LinkedIn every single day, so just like in email, there&#8217;s a drip sequence. If they don&#8217;t answer, we&#8217;ll hit them back up a week later and then another week after that if they still haven&#8217;t responded, just to bump up to the top of the inbox.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [08:57]<\/strong>    Sure. Do you have a kind of a sense of &#8211; I mean, I&#8217;m sure this varies based on different industries and obviously the quality, you know, every client&#8217;s different, every business is different. But do you hit kind of a general sense of what businesses can expect in terms of a response rate or any kind of metrics that give a business a sense of what&#8217;s possible when it comes to these sorts of efforts?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [09:24]<\/strong>    Yeah, absolutely. I mean, you&#8217;re definitely right, it varies drastically by campaign. A lot of factors involved, mainly the profile of our client, the target audience and their seniority level, the industry they&#8217;re in &#8211; certain industries are active on LinkedIn, certain aren&#8217;t &#8211; and then the content of that first message as well. So a lot of factors at play, but on average, our connection acceptance rate is about 20%, but we see some go up into the thirties and the forties if they have a really good profile and a good connection message to a specific audience. And then reply rates, you know, also a pretty big range, but about 20 to 30% is a typical average reply rate.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [10:14]<\/strong>    Yeah. I don&#8217;t know what your opinion&#8211; So based on what I&#8217;ve experienced, we&#8217;ve done this, we&#8217;ve done email. So a 20 to 30%, you said open rate or response rate on that, just to clarify?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [10:31]<\/strong>    That was a connection acceptance rate.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [10:34]<\/strong>    So which is obviously an action point by who it is that you&#8217;re targeting. When you think about email, that&#8217;s tough, this is my theory on this. I&#8217;m kind of curious what your opinion is on it. If I feel people are more protective of their email address, and what I mean by that is if you email somebody without their permission&#8211; And there are varying degrees, right? I would say actually like a phone number, like if you texted somebody without their permission, I would say that would be at the top, like, “I didn&#8217;t give you permission for this” and that would really piss people off. Next down would be email. A lot of people don&#8217;t&#8211; “I didn&#8217;t ask for this”, they&#8217;re protected around it but when you think about LinkedIn, not so much, right? To me, the barrier to entry there isn&#8217;t that sense of, you know, people aren&#8217;t adversarial around being contacted by people they don&#8217;t know on LinkedIn whereas they might be more so around their own personal email address or phone number, thus, an outfit like yours and this sort of strategy having a lot of success. I&#8217;m curious on your take on that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [11:41]<\/strong>    Yeah. I think you&#8217;re absolutely right. This kind of goes back to what I said before that ultimately LinkedIn is a social networking site. So, some people do only want to connect with people they know, but I think that&#8217;s the minority. For the most part, people will accept if your profile is relevant at all, or if you just look like a nice person. So yeah, people aren&#8217;t as protective. You do get some people here and there that tell you “Stop messaging me. You&#8217;re not supposed to sell on LinkedIn.” But they just don&#8217;t realize how much selling actually is done on LinkedIn. So if anything they&#8217;re missing out.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [12:20]<\/strong>    Yeah, no for sure. What are the best types of companies, either industries or whatever the case may be? Who are the ones that stand to benefit from this even more so than others, in your opinion?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [12:39]<\/strong>    Which industries, you said?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [12:41]<\/strong>    Yeah. Industries, types of companies?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [12:43]<\/strong>    That&#8217;s a really good question. Honestly, LinkedIn is full of recruiters but they can certainly benefit from doing this at scale instead of handpicking and hand messaging everyone. A lot of marketing agencies could also benefit. It&#8217;s a tough question. I honestly think anybody could benefit. It&#8217;s definitely worth it for the cost of doing LinkedIn outreach versus the potential benefit. We have some clients where their ROI is just astronomical because they have huge deal sizes. And we&#8217;ve seen some really tough industries get a couple of closed deals that made their whole year. So even though they had low statistics &#8211; their acceptance rate was low or their reply rate was low &#8211; there were such big-ticket items that it was still worth it for them. So I don&#8217;t know, I don&#8217;t really think it&#8217;s limited or there are any best or worst industries, but I would recommend it to anyone honestly. If you have a sales process, a sales funnel, it&#8217;s good to add this in there. At least see how it goes for you for your business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [14:07]<\/strong>    Yeah. When you think about this sort of thing for a business if you&#8217;re advising them, what are the top two or three most critical components to a successful social sales campaign, like above all? What are businesses really need to be thinking about to kind of prepare themselves to have as much success with this sort of thing that they can?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [14:33]<\/strong>    That&#8217;s a really good question. I guess I&#8217;ll answer that through the LinkedIn lens still, that&#8217;s where my expertise is, but I think one of the most important things that&#8217;s somewhat underrated is the profile. The profile really needs to strong and relevant to the audience, which is why the audience also has to be specific. A lot of businesses can work with any type of client or any type of prospect, but that wide net strategy doesn&#8217;t work well on LinkedIn. It has to be specific, excuse me. And then the profile really plays a big role. When you get a connection request from somebody, you only see a few things. You see their name, their profile photo, their LinkedIn headline, and then the first 70 or so characters of that connection message before you have to click “See more” to read the rest of the message. So those four things right there determine the acceptance rate. And the LinkedIn headline is an interesting beast in itself that there&#8217;s a lot of people giving a lot of advice across the spectrum on that throughout LinkedIn. But we&#8217;ve seen certain things work and certain things not work, so, that&#8217;s an area of focus for sure is the profile and the headline.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [16:09]<\/strong>    Got you. Excellent. So what do you think when you look at the landscape of social selling and platforms and services? It seems like it&#8217;s a hypergrowth area. A lot of companies are popping up or I personally get requests from people asking. I mean, they&#8217;re social selling me. I get them on LinkedIn. I mean, I get emails too of folks that want to do that for us. So there&#8217;s a lot of that out there. What do you think differs&#8211;? How do you guys stand out? Who are the outfits that do this really well? What makes them different or unique that separates them from the fly by the night kind of offerings that I&#8217;m sure a lot of people are getting requests for?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [16:58]<\/strong>    Yeah, of course. So to be honest with you, I personally don&#8217;t pay much attention to our competitors or other businesses in the space. We&#8217;re always hyper-focused on improving ourselves, so I can&#8217;t speak much to what they do, but I can tell you that what we do that helps set up our clients for success is we really take a consultative approach to our onboarding and account management process. And by that, I mean we really try to teach our clients and walk them through how to do social selling, how to handle these conversations, what their response handling should look like because people come from all different backgrounds. Some of our clients have a lot of sales experience, some don&#8217;t. So we don&#8217;t ever want to assume that they do or don&#8217;t know something. So we focus a lot on education and making sure that once we crack that door open for our clients, that they are well equipped to bust it wide open and get on a call with someone or close a deal.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [18:11]<\/strong>    No, that&#8217;s great. What about the future of either social selling&#8211;? Like, if you kind of look down 6 months, 12 months, a year down the road, to you, what are some things that are up and coming either conceptually or for you guys specifically that you think is going to maybe change the landscape or just some exciting stuff that you guys have going on that&#8217;s coming up?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [18:42]<\/strong>    Yeah. Well, I can tell you that we get a lot of requests from clients to do response handling. That&#8217;s something that&#8217;s, you know, we&#8217;re not sure what the logistics behind that looks like because it&#8217;s manpower heavy, time-intensive but we&#8217;re looking at a lot of ways to help our clients put together responses, response templates at least so that they can kind of templatize their further conversations after the connection and initial response. Ultimately everything does need to be personalized and on a per-client basis, but we live in a world where everyone wants things done quickly and easily templatized. So we&#8217;re looking at ways where we can help save our clients more time because a lot of those conversations they have do end up being very similar. So not necessarily automating, but simplifying the conversation process to a point where it can still stay customized and personalized is, I think, our next step.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [20:00]<\/strong>    I kind of have mixed feelings about that. I think on one side, as our agency has grown, repeatable processes become more important to be able to scale, but at the same time, I don&#8217;t want to get so far down that path that we lose that personalization. So I can understand it from both sides. Strictly from a competitive standpoint, the more other agencies integrate automation and less personalization is better for us because we&#8217;ve really kind of stuck our flag in the ground at being authentic and personable and being real people and not being so automated. But there&#8217;s got to be some of that, you just can&#8217;t, as a business, if you want to scale and grow, it&#8217;s practically impossible for every message or every connection that you send out to be different and personalized. It&#8217;s just not possible. So certainly find a happy medium between that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [21:01]<\/strong>    Exactly, yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [21:02]<\/strong>    But yeah, I don&#8217;t know. As we&#8217;ve worked with you guys, the minute somebody responds, we&#8217;re on that. To me, that&#8217;s like they&#8217;ve expressed interest. Let&#8217;s get in there, let&#8217;s show them what we&#8217;re all about. I couldn&#8217;t even fathom following that up with any sort of automation. So for us, automation only exists in the cold stage, and even that I&#8217;ve always felt a little uncomfortable about, but I&#8217;ve had to get right with that because it&#8217;s a scale thing. You just have to reach a certain number of people to actually get somebody&#8211; You get them at the right time, you never know. Here&#8217;s a great example. Trupanion was one of our biggest clients, second biggest pet insurance company in the world. And it was a cold outreach and I think the third email, we just the right person at the right time. They were in need of what we did and we got it. And it was one of the biggest clients we ever had. And ever since that moment, I&#8217;ve kind of embraced cold outreach because it&#8217;s like, well, you&#8217;re not going to scale. Yeah, you want to send a couple emails every day and write them personally. Yeah, there&#8217;s only so much that you can do. So, I really value what you guys bring to the table in terms of helping businesses create some automation and scale to really ultimately turn social into a lead generating, measurable strategy.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [22:42]<\/strong>    Yeah, definitely. You pretty much nailed it. I don&#8217;t think we would ever do real automation on follow-ups. Just more so guidance and more help with maybe writing or creating a formula for clients to do a response handling because every response is different. You can&#8217;t send a templated response back to that. But yeah, it&#8217;s kind of not necessarily necessary evil, but it helps a lot with efficiency to automate the front end of it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [23:19]<\/strong>    Yeah. No, for sure. Well, is there anything that I haven&#8217;t asked you that you&#8217;d want to share with our audience about anything about you guys or anything in general?<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [23:32]<\/strong>    I would say, I think social selling, especially on LinkedIn has kind of blown up since COVID started. With everyone going home and just having less things to do in their lives in general, activity on LinkedIn has increased exponentially. I believe LinkedIn put out a report where it was like 2700% increase in engagement from January to March and it&#8217;s only gone up since then. We&#8217;re seeing increased connection acceptance rates and reply rates across the board, just because people have more time on their hands. And with a lot of uncertainty, people are more open to conversations that could potentially help them in their business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [24:32]<\/strong>    That&#8217;s a great point. Thanks, I meant to ask that. And this is the conversations that I&#8217;m having with a lot of our clients. Some have had to pause just because they don&#8217;t have a choice, but I think what&#8217;s happening is there&#8217;s fear immediately. Everybody kind of pulled back and now there&#8217;s this realization that, “Wow, this isn&#8217;t going away for a while.” And even when it does go away, then the world&#8217;s changing. More companies are going to be remote and virtual or at least embrace that in a significant way. More pitches and presentations and connecting with people is going to be virtual and digital. So doing these sorts of things has become even more critically important. So that&#8217;s a great point and I don&#8217;t think it&#8217;s going to change. It&#8217;s like we were talking before we hit the record button that I feel, and I think a lot of people feel like this isn&#8217;t going to be the last virus. We&#8217;re going to have another one and then people are probably going to be even more sensitive to that and then immediately reel back into being in their homes and being strictly digital. So I definitely think that what you guys do and what you provide is only going to be in more need as time goes on.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [25:52]<\/strong>    Yeah, absolutely. I think if anything, this time, even if things do go back to normal, this opened people&#8217;s eyes to the power of LinkedIn and the power of social selling just by being on there so much the last several months, but that&#8217;s a good thing for everyone. Ultimately it&#8217;s a lot of small businesses, medium-sized businesses that are benefiting from this and that&#8217;s good for the economy and good for everyone.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:20]<\/strong>    Absolutely. Well, thank you so much for being a part of the show today. Just before we go, tell people how they can find Cleverly and learn more about you guys and hopefully give you guys an opportunity to work together.<\/p>\r\n\r\n\r\n\r\n<p><strong>Cam:     [26:35]<\/strong>    Yeah, of course. You can find us online at cleverly.co, not com, .co. All of our information, our plans, testimonials, case studies, everything is on there. And if you want more info, feel free to social sell me on yourself on LinkedIn. Cam Harati on LinkedIn. You can find me there and I can tell you more, we can have a conversation.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [27:04]<\/strong>    Awesome. And Cleverly has graciously offered to waive any setup fee for gold and platinum plans through the end of the month. So if it&#8217;s something that is of interest to anybody listening here, definitely check them out. We&#8217;ve had a lot of success with them. They&#8217;ve been a great partner for us. So again, Cam thanks for joining us. And that is it for this episode of the Socialistics podcast. We will catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Cam Harati, SVP of Strategy from Cleverly joins us to discuss the power of social selling on LinkedIn and how businesses stand to benefit from integrating a LinkedIn lead generation strategy as part of their overall marketing plan. Socialistics listeners get waived setup fees on gold and platinum plans when mentioning the podcast.    Podcast Transcription: Jason:   [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7073,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/cleverly\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Cam Harati, SVP of Strategy from Cleverly joins us to discuss the power of social selling on LinkedIn and how businesses stand to benefit from integrating a LinkedIn lead generation strategy as part of their overall marketing plan. Socialistics listeners get waived setup fees on gold and platinum plans when mentioning the podcast.    Podcast Transcription: Jason:   [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/cleverly\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-07-29T18:28:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:40:15+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"20 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/cleverly\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-cam-harati\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/cleverly\/#webpage\",\"url\":\"https:\/\/socialistics.com\/cleverly\/\",\"name\":\"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/cleverly\/#primaryimage\"},\"datePublished\":\"2020-07-29T18:28:00+00:00\",\"dateModified\":\"2021-01-14T17:40:15+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/cleverly\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/cleverly\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/cleverly\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/cleverly\/","og_locale":"en_US","og_type":"article","og_title":"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics","og_description":"Cam Harati, SVP of Strategy from Cleverly joins us to discuss the power of social selling on LinkedIn and how businesses stand to benefit from integrating a LinkedIn lead generation strategy as part of their overall marketing plan. Socialistics listeners get waived setup fees on gold and platinum plans when mentioning the podcast.    Podcast Transcription: Jason:   [&hellip;]","og_url":"https:\/\/socialistics.com\/cleverly\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-07-29T18:28:00+00:00","article_modified_time":"2021-01-14T17:40:15+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/07\/image-25.jpg","size":"full","id":7073,"alt":"socialistics-podcast-cam-harati","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"20 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/cleverly\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-25.jpg","width":560,"height":315,"caption":"socialistics-podcast-cam-harati"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/cleverly\/#webpage","url":"https:\/\/socialistics.com\/cleverly\/","name":"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/cleverly\/#primaryimage"},"datePublished":"2020-07-29T18:28:00+00:00","dateModified":"2021-01-14T17:40:15+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/cleverly\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/cleverly\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/cleverly\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Cleverly: LinkedIn Lead Gen With Cam Harati, SVP of Strategy"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5188"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5188"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5188\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7073"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}