{"id":5190,"date":"2020-08-24T18:30:00","date_gmt":"2020-08-24T18:30:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5190"},"modified":"2021-01-14T17:39:17","modified_gmt":"2021-01-14T17:39:17","slug":"liang-du","status":"publish","type":"post","link":"https:\/\/socialistics.com\/liang-du\/","title":{"rendered":"How To Authentically Become An Influencer With Liang Du"},"content":{"rendered":"\r\n<p>This week I sat down with Liang Du, a very successful &#8220;micro-influencer&#8221; who has had great success building a strong following, and leveraged that audience with some impressive work with a variety of well known brands. We discuss how she built her audience, the tools and strategies she uses, and how she stays true to herself while growing her online presence. You can find Liang at <a href=\"https:\/\/www.peachinseattle.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">www.peachinseattle.com<\/a> or on <a href=\"https:\/\/www.instagram.com\/peachinseattle\" target=\"_blank\" rel=\"noreferrer noopener\">Instagram<\/a>.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5102065\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5102065-how-to-authentically-become-an-influencer-with-liang-du.js?container_id=buzzsprout-player-5102065&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [00:08]<\/strong>    Hi, this is Jason Yormark, and welcome to another episode of the Socialistics podcast. I&#8217;m really excited about our guest today. A little bit different than what we&#8217;ve done. Her name is Liang Du and she is what we would call an influencer, perhaps micro-influencer. I know that that word can have a little bit of a negative connotation, but I promise you that she&#8217;s the real deal. I&#8217;ve been wanting to talk to her about her ascent in this world and what she&#8217;s doing with it. But now Liang, welcome to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [00:38]<\/strong>    Thank you, Jason. I am very happy to be here.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [00:41]<\/strong>    Awesome. So full disclosure, Liang and I used to work together many years ago, that&#8217;s how we got to know each other and that company was an interesting experience. But I loved the people that I worked with, that was on my team, and I&#8217;ve always stayed connected to her and I&#8217;ve just watched her ascend with her social media in ways that I really haven&#8217;t seen too many people that I&#8217;m connected to. I mean, she&#8217;s really created an incredible platform for herself and represents some pretty cool brands, and I&#8217;ve just been fascinated by that journey. So I&#8217;m excited to talk to you about that. So why don&#8217;t we start by you just sharing a little bit about who you are, what you&#8217;ve done, and we&#8217;ll go from there.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [01:25]<\/strong>     Okay, well, again, my name is Liang. I&#8217;ve been in the social media space for about 8 to 10 years. So I graduated 10 years ago, started in social eight years ago, and really, I actually started my blog before I actually figured out that I wanted to do social. So I think I kind of figured out that it was a passion project, but I wanted to see if I could make it on my own and see if I could make a living doing social media. So I was really fortunate that I have had the opportunity to work with some really big brands like Xbox, Microsoft Store, T-Mobile, and then now Expedia. And yeah, I love social. Sometimes it can be like a love-hate relationship if you get some 911 crisis or support issues. But I think, for the most part, it&#8217;s been a great channel to really build an online community, form those connections, grow your brand identity, grow brand advocacy. And for people that run small businesses or they don&#8217;t want to spend all those ad dollars on media, social is a great way that you can start organic and then kind of scale-up and layer in paid.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>  <strong>[02:57]<\/strong>     Awesome. So you&#8217;ve obviously had some great experience &#8211; you&#8217;ve got your full-time gig, you&#8217;ve worked with some big brands. What are some of the things that you&#8217;ve been able to take away from some of those corporate, I would say, experiences that have allowed you to kind of build your personal brand?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [03:19]    <\/strong>Yeah, I think that one of the biggest things that my corporate side has helped inform my personal brand on is how to show your impact. So I think when you start out as an influencer or a blogger, it&#8217;s kind of like you don&#8217;t know what you don&#8217;t know. And this is probably if you start out in most things, you just don&#8217;t know some of the things that someone who maybe has three to five years of experience knows, and you&#8217;re not looking out for those things, you&#8217;re not paying attention to those things. When I started working in social media as my day job, I realized, “Wow, we&#8217;re looking at week over week metrics. We&#8217;re looking at month over month metrics. We&#8217;re looking at, ‘Hey, did this campaign meet its goals? How did it drive impressions? Or how did it drive engagements? Are people using the hashtag?’” There&#8217;s definitely qualitative analytics but they&#8217;re also quantitative ones, right? And so that&#8217;s kind of the biggest thing that has helped me develop not just my personal brand and how I want to approach my community and the brands that I work with, but it&#8217;s helped me be kind of a stronger businesswoman because of it. Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [04:48]    <\/strong>I like it. So let&#8217;s get into the stuff that&#8217;s really interesting to me. So let&#8217;s talk about your personal social media. The first question I have is, when I look at your landscape of your socials, it certainly looks like Instagram is the top of the food chain for you. So tell me a little bit about that journey. Where did you start? How did you build your following? I mean, you&#8217;ve got, let&#8217;s see here, 17.4 thousand followers, which is about 14,000 more than I have. So I&#8217;m a little jealous but like I told you in the beginning, I don&#8217;t think anybody cares about a middle-aged guy on Instagram, so I can live with that. But take me through where it started, how you built it, where it&#8217;s at. I am really interested in that journey.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [05:36]     <\/strong>Yeah, so in the very beginning, I only had actually Twitter and then I had a blogger account. It wasn&#8217;t even mine. I didn&#8217;t pay for a domain name, so it was just a free blogger account. And as Instagram became what it is today, if you scroll back into my photos enough, you&#8217;ll see like when it was more personal, and where I started making the small changes to make it become more of a brand. Then Instagram has just kind of taken off because in the very beginning &#8211; I know that this is a more controversial topic, especially, I think in the current kind of pop culture. But back in the day there was a lot of trade for work or do work and then the brand promotes your content type situations. And most brands were only looking for Instagram content. They weren&#8217;t looking for content placements on Twitter or on Facebook. I actually only started my Facebook I think, maybe a year or two ago, so it was definitely a little bit more on the back burner, which is why my Instagram has grown so much. I think it&#8217;s a positive and a negative because, obviously, you devote a lot of time into this one channel and I might not be paying as much attention to the other channels. But the good thing is also that I remember, I don&#8217;t know, small businesses that I have worked with along the way that I feel like we all grew up together, like, we all became this new brand that we are now together. So it&#8217;s just been a great journey, like walking along with other brands and seeing them grow and seeing yourself grow.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [07:43]<\/strong>     So how did you build your following? What contributed to you doing that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [07:46]     <\/strong>Yeah, so in the beginning, I&#8217;m not going to lie, I was totally clueless. I think two components made me really, really successful in the beginning. One is getting very local and networking locally. That means getting invited to the PR&#8211; Trying to figure out what are the top PR firms in Seattle? Who are the names that I need to know? Who are the names that I need to connect with? Getting on those lists, getting on those invites. And then the second part of it was I worked with a lot of national brands in the very beginning. I&#8217;m not going to lie, I was paid literally nothing. So it would be considered like essentially a trade or products type thing.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [08:38]<\/strong>     How did you get on their radar? How did you get on the radar of a national brand when you don&#8217;t have the biggest following?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [08:44]     <\/strong>So there are these sites that kind of aggregate opportunities for bloggers. And there&#8217;s so many, I mean, there&#8217;s probably like upwards of 100. But I would recommend if you are starting out just to pick a handful, and then really quantify if these are the right sites, and if they&#8217;re not the right sites for you, get off them and try new ones. I remember when there was a time when I used to be on eight different ones and then I realized, “Wow, I only use I think two of them, so why do I have all these different accounts?”  You have to link them to your Instagram, and you have to do all this work on the back end; fill out your profile, all these things. So I pretty much just focus on the ones that I know have, not just maybe better quality campaigns, but more consistent campaigns, like they&#8217;re getting more work onto their platform. And then also there are ones that only do trades or they only do free promotion. Sometimes you might even have to buy the product. So those I would typically say I&#8217;m not looking so much into right now. But these are more of the fast turn quick jobs. They expect once you&#8217;re approved for the campaign, they&#8217;re going to see something in like two weeks.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [10:06] <\/strong>    How long did it take you to kind of get to where you&#8217;re at from the beginning to like the size audience that you have right now?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [10:11]<\/strong>     Oh, my gosh. I would say like three years ago, I was probably just under 10K. So I mean, years. It&#8217;s not overnight. And full disclosure, one of the reasons that my platform in the very beginning grew so fast was because I was working with Neutrogena and one of the benefits of working with them was that they were going to use my account in ads. So I said, “Well, this is great exposure, not only for people that are not following me but people that are following or interested in Neutrogena, right? And so I actually was seeing a ton of growth when I was partnering with them and then I think I did like two or three different campaigns with them.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [10:56]     <\/strong>Got you. Are you in a place right now where you have to pursue opportunities or do they pretty much come your way?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [11:02] <\/strong>    It&#8217;s both. So the thing is, if you only wait for opportunities to come your way, you&#8217;re just not going to be working as consistently.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [11:12]<\/strong>     Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [11:13] <\/strong>    I know that maybe the outside looking in, it looks like, “Oh, you just get to go to this comped meal” or all these things, but I will assure you, there are at least 20 emails back and forth that have arranged this meal or this experience. I know all the pointers that I want to talk about, and I know my experience that I want to share, but you have to get on the same page with which accounts you tag, what hashtags you use because the brand is measuring all these items. So I need to make sure that I&#8217;m aware of those. And then reaching out to brands, I have definitely done my fair share. I&#8217;ve also definitely either not gotten a response or been denied or said it&#8217;s not the right time. I think the most important thing about reaching out is sharing something kind of brief, maybe in DMs if you don&#8217;t have an email. I always try to gauge the interest level first, and then if it seems like the brand is interested then I ask for an email contact where I can send my media kit which has all my stats in it, examples of past work, or I can even put together something special for the brand.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason<\/strong>:  <strong>[12:39]<\/strong>     Got it. I want to stop you there. You had mentioned something, you said you have a media kit.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [12:44]<\/strong>     Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [12:45]  <\/strong>  So tell me more about that. When you developed that?  When that came into play? How you got it done?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [12:52]     <\/strong>Okay, so I have only had my professional media kit for, I want to say a year. The easiest thing to do is just to go on Etsy and download a template and then you just fill it out. You swap in your own photo and you put in all your insights from all the different channels that you own. So for me, I obviously have Instagram, I have my monthly unique views for my blog, Pinterest, Twitter and Facebook. And then it might say maybe like a high-level range for rates and then maybe some examples of similar work that you&#8217;ve done. So if I&#8217;m pitching a travel experience, I would want to show other examples of travel that I&#8217;ve done.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason<\/strong>:  <strong>[13:47]<\/strong>     Got it. Very cool. So tell me, here&#8217;s a question I think you&#8217;ll have fun with. What makes the difference between a legitimate influencer and one that is just surface level &#8211; they&#8217;re just in it for the money, it’s just a cash grab for them and the business doesn&#8217;t really stand to benefit from them. Everybody thinks that they&#8217;re an influencer these days, especially in the current climate. You are not that, I want to be very clear with the audience. I&#8217;ve watched you do this for years and you&#8217;re doing it the right way. So in your opinion, what are the things that separate someone like yourself, that&#8217;s doing what you&#8217;re doing versus somebody that maybe has an artificial following and is just trying to use flash just to get attention and earn as many bucks as they can.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:  [14:38]<\/strong>   Okay, so the first thing that I want to say is no matter what kind of blogger you are, I have respect for anyone because it does take a lot of behind the scenes work even the ones that are just slinging LIKEtoKNOW.it links and whatnot. I think the biggest thing for me is that I came in to starting a blog, which I didn&#8217;t even think was going to become anything. I really was just treating it as a diary of places to go in Seattle, things to do, restaurants to eat at. It was more of my way to get to know the city because I am originally from Atlanta. And so for me, my whole journey has been like I just really want to build relationships with people and I want to find that synergy between myself, my brand, the other brands that I work with, my followers, other bloggers. No matter who it is, I just want to create that relationship and develop that synergy. I&#8217;ve always put that as number one and then number two is really okay, my time is obviously limited, how do I prioritize? Okay, this brand wants to hire me for some work. They&#8217;re paying so then I prioritize that at a little bit of a higher level, right?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [16:04]<\/strong>    Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [16:05]<\/strong>     But I will say that even with the paid work, affiliate links, that&#8217;s a way to get paid for sure. And I think if you&#8217;re a blogger and you are making it big with affiliate links and it&#8217;s really driving impact for you, of course, keep on doing it, don&#8217;t stop doing it. The reason why I stepped away from sharing &#8211; even if I share links now, I don&#8217;t use the affiliates because it takes so much time to curate all your outfits on those platforms and get links and then keep those links organized that I&#8217;m sorry, I&#8217;m not going to do that for a 2% commission, because it&#8217;s only 2% off of what people are actually buying. It&#8217;s not off the actual traffic or the actual clicks.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [17:02]<\/strong>    Right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [17:03]    <\/strong>And a lot of people don&#8217;t know this but a lot of affiliate marketing, they only pay you out at a certain threshold. So they won&#8217;t cut you like a $50 check, you have to hit maybe over $100 before they pay you or whatnot. For me, it just wasn&#8217;t worth my time and so I just made a conscious decision. I get a lot of people that DM me that say, “Want to learn more about your outfits”, whatever. I try to share as much as I can but I&#8217;m also not someone who buys clothes all the time and is always in the stores<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [17:37]<\/strong>    Especially now<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [17:37]<\/strong>   Yeah, so for me, it also takes more time. I&#8217;m not refreshing my wardrobe as much, it just doesn&#8217;t make as much sense. So I stepped away from that. Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [17:50] <\/strong>   Got it. Let&#8217;s say you&#8217;re an aspiring influencer and you want to do it the right way. What are the top two or three things, or pieces of advice that you would give for somebody that&#8217;s just kind of just starting out to set themselves up for success?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [18:08] <\/strong>    Okay, I know everyone says this, so I don&#8217;t want to sound like a broken record, but number one is for sure, be authentic. Be true to yourself. If you end up doing it and you don&#8217;t like it, or there&#8217;s something about whatever you&#8217;re doing that you don&#8217;t like and you want to pivot, honor those feelings and honor the way that you&#8217;re thinking. Because chances are if you don&#8217;t feel right, or it doesn&#8217;t feel right to you, someone else who&#8217;s part of your audience might feel that way too. And if you can pivot yourself into something else, it just shows that you are savvy in your business and that your business can be successful in another way, right? So that&#8217;s the first thing. I think the second thing that I really just wish I could tell all bloggers and all influencers is to really focus on learning about social.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [19:05]     <\/strong>The reason why there is kind of this inauthentic following and engagements and whatever, I mean, one it is yes, due to the fact that Instagram has made some changes along the way. But two, I think is really people seeing other people be really successful and get 1000 likes on a photo and then wanting to emulate that. But in reality, if you don&#8217;t have over 100,000 followers, you&#8217;re not going to get 1000 likes. Really truly learn what is engagement rate? How is it supposed to work? What is it supposed to look like? My following is this number but my region impressions is this number. Does that look right? Is that in the same kind of ratio? Because it&#8217;s not a one for one and so that would be my second thing. And then my third thing, I know that it&#8217;s hard in the beginning. I mean, I&#8217;m not going to sit here and say I never have taken product and done work, or have done trades. But I think in the beginning, you tend to want to work with as many people as possible, and you just will kind of take anything. So my advice there would be to really consider if that brand is the right fit for your business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [20:33]    <\/strong>Yeah<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [20:34]<\/strong>     Don&#8217;t just sling product to sling product or don&#8217;t just talk about it to talk about it. Make sure that it&#8217;s the right fit for you, that you can actually use this product in your daily life or whatnot, so that it does feel right, and five years down the line, when you look back at it, you&#8217;re not like, “Oh, I didn&#8217;t feel that comfortable working with that brand.” You&#8217;re not regretting it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [21:01]    <\/strong>So let&#8217;s take it from the other side of things, from a company&#8217;s perspective. Let&#8217;s say I&#8217;m a company, I come across you. I like what I&#8217;m seeing, and I want to work with you. What does that engagement look like for a company? What are they having to pay you or provide you? I’d love for listeners that are coming from that side of it to have some sense of magnitude about what it&#8217;s like to work with somebody like yourself.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [21:27]     <\/strong>Yeah. So if a brand is interested in working with me, usually they&#8217;ll reach out either in DMs or they&#8217;ll submit a contact form on my blog, or if they already have my email they&#8217;ll just email me directly. Usually, they start pretty high level. They&#8217;ll just ask are you open for a collaboration between these and these months or within the next three months or something. And then I will usually reply back and say either I&#8217;m interested and I can take on the workload, depending on what it is, or I&#8217;ll say, “This timeline doesn&#8217;t quite work but I can adjust it for another month” and see if they still want to work with me. Usually, after I say that I&#8217;m interested, I&#8217;ll ask a lot of questions about the campaign itself. So, what is the messaging? What&#8217;s the high-level goal? And then that&#8217;s where the conversation where you want to broach if there&#8217;s any media budget &#8211; budget for you to go and create content, budget to boost the post on Instagram. It&#8217;s kind of a way for the creator to know like, “Okay, this brand is really&#8211; They&#8217;ve set aside this budget for this campaign. It sounds like it&#8217;s going to be successful.” And then I usually say, “Sounds great” or “Would love to learn more”, and then maybe we&#8217;ll jump on a call.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [23:03]     <\/strong>There might be some conversations around “How do you see this campaign coming to life on your channel?” So usually I just give some bulleted examples because at this stage, there&#8217;s no contract yet; you don&#8217;t really want to write everything yet. And so I think it&#8217;s just like any other professional meeting where both groups are learning about each other. I&#8217;m learning about their goals, they&#8217;re learning about my approach for their goals and then I&#8217;m just kind of learning about, if they want a blog post or if it&#8217;s only on Instagram, if they want video content, if they&#8217;re going to boost it with ads, if it does require extensive editing or something on the photography side. So it&#8217;s really just about all the details and then just assessing like, “These are the goals for them. I feel like I&#8217;m on the right path to help them reach these goals.” Sometimes there are goals where I look at them and it&#8217;s like I don&#8217;t know anyone who could do that and so then I usually say, “It&#8217;s probably not the right fit right now.” But yeah, it&#8217;s just really about aligning both sides and making sure that no one walks away from this deal feeling like they didn&#8217;t get what they wanted.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:  [24:33]<\/strong>     Yeah. I think one of the things that stands out for me when you look at your Instagram feed is that the quality of the imagery is, I mean, you could tell something&#8217;s going on other than just somebody taking a picture with a phone. So how&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [24:47] <\/strong>    It&#8217;s actually both.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [12:48] <\/strong>   I mean, some, obviously everything can&#8217;t be a Picasso but what are you doing in terms of, how are you facilitating that? Obviously, because there&#8217;s a lot of shots of you, somebody taking people or you&#8217;ve got a tripod or something going on or some sort of professional device. What does that look like for you in terms of how you capture your imagery?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [25:09]<\/strong>     So, I would say probably right now is a little bit skewed, but usually where I like to be is 70% professionally shot. I usually work with like two or three photographers in the Seattle area, so it&#8217;s time that I book with them. I usually shoot at least once or twice a month, and I&#8217;ll try to wrap my campaigns into the two shots. I tried to plan it so that it&#8217;s a smart use of both of our times.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [25:40]    <\/strong>Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [25:41]<\/strong>     So yeah, I would say like 70 to 75% of the content is professional photography and then I would say the rest is shot on iPhone or shot with a tripod.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [25:56]<\/strong>    Got it. So you&#8217;re scheduling shoots and you&#8217;re getting a bunch of stuff that you&#8217;re using over time that fulfills sponsorship opportunities with clients, basically.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [26:07]<\/strong>     Yes. Yeah and normally how I like to shoot is, you see a lot of these like very curated feeds in influencers and bloggers and I don&#8217;t like to be as curated but I do like to be very seasonal. So in the spring, making sure you have a lot of bright colors and flowers, holiday time there&#8217;s a lot of red, Christmas trees, whatever it is, pumpkin spice latte, whatever it is, I think being a little bit more conscious of the season really gives it that warmth feel that I think followers and the audience really like. And then I will pay for more time if I need more time to shoot an ad for something.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:51]    <\/strong>See this is what I&#8217;ve been missing. I need to hire somebody to take my pictures once or twice a month to help me look good for my Instagram feed.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [27:00]     <\/strong>Yes. So content quality, it&#8217;s a huge factor in metrics like so how things go well on social. Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason<\/strong>:   <strong>[27:09]<\/strong>    Oh, yeah. For sure. Well, unfortunately for me, it would probably take 15 minutes for one shot to look right. Like, the amount of time&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [27:17]     <\/strong>It’s always like that. Honestly, sometimes I look at the photos from my photographer and one will look amazing and then like the next 50 photos will just be like no.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [27:27]<\/strong>    Thank God for digital, thirty-four years ago, that would be a lot more difficult to deal with. That&#8217;s really cool. So, if you could go back and when you think about what you&#8217;ve done and where you&#8217;re at, is there anything that you would have done differently along the way?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [27:48]<\/strong>     Oh, my gosh, so I think the only thing that I would have done differently is, I would have probably started my Facebook page a little sooner than I did. I was just going back and forth on it because Instagram was taking so much of my time.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [28:07] <\/strong>   Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [28:07]    <\/strong>And so I was like, “Okay, well, as long as I just share, like one thing a week from Instagram, it should be fine.” And then I even stopped doing that because I was just not seeing any traction. Because right now the market is supersaturated,<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [28:20]    <\/strong>Right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [28:21]    <\/strong>It&#8217;s not the same market as it was like seven years ago, six years ago. So that is one thing that I kind of regret. And then the other thing that I know a lot of bloggers are capitalizing on right now is just the use of Pinterest. And so I&#8217;ve actually been doing a lot of work on my own just like getting myself ramped up to really start managing my Pinterest much better.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason<\/strong>:   <strong>[28:51]<\/strong>    Yeah. So you had mentioned earlier in the conversation that one of your tips was, learn as much as you can about social. What are some of the things that you do still, to kind of stay ahead of the curve and educate yourself to continue to do what you do?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [29:11]     <\/strong>Yeah, so I&#8217;m really fortunate that my day job is social and so, it is part of my day job to learn about social and have contacts at all the channels that will tell the team what&#8217;s upcoming, what are these new ad placements, all the ins and outs. Outside of that, obviously LinkedIn, I think, is a great resource. Whether it&#8217;s in groups or just people who you follow, that will just share updates around how they&#8217;re using social, what new features are coming out, obviously, algorithm updates are always really hot, things like that. And then, one of my biggest things which I think I&#8217;ve been pretty fortunate because I know some bloggers don&#8217;t. There&#8217;s an aversion to sharing secrets within the community. I know we talked about this earlier where for me, it&#8217;s like if you ask me a question one on one, I&#8217;m going to tell you the straight answer. I&#8217;m not going to sugarcoat it, I&#8217;m not going to send you on a wild goose chase. I would just tell you the way that I do things and why. So I think I&#8217;ve been pretty lucky in that sense too because I am the one providing some of these answers that I also feel like I should be asking. And so when I first started out I definitely asked fellow bloggers what they were doing to work with more brands, how they got on PR lists. Just making sure that you&#8217;re checking all your boxes, no matter how uncomfortable you can feel in the moment. And actually, I’ve ended up getting a lot of opportunities because of those initial uncomfortable conversations, and those people actually looped me into things.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:    [31:21] <\/strong>  Very cool. What&#8217;s the future like for you when you think about this? Where are you hoping to take this and go with it?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:    [31:29]<\/strong>    Honestly, gosh, Jason, I have no idea. I think that even at the end of last year, I was like Instagram is very different than it was when it first started. And it&#8217;s getting to the point where I was like I don’t&#8211; Okay, I remember the day that I started using the right hashtags, and I swear even my photos of food would get hundreds of likes because I was properly hashtagging them. And as a person, I might have had like 1000 followers, right? And so as someone at 1000 followers, to see that impact immediately. It feels great, right?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [32:20]<\/strong>    Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [32:21]     <\/strong>But over the years, Instagram has made that more difficult. And so at the end of last year, I was just like, “Should I take somewhat of a backseat to this?” I&#8217;m really liking my day job, obviously, it pays the bills. And I don&#8217;t know if I devoted more time to being an influencer if I would see the results that I want to see. And also there&#8217;s also this fun factor. It is a lot of work so it also needs to be really fun in order to take that extra time that you could be doing nothing, to do. So I would say, probably in the last like six months, I&#8217;ve been back and forth. I guess, this year maybe a little bit fortunate because work has slowed down, in terms of just blog work has slowed down quite a bit. There&#8217;s just not as much demand and I feel like I&#8217;m not drowning. I feel like I&#8217;m better equipped, like, if a brand were to approach me I would be able to take on that work like a no brainer.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [33:41]     <\/strong>But I don&#8217;t know, I mean, I want to continue to just build relationships. I have made so many just friends and acquaintances and just great relationships with businesses local to Seattle, like small business owners, networking organizations. And people that I met through blogging that I then later found out, oh, we have more connections than I thought when we met first. So I think really, it&#8217;s just, I want to grow my relationships and my Seattle base further. And if there&#8217;s any opportunity for me to maybe pivot and be really successful on Pinterest or do something a little bit different. I&#8217;m actually probably going to be looking into a website redesign soon because I feel like it&#8217;s coming up. I&#8217;ve never had a v2, so this is just the version that I&#8217;ve always had. And so yeah, looking for opportunities to pivot, reinvent yourself. Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [34:54]    <\/strong>Yeah, I can relate to that. That&#8217;s the toughest thing when you&#8217;re balancing a career and then a side hustle like this, it&#8217;s hard. Because when you talk to some of the most successful people in the world they always say the one thing that&#8217;s pretty much a common denominator that took them from small little thing to bigger, giant thing is focus, which is hard to do when you&#8217;re pulled in multiple directions. So I can totally get that. Plus, it&#8217;s such a crowded environment. You&#8217;re competing with more out there but I love what you&#8217;ve done. Honestly, I think one of the things you should do is you should create a webinar or training module or system for how to become a real, effective micro-influencer. I&#8217;m serious. I&#8217;m sure there&#8217;s stuff like that out there and I&#8217;m sure most of it is garbage but I don&#8217;t know, I think that you&#8217;ve created something for yourself that&#8217;s pretty unique. And that might be another way to you know, having an extension of your brand is helping people figure out how to do this for themselves. Because I think a lot of people are looking for that right now. There are a lot of people that are in need and looking for ways to make money that is independent, especially in the current climate. So that would be my advice. Yeah. Here&#8217;s another thing for you to do, like you&#8217;re not busy enough. But I mean you have a really unique experience. I think people would really like to learn from that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [36:30] <\/strong>    Yeah, and I think in social media overall, it&#8217;s really easy to compare yourself to other people on social media. And then also I think, as a creator on social media, it&#8217;s also very easy. We&#8217;ve all seen people only share their highlight reel and things like that. And I mean, the one thing that has kept me really grounded is, of course, when you see someone else get a campaign that maybe you didn&#8217;t get or something, there&#8217;s always that initial like, “Ooh, oh my gosh, how did that person get it?” But I&#8217;ve been really grounded in the fact that I just tell myself, it wasn&#8217;t the right fit, or they might reach out to me next time or something. I always tell myself instead of beating up on yourself, I always give myself like, “Okay, it wasn&#8217;t the right timing or it wasn&#8217;t the right fit.” Or I say, “Oh, this person, they did it much better than I could have.  And this is a great example, maybe I can learn from them.” I always try to not get too in my head about it and just be more practical because, at the end of the day, it&#8217;s two businesses coming together. And if it&#8217;s not a good fit for one or the other, it&#8217;s just not going to work, you know?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [38:05] <\/strong>   No, I totally get that. Well, this is fascinating stuff. Thank you so much for taking the time to talk with me, with us today. Where can people find you? Tell them where to find you?<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [38:18]     <\/strong>Where can people find me? Well, as Jason mentioned, Instagram is where you can find me. I&#8217;m @peachinseattle and then you can also check out my blog www.peachinseattle.com.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [38:32]<\/strong>    Awesome. Well, thank you so much for your time today. I really look forward to watching you continue to do your thing and wish you all of the luck with everything that you do.<\/p>\r\n\r\n\r\n\r\n<p><strong>Liang:   [38:41] <\/strong>    Thank you so much, Jason, I wish you the same.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [38:45] <\/strong>   Thanks. Thanks. And that is it for this episode of Socialistics. If you&#8217;re listening, please leave a review, a rating, all that good stuff. And as always, your feedback is welcome. Thanks for listening and we will catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Liang Du, a very successful &#8220;micro-influencer&#8221; who has had great success building a strong following, and leveraged that audience with some impressive work with a variety of well known brands. We discuss how she built her audience, the tools and strategies she uses, and how she stays true to [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7060,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Authentically Become An Influencer With Liang Du - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/liang-du\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Authentically Become An Influencer With Liang Du - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Liang Du, a very successful &#8220;micro-influencer&#8221; who has had great success building a strong following, and leveraged that audience with some impressive work with a variety of well known brands. We discuss how she built her audience, the tools and strategies she uses, and how she stays true to [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/liang-du\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-24T18:30:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:39:17+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"30 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/liang-du\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-liang-du\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/liang-du\/#webpage\",\"url\":\"https:\/\/socialistics.com\/liang-du\/\",\"name\":\"How To Authentically Become An Influencer With Liang Du - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/liang-du\/#primaryimage\"},\"datePublished\":\"2020-08-24T18:30:00+00:00\",\"dateModified\":\"2021-01-14T17:39:17+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/liang-du\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/liang-du\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/liang-du\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How To Authentically Become An Influencer With Liang Du\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Authentically Become An Influencer With Liang Du - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/liang-du\/","og_locale":"en_US","og_type":"article","og_title":"How To Authentically Become An Influencer With Liang Du - Socialistics","og_description":"This week I sat down with Liang Du, a very successful &#8220;micro-influencer&#8221; who has had great success building a strong following, and leveraged that audience with some impressive work with a variety of well known brands. We discuss how she built her audience, the tools and strategies she uses, and how she stays true to [&hellip;]","og_url":"https:\/\/socialistics.com\/liang-du\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-08-24T18:30:00+00:00","article_modified_time":"2021-01-14T17:39:17+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/08\/image-20.jpg","size":"full","id":7060,"alt":"socialistics-podcast-liang-du","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"30 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/liang-du\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/08\/image-20.jpg","width":560,"height":315,"caption":"socialistics-podcast-liang-du"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/liang-du\/#webpage","url":"https:\/\/socialistics.com\/liang-du\/","name":"How To Authentically Become An Influencer With Liang Du - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/liang-du\/#primaryimage"},"datePublished":"2020-08-24T18:30:00+00:00","dateModified":"2021-01-14T17:39:17+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/liang-du\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/liang-du\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/liang-du\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How To Authentically Become An Influencer With Liang Du"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5190"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5190"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5190\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7060"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5190"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5190"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5190"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}