{"id":5194,"date":"2020-07-23T18:43:00","date_gmt":"2020-07-23T18:43:00","guid":{"rendered":"https:\/\/socialistics.com\/?p=5194"},"modified":"2021-01-14T17:40:24","modified_gmt":"2021-01-14T17:40:24","slug":"socialistics-podcast-first","status":"publish","type":"post","link":"https:\/\/socialistics.com\/socialistics-podcast-first\/","title":{"rendered":"Socialistics: Social Media Agency Stories"},"content":{"rendered":"\r\n<p>Welcome to the inaugural episode of the Socialistics Podcast where we talk all things social media agency. Inside stories about agency life, the ups, the downs and everything in between. We&#8217;ll feature a variety of guests including agency owners, clients, technology pros and more!<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-4741082\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/4741082-socialistics-social-media-agency-stories.js?container_id=buzzsprout-player-4741082&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>[00:10]<\/strong>     Hello, and this is Jason Yormark for the Socialistics podcast, the inaugural episode of the Socialistics podcast. You might be asking yourself, what is the Socialistics podcast? And the truthful answer is I&#8217;m not exactly sure. What I can tell you is that my tagline is “Social Media Agency Stories”. I&#8217;ve always wanted to do this. I actually have. I have another podcast that I do for adult baseball called Comebacker and had such a great time with that, and knew that I wanted to translate that experience into something professionally, to go along with our social media agency, which is also called Socialistics, but I wasn&#8217;t really sure what that would be. I didn&#8217;t want to do something just to do it and I took a lot of time to just think through what exactly that could be. And ultimately, I think it was an episode of Jason Swenk, who&#8217;s kind of an agency coach &#8211; he doesn&#8217;t like to be called that but I can’t think of a better term. He had a really great episode with somebody that talked about how if you&#8217;re not doing a podcast as an agency, you&#8217;re really missing out. And I think that was the driving force for me to just say, “You know what? I&#8217;m just going to do this and see where it goes. And it may not be perfect but I&#8217;m just going to test it out and see what happens.”<\/p>\r\n\r\n\r\n\r\n<p><strong>[01:39]<\/strong>     And I always think about all these incredible experiences and stories &#8211; good and bad &#8211; that I go through every day as an agency owner, especially during the current pandemic, and how that&#8217;s impacted the business. And a lot of days are hard and sometimes I wish I had an outlet. I wish that I had more means to connect with people and share what I&#8217;m experiencing because I know I&#8217;m not the only one that&#8217;s going through this, and trust me, I am not complaining. There are people in businesses out there that are far worse off than I am, or our business is, but we all have challenges at varying degrees. And for me, this is just an opportunity to talk through some of that stuff. And not only talk through that but talk to really interesting people across the world that are involved in what we do, whether that&#8217;s other agencies &#8211; there&#8217;s plenty of work to go around. I have no problem talking to colleagues and sharing best practices and hearing what their frustrations and challenges are and talking to platforms that we use. There are so many great pieces of technology that we use that so cool, and just being able to introduce that to more people. So I&#8217;m working to line up folks to talk to to learn a little bit more about those platforms and why they&#8217;re so fantastic. We&#8217;ve been through so many of them that I want to pass on that great information and everything in between. Sharing client stories and just the insights of what it&#8217;s like to start an agency, and what&#8217;s involved with that, and what&#8217;s worked and what hasn&#8217;t, and the tough days, the great days. If we can help anybody else navigate a similar career path, then this was all worth it.<\/p>\r\n\r\n\r\n\r\n<p><strong>[03:31]<\/strong>     So that&#8217;s what the Socialistics podcast is going to be. And certainly, it&#8217;s going to be more than just me babbling on and on. Your introductory episode is going to be that but moving forward, I certainly plan on bringing other individuals into this that are far more interesting than me, and including members of my team and like the folks that I just described. So I&#8217;m really looking forward to seeing where this goes and just kind of take it from there.<\/p>\r\n\r\n\r\n\r\n<p><strong>[04:00]<\/strong>     So as far as what&#8217;s Socialistics? So let me give you a little bit of backstory. I&#8217;ve been a marketer for, gosh, 23, 24 years. I kind of fell into it. I was in college, I went to Illinois State and I had no idea what I wanted to do. I got about two or three years into college and ultimately, I remember going and visiting with one of the advisors and I think I remember saying, like, “What degree will just get me out of here the quickest?” And ultimately, it was communications, which is pretty broad, but that&#8217;s what I decided to do. So I got involved in doing some cool radio and TV things and did really well with that. I enjoyed it, but then when I found out what it paid, I wasn&#8217;t so interested in that, especially back, you know, you&#8217;re talking late ‘90s. So getting into broadcast news or things of that nature was challenging financially, to say the least.<\/p>\r\n\r\n\r\n\r\n<p><strong>[05:07]<\/strong>     So ultimately, I just kind of fell into marketing. I had worked in the computer section of the bookstore at the school I was at, so I was around computers a lot and just learned how to do websites and just kind of fell into it. And that&#8217;s how I got into marketing. I mean, if I can go back and do it all over again, I might not choose marketing just because of how volatile marketing is. I mean, I felt embarrassed by how many jobs I had had throughout my career. It was just like, I’d look at my LinkedIn and I’d be, “Jeez, I can&#8217;t hold a job.” I mean, it was rarely ever performance related. It was because I got laid off or who knows what reasons. I was always embarrassed by that but it wasn&#8217;t until I started to look at other marketers on LinkedIn, and how rare it was for anybody to be anywhere for an extended period of time. So my entire life, I&#8217;ve been looking for this stability. And always, in my mind, it was wired in a way where it&#8217;s like, “I&#8217;ve got to find that nine to five job. I&#8217;ve got to find that desk job and drive to work and have the benefits and the stability that I need to raise a family. And that&#8217;s what I need. And that&#8217;s the way it&#8217;s going to be” even though my heart and my brain was telling me that I needed to do my own thing, and that&#8217;s how it was wired. But that&#8217;s not what responsible people do. You got to have a job, you have to take care of your family. You got to have that paycheck and I did for a good 17, 18 years. But in the back of my mind, I always knew that I need to be doing my own thing, that&#8217;s the way I&#8217;m wired.<\/p>\r\n\r\n\r\n\r\n<p><strong>[06:51]<\/strong>     And it wasn&#8217;t until the last role that I had. I was let go, reasons out of my control. [I] did a great job there, loved being there, and I had had it at that point. I was just like, the stability that I was looking for wasn&#8217;t what I thought it was. The stability was doing my own thing, controlling my own fate. And luckily for me, I&#8217;d started thinking about that already and kind of putting the ball in motion a little bit to create that opportunity for myself. But ultimately, I just got thrown into the fire and decided I&#8217;m just going to do my own thing. I&#8217;m tired of my fate not being in my own control. And my kids were a little bit older, I had a little bit more of an appetite for risk, and decided to just go for it. So I launched Socialistics a couple years ago, and it&#8217;s been the best decision I&#8217;ve ever made. I lived in fear of failing, like, “What would I do? How am I going to pay the bills if this doesn&#8217;t work?”, and that fear is what always held me back. And in other instances throughout my life when I thought I might make that leap, it was the fear that prevented me from doing what needed to be done to make something successful on your own. And once I got past that, at least most of it, that&#8217;s when things started to take off. It felt like a weight had been lifted off my shoulders, and that I was then capable of building something sustainable. And that&#8217;s exactly what&#8217;s happened.<\/p>\r\n\r\n\r\n\r\n<p><strong>[08:32]<\/strong>     We&#8217;ve built a really cool brand. I&#8217;ve surrounded myself with incredible teammates, partners, people that I love working with, and it&#8217;s worked. We&#8217;ve been doing it for a couple of years now. It&#8217;s really grown over the past eight months, and certainly, the pandemic has kind of thrown a wrench in that, regardless of whether our opinion is you should double down on marketing in a pandemic. But hey, if you have a choice between doing that or paying your people then yeah, we understand, pay your people. We never try to advise clients otherwise. So we&#8217;ve taken a hit and we&#8217;re trying to work through that but at the same time, we&#8217;ve had to evolve. We live in a different world and we need to adjust and things are starting to kind of pick back up for us. And now there isn&#8217;t a better time to launch a podcast and try to reach more people and help people make good decisions around their marketing. We certainly specialize in social media, that&#8217;s our strength. We do other things, but ultimately, we picked a lane. One of the best pieces of advice I ever got is to really pick a specific niche or area of expertise. I think the days of being a generalist are few and far between. You know, you&#8217;re always going to have your giant agencies that are able to do that but I think any newcomers are really going to have to kind of go down that path. So we were lucky to take that path early on, and really position ourselves as just social media and really B2B social media. But we&#8217;ve had some incredible experiences.<\/p>\r\n\r\n\r\n\r\n<p><strong>[10:17]<\/strong>     We&#8217;ve worked with the Air Force, we&#8217;ve worked with Trupanion, which is one of the world&#8217;s largest pet insurance companies. So we&#8217;ve really got to work with some big brands, and even the small Mom and Pop shops. We really try to have a spectrum of clients that we work with. So we&#8217;ve really had a lot of experiences across so many different products and services and sized companies, learned so much over the years in terms of how to best leverage technology. And ultimately, at the end of the day, make sure that any company that invests in an agency for their marketing or social media, gets a return on their investment. That&#8217;s what they care about. It&#8217;s not about the vanity metrics and we really try to build an environment that provides them a clear understanding of “We are spending this and we are getting this out of it.” Because if you can do that, clients will stick with you forever. And we&#8217;ve had a lot of luck in being able to work with a variety of clients for an extended period of time.<\/p>\r\n\r\n\r\n\r\n<p><strong>[11:17]<\/strong>     So that&#8217;s who we are. And then trust me when I say there have been probably more hard days than good ones, it is a grind. And some days I worry that everything&#8217;s going to blow up and it&#8217;s not going to work and everything&#8217;s going to change so dramatically. Are we going to be able to keep up? And that anxiety and stress that&#8217;s unfortunately, the dark side of being an entrepreneur. It doesn&#8217;t go away. You always have that, it always lives inside you. It&#8217;s not so much about learning how to get rid of it as much as it&#8217;s learning how to live with it and that&#8217;s tough. So my hope is, maybe this podcast is an opportunity to kind of share those insights and frustrations with others that maybe have gone through similar types of things. But yeah, I really look forward to sharing those stories with everybody.<\/p>\r\n\r\n\r\n\r\n<p><strong>[12:15]<\/strong>     So that&#8217;s it. That&#8217;s what this is going to be. That&#8217;s who it&#8217;s going to be for. I hope you stick around. If you&#8217;re listening to this, there are already some other episodes that we&#8217;ve launched in conjunction with this first one that I hope you take a listen to. So hopefully, you find some value or entertainment, or learnings from what we do here. And we&#8217;re always looking for your feedback and questions and whatever you think we should be doing to make this as great as it can be. So thanks for listening. Look forward to our adventures together and look forward to some future episodes of the Socialistics podcast. Talk to you soon.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Welcome to the inaugural episode of the Socialistics Podcast where we talk all things social media agency. Inside stories about agency life, the ups, the downs and everything in between. We&#8217;ll feature a variety of guests including agency owners, clients, technology pros and more!   Podcast Transcription: [00:10]     Hello, and this is Jason Yormark [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7075,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Socialistics: Social Media Agency Stories - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/socialistics-podcast-first\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Socialistics: Social Media Agency Stories - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Welcome to the inaugural episode of the Socialistics Podcast where we talk all things social media agency. Inside stories about agency life, the ups, the downs and everything in between. We&#8217;ll feature a variety of guests including agency owners, clients, technology pros and more!   Podcast Transcription: [00:10]     Hello, and this is Jason Yormark [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/socialistics-podcast-first\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-07-23T18:43:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:40:24+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-episode-1\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/#webpage\",\"url\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/\",\"name\":\"Socialistics: Social Media Agency Stories - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/#primaryimage\"},\"datePublished\":\"2020-07-23T18:43:00+00:00\",\"dateModified\":\"2021-01-14T17:40:24+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/socialistics-podcast-first\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/socialistics-podcast-first\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Socialistics: Social Media Agency Stories\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Socialistics: Social Media Agency Stories - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/socialistics-podcast-first\/","og_locale":"en_US","og_type":"article","og_title":"Socialistics: Social Media Agency Stories - Socialistics","og_description":"Welcome to the inaugural episode of the Socialistics Podcast where we talk all things social media agency. Inside stories about agency life, the ups, the downs and everything in between. We&#8217;ll feature a variety of guests including agency owners, clients, technology pros and more!   Podcast Transcription: [00:10]     Hello, and this is Jason Yormark [&hellip;]","og_url":"https:\/\/socialistics.com\/socialistics-podcast-first\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-07-23T18:43:00+00:00","article_modified_time":"2021-01-14T17:40:24+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/07\/image-26.jpg","size":"full","id":7075,"alt":"socialistics-podcast-episode-1","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/socialistics-podcast-first\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/image-26.jpg","width":560,"height":315,"caption":"socialistics-podcast-episode-1"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/socialistics-podcast-first\/#webpage","url":"https:\/\/socialistics.com\/socialistics-podcast-first\/","name":"Socialistics: Social Media Agency Stories - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/socialistics-podcast-first\/#primaryimage"},"datePublished":"2020-07-23T18:43:00+00:00","dateModified":"2021-01-14T17:40:24+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/socialistics-podcast-first\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/socialistics-podcast-first\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/socialistics-podcast-first\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Socialistics: Social Media Agency Stories"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5194"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5194"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5194\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7075"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5194"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5194"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5194"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}