{"id":5200,"date":"2020-09-14T09:00:00","date_gmt":"2020-09-14T09:00:00","guid":{"rendered":"https:\/\/socialistics.com\/the-power-of-saying-no-copy-2\/"},"modified":"2021-01-14T17:38:39","modified_gmt":"2021-01-14T17:38:39","slug":"upgrading-your-agency-reporting","status":"publish","type":"post","link":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/","title":{"rendered":"Upgrading Your Agency&#8217;s Social Media Reporting Game"},"content":{"rendered":"\r\n<p>This week I sat down with Scott Guttenberger, VP of Marketing at <a href=\"https:\/\/agencyanalytics.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">Agency Analytics<\/a>, a reporting platform for agencies. We discuss what makes Agency Analytics different, great for agencies, and how integrating an efficient, well-designed reporting strategy can change the game for your clients and your agency’s reputation.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5304412\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5304412-upgrading-your-agency-s-social-media-reporting-game.js?container_id=buzzsprout-player-5304412&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [00:01]<\/strong>    This week I sat down with Scott Guttenberger, VP of Marketing at Agency Analytics, a reporting platform for agencies. We discuss what makes Agency Analytics different, great for agencies, and how integrating an efficient, well-designed reporting strategy can change the game for your clients and your agency’s reputation.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [00:34]     <\/strong>Hello, and welcome to another episode of the Socialistics podcast &#8211; Social Media Agency Stories. Real excited about our guest today. It&#8217;s been great really talking to all of the different folks of the different technology platforms that we have partnered with over the past few years and today&#8217;s guest and their platform has been a critical component to our success. So Agency Analytics is an all-in-one reporting platform designed for agencies. And I&#8217;ve talked about this in previous episodes about how we&#8217;ve tried to use all-in-one solutions and at the time it just wasn&#8217;t working for us and in order for us to differentiate, we really found the path to success was picking technology partners that focused on a singular thing. So I know we&#8217;ve talked with Planable and outfits like that that are focused on content management.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [01:33]     <\/strong>Agency Analytics is all about reporting and analytics, and that&#8217;s a big, critical component of what we do, helping our clients quickly and easily understand the work that we&#8217;re doing for them and how the results are shaping out. And Agency Analytics has been great being able to build custom dashboards and just the user experience for the client is outstanding, and at the end of the day, that&#8217;s the most important thing to us. I mean, I want to be efficient. I want our agency to be efficient, but if I have to pick and choose, the client needs to have a seamless, flawless experience, even if it means internally, we&#8217;ve got some things to figure out. And that&#8217;s the thing that I&#8217;m most impressed with, with Agency Analytics. So I&#8217;m excited to talk to Scott Guttenberger, our VP of marketing at agency analytics, Scott, welcome to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [02:26]<\/strong>     Hey Jason, thanks for having me on.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [02:28]<\/strong>    Absolutely. So let&#8217;s just dive right in. Tell me a little bit about your journey, a little bit about you and how you kind of found yourself at Agency Analytics.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [02:39]<\/strong>     Sure. So I&#8217;ve been in SaaS for six or seven years now. I started actually in franchise business and small agencies. So I got to experience all of the growing pains, the reporting pains, the data pains that I&#8217;m sure you and your listeners are very accustomed to by now. And at a certain point, I was responsible for 30 clients, not only doing their social media, reporting their social media, doing their pay per click, reporting their pay per click, but also doing their video for them. It was very, very time consuming, just the data side of that alone. So at a certain point, I wanted out. So I moved into these data spheres. I started with other companies, NinjaCat, same thing. Looking at focusing on making the individual marketer&#8217;s lives easier at these digital agencies. And that path eventually took me to Silicon Valley, where again, I was with a big data company like TechPush and I learned, grew there, and then moved over to Agency Analytics, which in my mind really had this pinpoint perfect laser focus on agencies and solving those problems that you, yourself and me experienced. So that&#8217;s a little bit about my travels, how I got here and what I&#8217;m focusing on.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [04:02]<\/strong>    Awesome. That&#8217;s great. So tell me a little about the Agency Analytics story, like how did they come to be, a little bit of the history and kind of where they&#8217;re at today.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [04:14]<\/strong>     Yeah, so Agency Analytics was actually, they started as an SEO tool called My SEO Tool. It was started by two guys, Blake and Joe. They were the developers. Both of them actually left their jobs and decided that they got one year to come up with something awesome before they ran out of money and we&#8217;re just stuck, right? Well, they started development. It began in 2009, and then they launched a first version of the product, July 14th, 2010. They made about $500 that month and they actually wouldn&#8217;t take a paycheck then themselves until 2011. So I really liked that story. I think that story resonates. It resonates with me as just a person and I think other people can kind of resonate with that. It&#8217;s an interesting story about how they started but now they are more agency focused. They grew out of just focusing on SEO and saw the need for a reporting focused platform, which really started to make them very special, very unique because now they were this reporting platform with all these SEO features. And then they&#8217;ve kind of graduated from that to data-focused around what agencies need, what their problems are, what they want to do, and how they want to share data with their clients.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [05:40]<\/strong>    Awesome. One of my favorite words that I&#8217;ve used in the podcast oftentimes &#8211; I&#8217;m probably going to have to come up with a new one here pretty soon because people are going to get sick of hearing it, but it&#8217;s the art of disruption. I love companies that disrupt, and I&#8217;ve used the example of Uber and businesses like that, that just kind of came in and turned things upside down in the spaces that they&#8217;re in. So when you think about Agency Analytics as it stands today, how do you guys disrupt? What have you done that&#8217;s really been unique and different that has allowed you to kind of grow over the past few years?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [06:15]<\/strong>     So there&#8217;s a couple of things that I think actually allowed them to stay so strong for 10 years, and also things that we&#8217;re starting to look at that will continue that. First and foremost, data in general seems to be confusing. There&#8217;s this barrier to entry, right? Everyone needs it and they know they need it but even marketers are sometimes “How do I use this? How do I get this? What does this even mean?” And the companies can define all these KPIs and data points all they want, but people still need to have these agencies for an easier data experience. And that doesn&#8217;t mean dumbing it down or washing all this stuff, the customization that you need it out. It just means there&#8217;s got to be an easier way to approach this. And that&#8217;s one of the main things that I think started to differentiate Agency Analytics. If you go to some of our competitors, which are great platforms, they&#8217;re hard to set up. Data shouldn&#8217;t take one to two hours. You shouldn&#8217;t need to hire an external team &#8211; the whole Salesforce thing &#8211; to use your data appropriately. So I think one of the ways we&#8217;ve disrupted the market actually is by making data easier to use and understand and work with.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [07:36]<\/strong>    Yeah. I love that. And I actually want to tell a little story because it&#8217;s so applicable here that I think it will drive it for the audience. The Air Force came to us, which was incredible. It was a groundbreaking opportunity for us. And their biggest pain point, I couldn&#8217;t believe it. They actually sent me the report from the previous agency that they were working with. They sent me this PDF and it was like 30 to 40. It was ugly. It was just cumbersome. I could barely understand it. And they were so frustrated about not knowing the results and having to spend time looking through this thing, and I couldn&#8217;t believe it. I think that for me, that was a huge light bulb moment. We ended up winning that client. I think a lot of it had to do with just the fact that we’re making it easier for the client to work with us, especially around reporting and analytics.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [08:33]     <\/strong>So that&#8217;s the thing that really has been impressive to me about what you guys do is that &#8211; and you kind of said it perfectly &#8211; you&#8217;re not dumbing it down necessarily. You&#8217;re just making it easier to digest. And I think a lot of the all-in-ones don&#8217;t devote enough time and energy into how the data is presented. They focus too much on just trying to squeeze all of these things in and it just doesn&#8217;t look good. It&#8217;s not organized in a logical way and it&#8217;s not a great user experience. I think that&#8217;s the biggest disconnect. They don&#8217;t deliver a great user experience for clients. And I think to me, that&#8217;s one of your biggest disruptors that you kind of touched on is you deliver a user experience that&#8217;s digestible. They can look at that and they can understand it. It&#8217;s visually appealing. It&#8217;s enjoyable. That&#8217;s why I&#8217;ve always said, in the Mac\/PC debate over the years, me personally, I like Macs because I enjoy using them. To me, PCs are very utilitarian. They serve a purpose, you use it for something. Whereas the Mac experience is enjoyable. I like being on it. So it&#8217;s the same thing with you guys. It&#8217;s I enjoy using your platform because it&#8217;s easy to use and it looks great and the clients love it. So to me, that&#8217;s been such a huge benefit to our agency, and anybody that&#8217;s listening that runs an agency, or is thinking about it, you really should take a look at it because it does, it allows you to differentiate.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:<\/strong>   <strong>[10:01]     <\/strong>It&#8217;s been really beneficial for us. It&#8217;s allowed us to really tap into the vein and allowed us to grow our product in just the right ways as well. And we&#8217;re very protective of that method as well and really it goes to Blake and Joe from the beginning. This is the type of methodology that they put in from the start, how they approached data, how they approached building the experience around the data. And as we grow bigger, the challenge becomes still delivering that. But that is our main focus. It&#8217;s almost like a mantra of our company.  And I think that alone will guide us in the right direction as we as a company continue to grow.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [10:48]<\/strong>    Yeah. So in addition to what we just talked through, in your opinion, how can marketing agencies, stand to benefit from using your platform versus say all-in-one platforms or other platforms that you compete with?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [11:04]<\/strong>     Sure. So one of the biggest benefits is we&#8217;re bringing all of your marketing and your e-commerce data into one location. So you&#8217;re not jumping between these other platforms.  You&#8217;re not at exporting all these different reports that come out very differently from all of them and trying to match them together in something that you consider presentable. When you come into Agency Analytics, we want to make your life a lot easier.  When you start bringing your data into our platform, stuff&#8217;s happening in the background, your dashboards are populating. So it&#8217;s those experiences that we&#8217;ve really focused on, making your data life easier, that I think push kind of pushed us to the forefront there.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [11:49]<\/strong>    Awesome.  You&#8217;ve got agency experience, so I am interested in your take on this. Like how can an agency differentiate itself from others when it comes to analytics and reporting?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [12:03]     <\/strong>So I would say it&#8217;s all about how you tell the story of the data. How can an agency differentiate themselves? If you&#8217;re bringing in the data and you&#8217;re setting it out, how are you telling that story? How are you delivering that story to the client? Anyone can send a dashboard or a PowerPoint or an email and “Hey, here&#8217;s what happened this month”, with nothing really behind it. I think the way that you as a brand and even how you service the customer, all comes down to the stories you&#8217;re telling around that data and how you&#8217;re engaging your clients, your customers inside of those stories. As humans, we love to tell stories so it should be no different when it comes to the insight that we&#8217;re pulling out of our business data. Just tell the story of it &#8211; of campaign&#8217;s lifecycle, the wins, the highs, the lows, tell that actual story to them. It also helps with transparency. When you are telling highs and lows and when you&#8217;re composing this story around these marketing campaigns, it&#8217;s a lot easier for them to trust in you because of that transparency.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [13:20]<\/strong>    Yeah, no, I love that. We&#8217;re in the business of telling stories and certainly, that translates to how we treat our clients and how you communicate the work that you do for them. It&#8217;s not only just about the results themselves, but helping them navigate that. They don&#8217;t have the time typically and the desire to go too deep on any of this. They just want to know what&#8217;s worked, what hasn&#8217;t, what are you going to do moving forward to improve the areas that we have opportunities around? So I love that. I love that as an agency and I think that&#8217;s great advice for anyone that&#8217;s just starting out or looking to start one. Seeing that you&#8217;ve got agency background, what are your thoughts and opinions on the current landscape of agencies and how they&#8217;re evolving and how they&#8217;re going to continue to need to evolve, whether that relates to our current environment, or just from a technology perspective? What are some things, in your opinion, that you see trending or changing when it comes to agency life?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [14:25]<\/strong>     So small and medium agencies in my experience have been fairly agile. They have to be more agile in order to keep up. So I think that the times that we&#8217;re currently in right now, it&#8217;s kind of pushed everyone to the digital forefront. A lot of us were already there. Some of us are already working remotely. Some of us are already working with massive amounts of data, but now everyone seems to be at that line. And the ones that saw the writing on the wall and made the shift towards data focuses or even specifically like, e-commerce data partnerships, I think they understand the world that&#8217;s going to come out of this. It&#8217;s going to be even more data-driven. As we&#8217;re seeing with Facebook and Apple, privacy is going to also take a new, very larger spotlight in the conversation. So agencies that have been nimble enough to understand that this is where the world was going, regardless of a viral outbreak or anything else, this is where the world was going, are already both in mind and in practice set up to transition to that new world. I know big, larger agencies have the money and the power to make those shifts, but I wonder if some of them will stagnate or stay stale in certain channels or areas just because of pressure from large paying clients. Whereas I think the smaller client is like, “No, we need to shift. I&#8217;m a small business Mom and Pop, we need to shift.” And they&#8217;re the ones pushing the smaller agencies to make those changes as soon as possible. I think small and medium probably saw the writing on the wall.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [16:15]<\/strong>    Yeah. Are you guys a virtual company?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [16:19]<\/strong>     Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [16:20]<\/strong>    Were you pre-pandemic as well?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [16:24]<\/strong>     They did have an office in Toronto but they have people all over the world. I&#8217;m located in Hawaii, but we&#8217;ve got APAC as well. We&#8217;ve got an individual in Saigon. We&#8217;ve got people on the Pacific side as well in Canada. So we&#8217;re worldwide, it&#8217;s almost you have to be virtual at that point.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [16:48]<\/strong>    Yeah. It&#8217;s been so fascinating. I mean, we were too. When we first started, I thought, “Oh, eventually we&#8217;ll get the big fancy office so we can compete with the big boys”, but then we just were creating momentum and it was working and it allowed me more flexibility as an agency owner to price more competitively and find better talent. We were just like, “You know what? Let&#8217;s just keep this path going.” The pandemic hit, that just reinforced everything. So as horrible as the situation that we&#8217;re in and hopefully, we&#8217;re approaching some sort of normalcy here in the near future, the one thing that is fascinating is what is the world going to look like from a business standpoint? Especially around agencies, I think more and more agencies are going to push to being virtual. I mean, clearly, the work allows for it and I think the majority of agencies outside of the multi-multi-million dollar giant ones, I think they&#8217;re all going to go virtual. So we&#8217;ve been using that as kind of a differentiator. How much longer we&#8217;ll be able to do that? I&#8217;m not so sure, but the thing that&#8217;s been fascinating is all these interviews I&#8217;ve been having with folks like yourself, they&#8217;ve all been virtual,  even pre-pandemic, which I just think makes sense. I think that we&#8217;re finding that companies that were kind of in that place, they&#8217;re more efficient, they&#8217;re able to be more nimble, they just get things done. You don&#8217;t let the dumb things like sitting in traffic or sitting behind a desk for&#8211; Just things that don&#8217;t matter. It&#8217;s about the work and so it&#8217;s no surprise to me that actually all of our partners were virtual companies even before things started going south with the virus.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [18:34]<\/strong>     For workaholics like me. Companies probably love people like me working at home because 24 hours&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [18:41]<\/strong>    Well, it takes a certain dynamic, right? You got to be wired for this, not everybody is. There&#8217;s plenty of people that need that structure of, “I go to work. I sit down. I do my thing. I punch out. I go home.” There&#8217;s nothing wrong with that. Some people just, they&#8217;re wired like that. And then people like you and I, it&#8217;s like, no, I mean, my personal and business life are gray areas. I love my work and it doesn&#8217;t matter what time I&#8217;m working and where I&#8217;m at. It&#8217;s just all one big thing. So you got to be wired for that, that doesn&#8217;t work for everybody.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [19:11]<\/strong>     Definitely. I also think that being virtual has allowed a lot of other great opportunities that have lifted the quality of my work. I actually have been taking vacations too, whereas before when I was going into office, I actually never would take a vacation. So now I&#8217;m traveling to, or I was at least, to Cartagena off Barranquilla and experiencing different cultures and then bringing those experiences into the workplace. Not only as I interact with more people from all over the world, but then that&#8217;s also brought into the work that we do. We understand more problems. We have a bigger understanding of the world. As you experience it, you yourself change, and then how you approach problems changes as well. How you talk to people changes as well. So I think there are all these hidden benefits of being virtual that aren&#8217;t really spoken of yet, but they do also help out, not only personal but business life.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [20:08]<\/strong>    Sure. Okay. Well, I&#8217;m gonna throw a tragedy at you and see how you deal with this. So let&#8217;s just say Agency Analytics sold to some major thing, and everybody&#8217;s out on the street. Now you need to go back to your agency life and you have to start a new agency and do your own thing. So if you had to do that or for somebody else that&#8217;s in that position, what are some of the tips and strategies that you&#8217;d recommend for someone that wanted to start an agency today? What are the top two or three things that come to mind, whether you would have to do it, or whether you were advising somebody that was looking to do that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [20:47]<\/strong>     Well, first and foremost, if Agency Analytics sold, I would hopefully&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [20:52]<\/strong>    Benefit from that of course.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [20:54]<\/strong>     I would also hopefully advise the CEO and say, “No, no, no, we&#8217;re going to be one of those big players in the future. Don&#8217;t sell, don’t sell.” So if someone&#8217;s looking to start their own digital agency, you know, I actually had a digital agency myself. So I went all virtual from the start. There was never any decision about an office.  I&#8217;d say bring in people that you&#8217;ve worked with in the past as well but everything can be done digitally at home. As for the type of marketing campaigns or data you might be dealing with, I would really look towards e-commerce. Everyone&#8217;s going to be making that shift towards trying to sell something online. And that space is only going to become more diverse as you&#8217;re looking at like selling clothes, selling food, selling baby toys, selling whatever. Each individual brand is either going to partner with some sort of delivery service, like some of them do, or they&#8217;ll create their own wing.  But whatever it is, e-commerce is really going to lead the way. So be a digital agency that&#8217;s focused on solving the needs of businesses using e-commerce solutions and the data around e-commerce. I&#8217;d say that would be a really big focus for moving from moving any visual agency forward in the future.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [22:21]<\/strong>    Yeah, No, for sure. I think buying behavior and how people just people are more remote now, right? Even when we get out of this thing, I think we were already trending this way. I think more and more people are going to be buying things online. They&#8217;re going to be spending more time online. If you&#8217;re a company and you haven&#8217;t taken that seriously yet, that&#8217;s a huge opportunity for existing agencies and even new ones that come up is to be prepared for an influx of interest around businesses needing good partners in these sorts of things.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [22:59]<\/strong>     For me personally, I don&#8217;t know if I would go back to the agency life. It was hectic, and I&#8217;ve gotten out of that and I&#8217;ve seen the peace of data. So if that happened to me, I&#8217;m making a beeline to politics somehow.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [23:15]<\/strong>    Not me. God bless you for that one if that&#8217;s what you want to do.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [23:19]<\/strong>     Hopefully one day.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [23:21]<\/strong>    I mean, that&#8217;s interesting because I think there&#8217;s a lot of people that want to, or start agencies just because the barrier to entry is lower. You&#8217;re not dealing with products. In any industry, there are people that are really great at it, and then there are people that aren&#8217;t. But I think that because there&#8217;s so much interest in it, because again, you don&#8217;t have inventory, it&#8217;s even to like bring in people as contractors. So the barrier to entry is lower. So there&#8217;s a lot of up and comers around that. My hope is that this podcast helps them navigate that more effectively, as crazy as it may seem. Well, you want to create more competition? I&#8217;m like, “Yeah, there&#8217;s enough work to go around.”<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [24:03]<\/strong>     I also say, I think right now is a really good time to focus on people. People really make the business and how you treat the people, how you find your superheroes to bring them in, a camaraderie between individuals, I think that&#8217;s going to be more and more important as we start to go to more virtual settings because the human interaction is still very important to get business done, to understand one another. I just don&#8217;t want to see that go away completely as well. So companies that are focusing on their people, I think are also uniquely positioned for the future.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [24:46]<\/strong>    Yeah. No doubt. So these days what are you most excited and passionate about? I love the idea of being excited about things. I think that it keeps people happy and alive. So what are you most excited about these days?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [25:03]<\/strong>     Well, it&#8217;s kind of nerdy, but I really liked data policy. It even sounds nerdy when I say it to myself. I&#8217;m really hoping that we can start getting more sensible policy around data, data sharing, ad serving, like I mentioned earlier, this whole Facebook and Apple fiasco. That area really, really interests me and it seems like for so long, the public &#8211; citizens &#8211; have been just used with nothing given back to them. And I&#8217;d really like to see some sensible policy coming where maybe they looked at us as a resource worth paying for that data. I know that skews their monetization but in all honesty, it might also increase their platform signups. It would help instill trust from the public to them. And no one really wants data to get out of control so I&#8217;m looking forward to sensible policy in the future.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:08]<\/strong>    Got it. All right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [26:09]<\/strong>     Other than that, I&#8217;m just kind of walking around Hawaii on the beaches.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:13]<\/strong>    Hey, it could be worse. It could be worse.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [26:16]<\/strong>     Yeah. Trying to keep the simple life.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:18]<\/strong>    Yeah, well, let&#8217;s keep this nerdy theme going. So what is your favorite &#8211; you can pick one or if you have multiple &#8211; what&#8217;s your favorite app, website, gadget or book that comes to mind right now?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [26:29]<\/strong>     So my favorite app right now, where is my mouse? I actually download this. It&#8217;s new to me. It&#8217;s called Shift.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:39]<\/strong>    Oh yeah. I’ve used it. I use it every day.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [26:41]<\/strong>     Do you really?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [26:42]<\/strong>    I do.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [26:43]<\/strong>     So it popped up on my Instagram because it&#8217;s one of the only social sites that I spend time on. And I bought the $99 tier and I&#8217;m loving it already, having everything into one compact view, especially the communication. So I&#8217;m really loving that right now, all over it in fact.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [27:06]<\/strong>    That&#8217;s a great tip actually. And I&#8217;ll jump just because I have so much experience with it. This is a great tool if you&#8217;re an aspiring or agency owner. So Shift, basically it gives you one app application window where you can quickly go in and out of different apps. I think it&#8217;s tryshift.com so go check it out. I should probably track them down and do an interview with them just because I&#8217;ve used it religiously. Where it&#8217;s really great is if you&#8217;re an agency and say you have multiple email addresses, a lot of people do, right, you have your personal, your work. We&#8217;ve even taken a step further. Sometimes we have like three or four different domains that we&#8217;re working on and if we need&#8211; But what&#8217;s great is if you&#8217;re using like G suite or Microsoft apps, it can be a pain in the butt to have to log in and out. You have to have different browser windows, incognito. It&#8217;s great in here, you set them all up once and you can get to click between four different mail accounts and go in and out really easily in addition to like hundreds, if not thousands of other apps. So I love that you brought that up because I agree with you. It&#8217;s amazing.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [28:08]<\/strong>     I mean, I used to have like three or four different platforms open on a window and I changed the window size of all of them so that I could see like when a badge icon would bounce or when someone&#8217;s about to type something. But this, I got a top bar, side bar, I&#8217;ve got everything I need. WhatsApp in here, Slack, Trello, Gmail. It&#8217;s pretty cool.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [28:30]<\/strong>    Excellent. No, that&#8217;s a good one. I&#8217;m glad you brought that one up. Awesome.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [28:34]<\/strong>     What about you? new app are you checking out right now?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [28:37]<\/strong>    What app?  I mean, the reason I asked this question this way is I do app, website, gadget, book because if you just say one, then it might not apply. My favorite, I mean, the one that stands out to me, especially over the past six months are AirPods Pro.  I just love using those things. They&#8217;re so good at&#8211; I mean, I use them for music, but I&#8217;ve just found them to be an incredible device to go in and out of calls, they&#8217;re comfortable, the call quality is really great, using them for working out. They’re just so versatile. Like they&#8217;re probably not the best for music, but they&#8217;re good enough. So the fact that they&#8217;re so versatile and small, I use them probably more than anything when it comes especially to business. I am all about Apple. They don&#8217;t do everything right so I&#8217;m not blind to their failures, but I think they nailed that one. I use them all the time. I mean, it&#8217;s just been a great gadget. That&#8217;s the one that comes top of mind for me.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [29:51]<\/strong>     So what do you think about Apple and going back into search because that news is all over the place right now?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [29:57]<\/strong>    I don&#8217;t know. I always felt like at some point somebody is going to disrupt and carve out a significant portion of that away from Google and it just hasn&#8217;t happened yet. I think it&#8217;s an inevitable. I think at some point somebody&#8217;s going to do something that&#8217;s going to start to shift that in some way. I always felt like it&#8217;s going to be a data privacy thing. I think someone that comes along and creates something that makes people feel safer in terms of their personally identifiable information. But at the same time, I don&#8217;t know, I think more and more people are becoming less concerned about that in terms of we live in a new world and technology and you just have to kind of embrace and accept the fact that your stuff is out there and it&#8217;s getting harder for it not to be out there. I actually I&#8217;m on the other side of it a little bit. I like getting advertising that&#8217;s for me. I don&#8217;t have a problem with my search activity and buying behavior being used to market things to me because I&#8217;ve come across it and I&#8217;m like, “This is really cool. I&#8217;m going to buy that.” I&#8217;d rather see that than just general stuff. So I don&#8217;t personally have a problem. Now if our phones are listening to us and things like that, maybe that&#8217;s a little excessive, but generally speaking, I&#8217;m okay with it.<\/p>\r\n\r\n\r\n\r\n<p><strong>             [31:25]     <\/strong>But, yeah, I think if anybody&#8217;s got the money to do it, it&#8217;s them. It&#8217;s just somebody&#8217;s going to have to disrupt or do something differently. I think it&#8217;ll happen eventually, but whoever does it better come out with something incredibly innovative or have a tremendous amount of money to stick through it. Because I mean, I worked at Microsoft. I was there, we were trying to compete with Google and they never got more than anywhere between eight to 12% share, that never changed. So I mean, that was 15 years ago and they&#8217;re still out there. I think they&#8217;re only hovering around 8, 9, 10% share of search. So I don&#8217;t know, that&#8217;s a tough one.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [32:10]<\/strong>     Yeah, I was asked if that would affect my business being in SaaS and data. And my answer, I think was kind of surprising. No, it doesn&#8217;t because no matter what those two do, if they fight, if they play nice, no matter what the world does, the end result is always data. And there&#8217;s always going to be a need to visualize, share that data, look at insight, make decisions on that data. So the changes won&#8217;t affect my industry. How would affect your industry though?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [32:43]<\/strong>    So we&#8217;re really more social driven. We don&#8217;t do a ton of work around search. I mean, social certainly impacts search signals so I think in that respect it would. I would think if somebody like an Apple came along and wanted to compete in search and they made social a higher or a more significant component to search results, I think that would make a huge impact in what we&#8217;re doing. Inevitably, I think social signals have grown in importance in terms of how they impact search results, so we&#8217;re always paying attention to that. So I think in that regard, if somebody came along and increased the importance of social signals in search results, that would be a huge&#8211; Oh, that would be great for us. So that would be an interesting way that it might impact us. So, yeah. Awesome. Before we wrap things up, just a couple more things. Tell me a little bit about the future for Agency Analytics. Anything new, exciting, you know, what&#8217;s on the horizon for the company and the product?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [40:00]<\/strong>     Sure. Yes. I mean, you don’t bring someone like me in and not talk about the future here. I see a very bright future for this company. Like I said, they&#8217;ve been around for 10 years and I really want to turn up the notch. The problems that agencies small, medium and enterprise have had have changed. They&#8217;ve grown, they&#8217;ve moved to different platforms. They&#8217;ve just grown in number, size and complexity. So we are going to meet those growing needs, those growing challenges. We&#8217;ll be introducing a lot of really awesome new analytical features. We&#8217;re also working on new integrations with buzz brands like TikTok. So we’re really ramping up integrations, capabilities and features, analytics, what you can do with data, how you share it.  So if anyone is on the fence, really right now is a great time to check us out because there is a lot of great stuff cooking in the oven.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [34:58]<\/strong>    Awesome. I love it.  Is there anything that I didn&#8217;t ask you that you&#8217;d like to share with the audience?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [35:07]<\/strong>     I always like to talk about what books we might be reading. So right now I&#8217;m actually re-reading this book, but it&#8217;s great. It&#8217;s a great book for anyone who&#8217;s jumping into like, sales leadership roles, marketing roles, or if you are in the middle. It&#8217;s <em>The Sales Acceleration Formula<\/em>. So this is by Mark Roberge from HubSpot and it&#8217;s a really useful book to kind of help you lean on data and technology to really deliver the best possible sales experience. So anyone in sales, it&#8217;s a great read. It&#8217;s also a good second read too.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [35:49]<\/strong>    Awesome. Well, we use HubSpot and I have for years, so I would lean towards trusting folks from that company because we just had a lot of success with them and obviously they&#8217;ve had a lot of access to data and time to be in a good position to have some good insights. So awesome. Well, loved having you, good conversation. I love that you asked some questions. That was really cool. I haven&#8217;t had that yet, so I love that. So where can people find you?<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [36:21]<\/strong>     Well, you can find me on LinkedIn. You can find me at Agency Analytics. And if you want to talk about data, reach out to me. Very personable, love having conversations, love talking about everyone&#8217;s problems and solutions around data. So LinkedIn and agencyanalytics.com.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason: [36:37]<\/strong> Awesome. And if you&#8217;re listening, you Socialistics podcast listeners, you&#8217;re going to be able to save 20% on Agency Analytics. You can do that by checking out agencyanalytics.com. Make sure you mention Scott and this podcast episode, and they&#8217;ll hook you up with that. We&#8217;ll also include the information in our show notes. Scott, thank you so much for your time today. Like I said, a huge lover of all things Agency Analytics, and I really appreciate you spending some time with us and providing some insights.<\/p>\r\n\r\n\r\n\r\n<p><strong>Scott:   [37:12]<\/strong>     Anytime Jason, it was a pleasure.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:   [37:14]<\/strong>    Awesome. Well, that is it for this week&#8217;s episode. Make sure that you leave a review or rating and share with us your feedback. We love having you listening. We&#8217;ll catch you next time week with another episode of Socialistics &#8211; Social Media Agency Stories.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Scott Guttenberger, VP of Marketing at Agency Analytics, a reporting platform for agencies. We discuss what makes Agency Analytics different, great for agencies, and how integrating an efficient, well-designed reporting strategy can change the game for your clients and your agency’s reputation.   Podcast Transcription: Jason:   [00:01]    This week [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7054,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Upgrading Your Agency&#039;s Social Media Reporting Game - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Upgrading Your Agency&#039;s Social Media Reporting Game - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Scott Guttenberger, VP of Marketing at Agency Analytics, a reporting platform for agencies. We discuss what makes Agency Analytics different, great for agencies, and how integrating an efficient, well-designed reporting strategy can change the game for your clients and your agency’s reputation.   Podcast Transcription: Jason:   [00:01]    This week [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-14T09:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:38:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"31 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-scott-guttenberger\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#webpage\",\"url\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/\",\"name\":\"Upgrading Your Agency's Social Media Reporting Game - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#primaryimage\"},\"datePublished\":\"2020-09-14T09:00:00+00:00\",\"dateModified\":\"2021-01-14T17:38:39+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Upgrading Your Agency&#8217;s Social Media Reporting Game\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Upgrading Your Agency's Social Media Reporting Game - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/","og_locale":"en_US","og_type":"article","og_title":"Upgrading Your Agency's Social Media Reporting Game - Socialistics","og_description":"This week I sat down with Scott Guttenberger, VP of Marketing at Agency Analytics, a reporting platform for agencies. We discuss what makes Agency Analytics different, great for agencies, and how integrating an efficient, well-designed reporting strategy can change the game for your clients and your agency’s reputation.   Podcast Transcription: Jason:   [00:01]    This week [&hellip;]","og_url":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-09-14T09:00:00+00:00","article_modified_time":"2021-01-14T17:38:39+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/09\/image-17.jpg","size":"full","id":7054,"alt":"socialistics-podcast-scott-guttenberger","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"31 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-17.jpg","width":560,"height":315,"caption":"socialistics-podcast-scott-guttenberger"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#webpage","url":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/","name":"Upgrading Your Agency's Social Media Reporting Game - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#primaryimage"},"datePublished":"2020-09-14T09:00:00+00:00","dateModified":"2021-01-14T17:38:39+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/upgrading-your-agency-reporting\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/upgrading-your-agency-reporting\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Upgrading Your Agency&#8217;s Social Media Reporting Game"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5200"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5200"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5200\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7054"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5200"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5200"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5200"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}