{"id":5203,"date":"2020-09-28T09:00:00","date_gmt":"2020-09-28T09:00:00","guid":{"rendered":"https:\/\/socialistics.com\/upgrading-your-agency-reporting-copy\/"},"modified":"2021-01-14T17:38:21","modified_gmt":"2021-01-14T17:38:21","slug":"running-production-video-house","status":"publish","type":"post","link":"https:\/\/socialistics.com\/running-production-video-house\/","title":{"rendered":"The Art &#038; Science Of Running A Successful Video Production House"},"content":{"rendered":"\r\n<p>This week I chatted with Jonathan Harris, Co-Founder &amp; Executive Creative Director at <a href=\"https:\/\/www.wildgravity.net\/\" target=\"_blank\" rel=\"noreferrer noopener\">Wild Gravity<\/a>, a creative and production house based in Seattle. Wild Gravity does some incredible work with video for major brands and we discuss what clients and agency owners need to be thinking about when planning and hiring for bigger video projects, as well as insights into building a successful agency brand.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5304805\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5304805-the-art-science-of-running-a-successful-video-production-house.js?container_id=buzzsprout-player-5304805&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:           [00:01]<\/strong>      This week I chatted with Jonathan Harris, Co-Founder and Executive Creative Director at Wild Gravity, a creative and production house based in Seattle. Wild Gravity does some incredible work with video for major brands and we discuss what clients and agency owners need to be thinking about when planning and hiring for bigger video projects, as well as insights into building a successful agency brand.<\/p>\r\n\r\n\r\n\r\n<p><strong>                     [00:35]        <\/strong>Hello, and welcome to another episode of the Socialistics podcast &#8211; Social Media Agency Stories. Today we have another awesome guest and this time around, this is somebody that I actually know and that I have worked with in the past. And I have admired over the past few years, the work and the business that he&#8217;s built, and I was really excited to bring him on. We worked together at an agency. I think it&#8217;s been about seven, eight years ago. And we worked together there and had a really good time and inevitably went our separate ways, but have always kept in contact. And so I&#8217;m really excited to introduce everybody, Jonathan Harris, who is the Co-Founder and Executive Creative Director at Wild Gravity, which is a creative and production house based in Seattle. Welcome, Jonathan to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [01:29]<\/strong>       Thank you very much for having me. It&#8217;s great to be here.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [01:31]<\/strong>       Absolutely. Like I said, we&#8217;ve kept in contact here and there. I know you&#8217;ve been really busy. You got a new member in your family so I&#8217;m sure that takes up plenty of your time.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [01:44]<\/strong>       Yes, sir.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [01:45]<\/strong>       Yeah. I remember and miss those experiences. But aside from that, let&#8217;s just get started with telling us a little about who you are, where you&#8217;ve been, what you&#8217;re doing, and let&#8217;s go from there. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [02:00]<\/strong>       Yeah, sure. I&#8217;ll start from the early days. So full background on me, Graphic Design major in school. I got into advertising after school and stayed agency-side until about 2010. I was full time and I did the freelance thing for a few years. And then 2010, that&#8217;s right around when you and I met, and then we kicked off things a Showpony, which was a fun venture while it lasted.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [02:27]        <\/strong>Not very long but, yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [02:29]       <\/strong>Not too long, but I think if we had done it differently or had a different situation, it would have lasted a little bit longer.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [02:35]<\/strong>        Agreed.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [02:36]<\/strong>       Between you and I, I think we had it nailed. But yeah, after that, I went client-side at Microsoft. I was Global Creative Director of Windows marketing, which was a fantastic job. It was the best job. I used to say it would take a stick of dynamite to get me out of there, which pretty much is what happened. But while I was there, I was directing international photo and video shoots. I designed packaging, I was running a brand studio along with the senior creative director, and we launched Windows 10, which all in all, it&#8217;s just a really great experience. Especially just being client-side and learning how bigger corporations like that work. But while I was there was when I met my now business partner. He was running advertising for Windows when I got there. He was actually one of the people in my interview loop when I was trying to get the job. So he was running advertising, I was running marketing, and we both had similar war stories. We were both dealing with big agencies of record that we’d go to them and say, “Hey, we need to shoot this spot. It needs to be finished in two weeks and up live in three.” And they&#8217;d be like, “Great, we&#8217;ll have an <strong>[SO double it to you 03:46]<\/strong> in two weeks.” We’re like, “No, that doesn&#8217;t work.”<\/p>\r\n\r\n\r\n\r\n<p><strong>                    [03:49]        <\/strong>So it was like this big, slow-moving, giant, expensive beast to deal with. And I’m not cracking on large agencies. I&#8217;ve worked for them. They&#8217;re fantastic. They all have their place, but we were discovering situations where that just wasn&#8217;t the right solution. And so then he and I both would work with local or just small like two, three person shops or teams that were off on their own either as freelancers or just starting up their own thing. And that was great because you can get a lot of really creative work done in a short period of time because there was a lot of barriers removed. But it also required us to be really sophisticated clients, and there&#8217;s a lot of hand-holding. And we kept coming to the same conclusion of like, it doesn&#8217;t need to be this hard. We know how to do this. Why is no one doing it the way we know you can do it? And that was kind of the inception of our concept of Wild Gravity.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [04:44]<\/strong>        One quick question I want to ask because one thing we have in common, albeit two different points in our careers that we both spent some time at Microsoft. I&#8217;m just personally curious, when you think about your experience there, and I have one that certainly I think of that comes top of mind. What&#8217;s the biggest takeaway or the biggest thing that you learned, or the biggest learning just overall that you were able to capture from your experience at Microsoft that&#8217;s helped you in what you did and what you continue to do moving forward?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [05:13]<\/strong>       I think being client-side at a company like Microsoft, you get a peek inside. If you keep your eyes open, you can find out really quickly, just how these processes occur. So as an agency owner now, it&#8217;s easier for myself and as well as my partner to understand client perspectives, and why they&#8217;re making the decisions they&#8217;re making or why they have the response to the creative that we&#8217;re presenting. When you&#8217;re in a company like that, there&#8217;s just so many other groups that you&#8217;re constantly working with; marketing managers over here, creative directors over there, subject matter experts, all these different orgs that, you know, you see the complexities of it. And so you gain a really great understanding of what it takes to be a successful agency partner, and what the services that you need to provide that are more than just doing the creative. You have to know how to operate at their rhythm of business. And that&#8217;s, I think, the biggest takeaway.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [06:15]<\/strong>        Yeah, I think it&#8217;s super. I think I would venture to guess that a lot of startup agencies have come from people being at larger companies like Microsoft who have experienced that and thought to themselves, “This could be so much better, and I would do it this way from the client-side of things.” And that&#8217;s one of the things that when I started Socialistics, like, I wanted to do things differently. It’s this whole idea of disruption. What are the things that clients get frustrated about when it comes to working with an agency? What are those top three, four or five pain points? And what can we do to flip the script on those things, so we can make it damn near impossible for them to say no to us when they learn about us.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [07:02]<\/strong>       That&#8217;s exactly our mentality. We don&#8217;t approach any project the same way we approached the last. We treat everything as a totally new issue, a totally new challenge. And we&#8217;re always looking at ways to short circuit a system or a process that&#8217;s already too convoluted or complicated. It&#8217;s a fine line you have to walk when you do that. I think you probably know that as soon as you start removing some systems or processes that things can get a little too fast and loose pretty quickly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [07:36]<\/strong>        Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [07:37]<\/strong>       So you have to be really, I hate dropping industry terms, but agile while you&#8217;re short-circuiting something. You have to really keep your eyes open for areas and missteps &#8211; areas you&#8217;re not paying attention to and missteps that are bound to happen &#8211; so you can correct them without missing a deadline.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [07:57]<\/strong>        So let&#8217;s talk a little bit more about Wild Gravity. So just to also give some more context, I watched your ascent to where you guys are today. And not only from a distance but also, full disclosure, I had the opportunity to work with Wild Gravity as a vendor for a big project. We&#8217;ll say it was for a very large airline company. And that in and of itself was quite an interesting project but one of the biggest takeaways from me, being I guess, kind of a partner\/client in that particular experience that I took away from getting to experience working with you guys was I just liked everybody. And I&#8217;ve always said that people work with who they trust and who they like. I mean, there&#8217;s trust inherently there already because you and I had a relationship. But me personally, I just liked everybody that I worked with, and I was impressed, obviously, by all the things that you did professionally. But you made it easy for me to work with you guys. So I know that to me, that&#8217;s a disrupter. But tell me a little bit more about Wild Gravity. How did it start? How have you guys grown? Just kind of give me the Wild Gravity story?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [09:06]<\/strong>       Sure. Well, I appreciate the compliments first off. We were really happy with everyone on the team and they&#8217;re there for a reason. The production world is a face to face kind of situation. Even in the COVID era, we&#8217;re always Zooming, we&#8217;re always on the phone, we&#8217;re always interacting I think at a deeper level than just a typical B2B type of relationship. So a little bit about how we started, you heard about the inception of the idea but that was in 2013 that we kind of thought it. But then we were at Microsoft through 2017 but we launched Wild Gravity officially in September 2017. And that was after spending about six defining what it was and what we were going to do. And, you know, we&#8217;ve evolved as a company since then pretty significantly. It started out as more of like a marketing services on-demand where we would create a SWAT team of pros, and we would show up, we would knock it out of the park, we would leave and if you&#8217;d want us to come back, we would come back. And this was supposed to be like a really, you know, people say the Uber of marketing, but it was in that spirit. It was going to be zero overhead. We&#8217;re all going to work remote. We&#8217;re going to be able to do all these amazing things because we had all the talent, all these senior-level people that were experts in their field. And through the process of defining who we were, it was starting to get a bit more and more serious, “Okay, like, when&#8217;s everyone quitting their jobs”, all this stuff and all the people that were potential partners at the time were really hesitant to do so and understandably so.<\/p>\r\n\r\n\r\n\r\n<p><strong>                    [10:56]<\/strong>        Starting a company is not for the risk-averse, right? And so because of that, it was kind of like that scene in Forrest Gump when he&#8217;s running across America and he gains a following. And like people are following him, but then all of a sudden, it&#8217;s like no one lasts until the end. So, my partner and I were the ones that last until the end, we were the ones that were brave enough to say, “You know what? Today&#8217;s my last day at Microsoft. This is what I&#8217;m doing now full speed.” So because of that, it put a lot of pressure on us to find success. And you were, I think one of the first people I reached out to when you were at a previous business for work, and it looked like it was getting somewhere at that point, but then a big shift happened and the project kind of went out the window, but I definitely appreciated that.<\/p>\r\n\r\n\r\n\r\n<p><strong>                    [11:47]<\/strong>        Shortly after that, we landed our first substantial project in November of 2017 and we&#8217;ve been pretty much pedal to the metal ever since. But it was during that project, we were working out of an office space and the owner of that office was a friend of my partner’s. We decided to pitch the business together and this is the big project that we landed. It’s what enabled us to keep going. But during that process, this guy was like, “Hey, I don&#8217;t really want to own my company anymore. I want to sell it.” And it was a video production company. So we discussed that, we negotiated, we came to what we felt was a fair deal, and this is over the course of about three or four months. And we were working together on this project during that time and that&#8217;s when Wild Gravity bought what was at the time Work House Creative. We took over, it was a full asset purchase and so we retained all the employees. We moved into the space, we became Wild Gravity at that point. And that shifted our focus from marketing services on-demand to a more creative and production model, and that&#8217;s been slowly evolving in and of itself ever since.<\/p>\r\n\r\n\r\n\r\n<p><strong>                    [12:59]        <\/strong>But we&#8217;ve been lucky to find success early on that enabled us to pitch for even larger business, or even bigger name stuff. We’ve worked with dozens of top brands &#8211; Microsoft and Amazon, T-Mobile. We did a thing with Pearl Jam, which was really cool. And then we&#8217;ve worked with a ton of startups and smaller businesses, like Wyze, or there’s a fitness app called Trainiac that we worked with. We&#8217;re also the agency of record for the Woodland Park Zoo. So fingers crossed that they make it through this whole COVID. They&#8217;re in a spot of bother, if you will.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [13:39]<\/strong>       Sure. No, that&#8217;s awesome. So, I asked this question a couple different ways, but I want to do it with you. I&#8217;m going to simplify it. It&#8217;s kind of a two-part question. When you think back to what you&#8217;ve built, what&#8217;s the one thing that stands out more than anything that you think has contributed to your success and one thing that you definitely would have done differently or have learned from? What are the top things that come to mind in both of those scenarios?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [14:12]<\/strong>       I would say that the largest contributor to our success would be the relationships that both my partner and I had built prior to launching Wild Gravity. As you said, when we were working with you on a project, the one thing that stood out to you is you just liked everybody. Everyone got along, we made it easy to work with us. And that&#8217;s, I think, the most important thing that my partner and I have ever done throughout our history is always do the right thing because it&#8217;s never hard. You’re never wrong when you do the right thing. That&#8217;s kind of our saying.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [14:44]<\/strong>        Sure.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [14:45]<\/strong>       So if you always do the right thing, you always treat people the right way, you&#8217;re always enjoyable to be around, then eventually, those people that you worked with, they go to other companies, they start up companies of their own, and then your network becomes this widespread thing that&#8217;s not just oh a bunch of people that I worked with at Microsoft or Showpony or whatever. And so now you&#8217;ve got agency owners, you&#8217;ve got VPs of marketing at bigger companies that you have great relationships with that they wouldn&#8217;t bat an eye to saying, “Hey, let&#8217;s work together. Send me a proposal. I want to put your name in the hat for this next project”, kind of thing. And that&#8217;s been what&#8217;s opened doors for us. It&#8217;s really just, I guess, our reputation. It&#8217;s the whole idea of like, overnight success is never overnight, it&#8217;s always 10 years in the making. You don&#8217;t get to that final stage without having worked up there in one way or another. And I think the number one thing is just building those good relationships.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         <\/strong> <strong>[15:43]<\/strong>       Yeah, I love that. And I&#8217;ve always advised even in some of these episodes, like if you&#8217;re thinking about starting an agency, and that&#8217;s the path that you want to carve for yourself, you better have patience, you better be able to see, you know, it&#8217;s a marathon, not a sprint. You really have to foster relationships, you really have to invest time in building those and planting seeds knowing that a lot of the things that you do in any given day isn&#8217;t going to translate into anything immediately. But it&#8217;s the sum of all of those efforts over time that create a pipeline and opportunities six months from now, 12 months from now, 18 months from now. So it just doesn&#8217;t happen overnight. So it&#8217;s encouraging to hear you guys haven&#8217;t gone down the same path. But similarly with the second half of that, what&#8217;s the one thing you would have done differently?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [16:38]<\/strong>       That&#8217;s a tougher one. I have to think about that one a little bit. I just don&#8217;t&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [16:46]<\/strong>       You guys have been perfect. What you&#8217;re telling me is you&#8217;ve been perfect. You’ve been doing everything right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [16:51]<\/strong>       We&#8217;re far from perfect.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [16:53]<\/strong>       Well, I mean, just from, I don&#8217;t know. Maybe framing it up differently, what&#8217;s the biggest thing that you&#8217;ve learned, I guess, along the way? In terms of starting your own agency and doing this whole thing, and being a part of that, what have you learned? Or how have you evolved since doing that? What&#8217;s been a big thing on that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [17:20]<\/strong>       You learn to deal with stress a lot. That&#8217;s for sure. It sounds like a really exciting and just adventure of starting up your own business. But as soon as you have more responsibility than just your own well-being like starting a family, everything changes. When you&#8217;ve got a huge monthly overhead with a team of 10 underneath you, and you get really close to the people that you&#8217;re working with throughout the years, and then you&#8217;re faced with sometimes having to make a really tough decision. Like I&#8217;ve learned that firing people is probably one of the &#8211; I should say laying off because I’ve never had to fire anybody. But laying people off is probably the worst feeling in the world. I haven&#8217;t lost any really close loved ones but it&#8217;s about the closest thing to that feeling. So that’s been a real bummer especially because of things that we&#8217;ve had to do over the last six months.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [18:19]<\/strong>       Yeah. That&#8217;s such a great, great, great, great point. Actually, I took a note down. That&#8217;s its own episode is the stress and anxiety that comes with being an agency owner, a business owner that some people don&#8217;t realize until you&#8217;re in the thick of it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [18:35]<\/strong>       Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [18:37]<\/strong>        And I can relate so much to that. It&#8217;s like having either to lay off people or worrying about the finances of your company and how it&#8217;s going to impact the people that you’ve surrounded yourself with. It&#8217;s a lot. And it&#8217;s not all fun and games. You&#8217;re preaching to the choir on that one for sure.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [18:54]<\/strong>       Yeah. I mean, it&#8217;s nervous sweats and sleepless nights. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [18:57]<\/strong>        Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [18:58]<\/strong>       I discovered that my very manageable general anxiety can be sparked into a full on panic attack. That&#8217;s a really scary thing to go through. When we were first starting out and like in the first year, there was just a lot of unknowns, right? And a lot of firsts where you just don&#8217;t know how to respond or your body doesn&#8217;t know how to respond to this enormous amount of stress that you&#8217;ve put on yourself. And things happen mentally but also physically and it’s something that shouldn&#8217;t be taken lightly. And if you&#8217;re going into this, you should probably know, you may need a therapist in the first months or at least a couple of visits to get some things off your chest because you&#8217;re going to need it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [19:45]<\/strong>       The best advice I got around it that&#8217;s helped me through is that your highest highs are never as high as you think that they are and your lowest lows are never as low as you think they are or how they feel in the moment. And I think that that&#8217;s always helped me like when I get into a state where I&#8217;m panicking, and  oftentimes you just bring it on yourself because&#8211;<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [20:07]<\/strong>       Oh, yeah. You&#8217;re worried about things that haven&#8217;t happened yet.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [20:09]<\/strong>        Yeah. You&#8217;re just planning for, like, even when things are good, it&#8217;s like you&#8217;re waiting. For me, it&#8217;s like a protective mechanism. It&#8217;s like, “Okay, well, things are really good right now but they&#8217;re not always going to be good.” And then you start to panic and you think, “Oh, what if I lose clients? And what if I get <strong>[another test 20:25]<\/strong>?”, so you&#8217;re creating a worse situation in your mind than actually it is. I&#8217;ve always just had to remind myself, “Okay, it&#8217;s not as bad as you think that it is.” And on the flip side, when things are going well, it&#8217;s like, “Don&#8217;t rest on your laurels just because it&#8217;s good right now. You got to keep pushing, you got to keep driving.” So that&#8217;s always been helpful to me, but I think a lot of agency owners if they&#8217;re listening now, they&#8217;re probably all nodding their heads. Yep, I know exactly what you&#8217;re talking about. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [20:51]<\/strong>       Yeah. You can never stop BizDeving even when you&#8217;re cranking, even when you&#8217;re at the point where you need to hire a whole team of people just to keep up with the work you have. That all is going to get delivered eventually. And that group or that client or that company or whatever, that may be their biggest spend of the decade and they may not have anything coming at you after that. So you can&#8217;t [fail them] and that&#8217;s a source of stress too, right? It’s not having all your eggs in one basket and constantly trying to build your portfolio of clients so that you&#8217;re not completely locked in with one that the downfall of one will decide the fate of your whole business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [21:29]<\/strong>       Yeah, for sure. Let&#8217;s talk a little bit about video. So I&#8217;ve personally had quite a bit of experience around it. When I was at Microsoft, getting to participate with Microsoft Studios, being behind the camera, oftentimes in front of the camera making an ass out of myself, which, thankfully, I don&#8217;t have to do as often anymore. But I&#8217;m somebody that can relate to the complexity, the volume of work, the volume of intelligence and creativity. I mean, it&#8217;s a massive undertaking to do video really well. So I&#8217;m one of the few people that have had the luxury to be around it enough to appreciate that. But I think a lot of clients and companies that look to do this sort of thing don&#8217;t really truly understand the depth of sophistication that goes into doing it really well like you guys do. So what are the two or three things that for you come to mind? If you were advising a company that&#8217;s maybe thinking about it, what kind of expectations should they have? And what should they be thinking about in terms of the pre-planning for a project like that to better come into a situation, hiring or potentially hiring an agency like yours, to come to the table better prepared, having had thought of certain things?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [22:51]<\/strong>       Good questions. A few things come to mind. I think one of the first is have realistic timelines. It&#8217;s very often that clients come to us with a timeline that&#8217;s just completely not doable. And when you think of a timeline like, “Oh, we&#8217;re giving you 40 days, how come you can&#8217;t do something in 40 days?” And then we provide the work back schedule of like, “What you&#8217;re asking for this date means that we have to compress everything into this short period of time.” And there are review schedules, there are all these different approvals, things that need to go out. The larger the client, the more likely it is that they&#8217;ll have third party partnerships that also require some sort of approval process. Those things can jam weeks into a schedule unexpectedly and then that&#8217;s going to push your delivery date out exponentially. So have a clear understanding of when you need it and then know that it&#8217;s going to take longer than you think.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [23:55]<\/strong>       Sure.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [23:56]<\/strong>       Our saying is always, “You&#8217;ll never be waiting on us.” Because it&#8217;s just never the case. We can get you the deliverable that you need but the thing where everyone always waits on is the review cycles.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [24:09]<\/strong>       I use that all the time. I say we will move at the speed of you. We’ll never hold anything up. It&#8217;s on you. So I can appreciate that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [24:18]<\/strong>       Yeah, exactly. And then I think the clients come in various degrees of understanding of the video world. Either they&#8217;ve done a ton of agency work with video agencies, and so they&#8217;re familiar with the process or all the way to this is their first one and they have no idea. So, I think the more you know about the process, the more successful any engagement you&#8217;re going to have with an agency is going to be. So even if you&#8217;ve never done it, it would be smart to even just Google like, “How is a commercial made?” Or “What&#8217;s the video production process?” Or “Who&#8217;s involved in the creation of a video?” Because then you&#8217;ll get a better understanding of exactly how many fingerprints are going to be all over it. Everything from the director to the producer to the AD to the VFX artist to the editor to the colorist, then the sampler audio master. There are just so many talented people involved, which then leads to an understanding of why things cost what they do. I think there&#8217;s an expectation that you can pretty much shoot anything on an iPhone, and anything can be done for about five grand.          <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [25:48]<\/strong>       That&#8217;s a great point. I was thinking that I was on this follow-up question, but I want to throw it in here because you just brought it up there. You guys are a little bit different because you&#8217;re working with bigger brands that maybe you don&#8217;t deal with that as much as maybe lower-tiered video agencies might be experiencing. But, is it more challenging for you guys to do what you do living in a world where technology is advanced as much as it has, and some people might think, “Oh, you know, I can just shoot something on a phone.” Do you guys personally experience any of those sorts of challenges in your client experiences?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [26:28]<\/strong>       Yeah, all the time. And it&#8217;s expected and I understand it. I mean, it used to be that the only way you could shoot 4k is with a $100,000 camera and some beautiful lenses. And that&#8217;s not true anymore. You&#8217;ve got 8k phone cameras now. And it used to be that you could only get an aerial shot with a helicopter and now you&#8217;ve got all sorts of an array of drones that can be had for under 500 bucks that can you know, depending on what your needs are, probably get you what you need. But it depends on really what you&#8217;re trying to create. I think what you find and I&#8217;m not trying to bag on any like, Joe camera guy that&#8217;s trying to start up his own thing solo in his home office, I think there&#8217;s a total need for folks like that and I think that&#8217;s where people start off that end up working for companies like mine or bigger companies. But I think that there&#8217;s a lack of storytelling that you find with folks that are just kind of work a day. I&#8217;ve got a camera, I can edit, I can pull some music off Sound Cloud and I can give you a deliverable that looks and sounds pretty decent, you know? I think storytelling is often a missing factor in that and I think that less sophisticated clients tend to overlook storytelling and the importance of it when really it&#8217;s the heart of advertising and marketing. I mean, there&#8217;s been hundreds of research papers showing the value add of attaching a story to an object and what you can then sell that object for or how many more of those objects you can move, right?  Just getting a story attached to it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [28:13]<\/strong>       You know what, I think you pay for creativity. It&#8217;s funny. Oftentimes, we&#8217;ll come across, I used to joke, this could be for imagery and design work, too. It&#8217;s like, sometimes clients expect “Oh, you know, there&#8217;s just like, oh, we&#8217;re just going to press the button and the creative machine is going to spit out ideas for you.” Like, it&#8217;s not that simple. I always talk about how a lot of the creativity that comes from work that I&#8217;ve done, like, I&#8217;m always working. I&#8217;m in the shower, I&#8217;m working because I&#8217;m thinking about a client and some of the best ideas I&#8217;ve come up with are when I&#8217;ve been isolated. I&#8217;m not in the office, I&#8217;m driving.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [28:47]<\/strong>       Right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:           [28:47]<\/strong>      I’m still working. Just because I&#8217;m not in front of my computer&#8211; I&#8217;ve got a client paying us for our time to like&#8211; I&#8217;m working and I&#8217;m thinking about their challenges and their problems and trying to come up with creative solutions. And I think a lot of times, clients don&#8217;t think about it that way. They just think that it as like, “Oh, you&#8217;re just on your computer that&#8217;s, you know, press a couple buttons and spit out your ideas.” It&#8217;s like, it doesn’t work like that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [29:09]<\/strong>       Yeah. And like when I was back in my design days, it was like, when you&#8217;re trying to drum up new clients, like, I&#8217;ll use an industry as an example, the craft brewing industry. It was always like their main focus was the beer, which as it should be, but then their logo is terrible. And it&#8217;s like, “Oh, well, my cousin had Photoshop.” It&#8217;s like, “Well, that doesn&#8217;t make them a great designer.” And to your point Jason, you&#8217;ve been doing this for 30 plus years as a professional and so you&#8217;ve got all those years of critical creative thinking. All those years of shower thoughts and commute thoughts, and that gives you the tools to weed through the really bad ideas or the puns that everyone tends to gravitate towards.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [29:56]<\/strong>       Right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [29:57]<\/strong>       And so that way when you&#8217;re having these thoughts, now they are a refined selection of thoughts that you&#8217;re able to present to your clients and there are things that they wouldn&#8217;t have gotten to as quickly, if ever, right?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [30:11]<\/strong>        Yeah. Well, I mean, there&#8217;s a level of sophistication that comes with who you work with. And you made a good point, like just because you work with a certain type of clients, and you charge a certain amount doesn&#8217;t mean that there isn&#8217;t a market for other tiers of service. It&#8217;s a natural progression for a lot of agencies when they&#8217;re first starting out. You work with smaller clients, and they have smaller budgets, that doesn&#8217;t mean that they’re smaller stature or importance, it just means that&#8217;s where they&#8217;re at, that&#8217;s where you&#8217;re at and those markets exist. I think it really just comes down to there&#8217;s a place for everybody when it comes to agency life in terms of being able to serve clients in a way that is going to make them happy. And so I love that. So on that note, what are you excited about these days? In terms of either Wild Gravity, yourself personally, professionally, what are the up and coming things that you&#8217;re excited about in what you do?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [31:10]<\/strong>       Right now professionally, we&#8217;re experiencing a rush of work, which is really great. It&#8217;s kind of like the floodgates closed in March, and then they reopened in like mid-July. And that was really great to see and a huge relief. So what I&#8217;m really excited about is organic growth that we’re starting to experience. The term flywheel momentum comes to mind and not to say that we can never sit back and just let the machine go because that&#8217;s suicide. But, I&#8217;d like to think that this momentum will keep going into the next year and in the coming years. So that&#8217;s something that&#8217;s really exciting because we&#8217;ve really been grinding since 2017 to try and get to this point. And there&#8217;s been so many times where you feel like it&#8217;s almost there and then it isn&#8217;t. And that&#8217;s how we felt in March, right? We were like, “We&#8217;re doing everything right, everything&#8217;s coming in, and everyone&#8217;s happy with our work, and then boom, shut down.” So, I think I&#8217;m an optimist at heart. And I have a lot of optimism that we&#8217;re going to get back to a state of normal that I think everyone&#8217;s going to appreciate and enjoy. It may not be exactly what it was but I&#8217;m optimistic that we&#8217;re maybe closer to that than what was originally feared. So that&#8217;s kind of in the professional zone what I&#8217;m looking forward to.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [32:51]<\/strong>        I&#8217;m experiencing a lot of that too.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [32:53]<\/strong>        Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [32:54]<\/strong>        I love asking this question. This is my new question that I&#8217;m probably going to ask everybody because it&#8217;s a great way to get insight into what people are using and useful tools. So it&#8217;s easy. I&#8217;ve made it easy. I&#8217;ve made it like multiple choice in terms of which thing but what&#8217;s your favorite app? What&#8217;s your favorite app, website, gadget or book that comes to mind for you right now that you&#8217;ve been using a ton lately?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [33:18]<\/strong>        Favorite app website, gadget or book.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [33:20]<\/strong>        Doesn&#8217;t have to be one of each. Just one of any of those four things.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [33:26]<\/strong>       That&#8217;s a good question. So I&#8217;ve just recently, you&#8217;re going to hate me for this. I&#8217;ve just recently kind of sworn off social media.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [33:34]<\/strong>        I do not. I completely understand. I do I professionally. I don&#8217;t spend a lot of time personally.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [33:40]<\/strong>       Yeah. I deleted Facebook off my phone and that&#8217;s been like a really nice vacation. I&#8217;ve had to retrain myself to not just automatically type command “T” new tab and then type Facebook so that it pops up immediately because it&#8217;s like, one letter in it and it auto-populates, right? So that&#8217;s kind of tough. I think as leisure apps go, and I don&#8217;t even know how to pronounce it because they won&#8217;t tell you, Injure Imager, I don&#8217;t know.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [34:06]<\/strong>       Okay.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:    [34:07]<\/strong>       It&#8217;s just a meme app but it&#8217;s a great way to have a laugh, while also sort of staying informed at current events. There&#8217;s a lot of information out there and that community for whatever reason tends to feel a little nonpartisan, non-bias, just logic-based, science-based, which is really refreshing these days, as you probably agree. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [34:36]<\/strong>       Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [34:37]<\/strong>       But even then, it still starts to feel like social media almost to an extent. So I find myself shying away from that. As far as books go, I&#8217;ve been reading <em>It<\/em> by Stephen King.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [34:50]<\/strong>        Nice.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [34:51]<\/strong>       And it&#8217;s a tremendously long book, but it&#8217;s a pretty amazing book. And I don&#8217;t think it ever really received the credit it deserves as a piece of literature. It&#8217;s a horror movie and I don&#8217;t think a lot of people read the book maybe because it was dauntingly long.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [35:05]<\/strong>        Right.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [35:06]<\/strong>       But the character building and the storytelling in that is just magnificent. So yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [35:13]<\/strong>       Very cool.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [35:14]<\/strong>       Actually, it&#8217;s one I put down a couple months ago and need to just restart. It&#8217;s been hard to find time to just relax and read with a seven-month-old.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [35:26]<\/strong>        Yeah, I hear you. Awesome. So is there anything I didn&#8217;t ask you today that you want to share with the audience? Anything that comes to mind at all?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [35:36]<\/strong>       No. I mean, I think we kind of covered everything. Yeah, I guess one thing that comes to mind, my partner and I were trying to be speakers at the conference back in like 2018. And I think we&#8217;re ultimately not approved to do it. And part of which was probably because some of the things we had to say were a bit less encouraging of potential agency openers or startup people. And I think it wasn&#8217;t the vibe they wanted to put out because the audience I think that there was a lot of recently out of school or out of creative college youngsters that wanted to start up their own thing, didn&#8217;t want to work for somebody, and didn&#8217;t really want to hear what my partner and I had to say, which was basically like, if you don&#8217;t have a network, you better have an amazing product that no one has ever seen before because you have to think about how you&#8217;re going to make money. You can create beautiful things until the cows come home, but if you don&#8217;t have anybody to buy it, then you&#8217;re not going to be successful and you&#8217;re going to be out a lot of money.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:        [36:56]<\/strong>         Yeah, that&#8217;s funny. I mean, there&#8217;s plenty of people in the world that do incredible work. I always talk about differentiators, like how do you differentiate? And if I&#8217;m working with a client, and I&#8217;m trying to get them to that place like, “Well, what makes you different?” “Oh, we have better prices.” “No, that&#8217;s not differentiated. Anybody can do that.” “Oh, our customer service is great.” “No, that&#8217;s not a different like, no, what is something that you do that&#8217;s uniquely authentic and different, that nobody else is doing or very few people are doing?” And a lot of times they don&#8217;t [have an answer]. If you don&#8217;t have a good answer to that, then you&#8217;re not going to do well. And we come across that quite a bit. We have to get that because it&#8217;s like we tell them we&#8217;re great storytellers and we&#8217;ll light up your social, but if your product sucks, good marketing doesn&#8217;t fix crappy products and services.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [37:41]<\/strong>        Or if you don&#8217;t have an audience built, you know? Like, you got to have friends if you want to throw a party.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [37:47]<\/strong>        Yep. No, for sure. I mean look, I think being an entrepreneur and starting your own thing is a fantastic thing to do if you&#8217;re wired for it, but at the same time, I think that most people should really highly, highly consider pushing that off until later in your life. Build a network, work at great companies. One of the greatest things that I got from Microsoft was, I was just thrust into so many different types of people from different parts of the country, different parts of the world, different personalities, languages, all that stuff. It really creates an incredible dynamic for you to grow your emotional intelligence.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [38:29]<\/strong>       You gain a global perspective in an environment like that. And it&#8217;s impossible not to. It’s inevitable. I don&#8217;t think anyone goes into a situation like that closed-minded. But even if you did, you would be opened up to so many new experiences and perspectives. And that&#8217;s as anybody knows these days is so important.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [38:55}<\/strong>        Yeah. You have to throw yourself into challenging situations and work for companies and get experienced because, I mean, jeez, what I&#8217;m doing today, I wouldn&#8217;t have been able to do even 10 years ago, 15 years. And I actually did. 10 years, I did try to do this and I wasn&#8217;t ready. But I learned a lot from that. And every step along the way, every layoff, every you know, challenging situation, I mean, it all helped me get the emotional intelligence and maturity to be able to run a successful business. And I think if I were you guys like, being authentic, I would go into an event, like, “Don&#8217;t start a business now. Go get experience. Go build your network. Build the foundation that you need, that&#8217;s going to set you up to be able to be a successful entrepreneur. And look, it&#8217;s not black and white. I&#8217;m sure there are plenty people that can make it happen. But generally speaking, I think that that&#8217;s a more likely realistic path for people.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [39:48]<\/strong>        Yeah, absolutely. I think when we were trying to pitch the speaking engagement, the resistance that we experienced, was mainly around the getting hung up on one thing we were saying, which is you need like 10 years’ experience in your field to really get to the level where you can successfully launch. And they&#8217;re like, “Well what about people that are experts at an app or a technology or software that&#8217;s only been out for two years? How do they get to 10 years?” And I’m like, “Well, there&#8217;s always going to be an edge case. You can argue all day and night up and down, like with little edge cases like that. There are always little things like no one expected this to happen but you don&#8217;t want to base your future success off of an edge case scenario.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [40:36]<\/strong>        No, you got to do all the things you can do to increase the likelihood of your success.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [40:42]<\/strong>        Exactly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [40:43]<\/strong>        I get it. So awesome. So before we wrap this up, where can people find you and Wild Gravity?<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:  [40:52]  <\/strong>       Online you can go to our website at wildgravity.net, not .com. That&#8217;s someplace in New Zealand that does bungee jumping. You don&#8217;t want to do that. So wildgravity.net. If you&#8217;re in Seattle, we’re on the corner of 14<sup>th<\/sup> and Yesler. We’ve got a really awesome space there.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [41:09]<\/strong>       They do. I’ve seen it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [41:10]<\/strong>       It&#8217;s a closed building. So you can&#8217;t just walk in, but you can always contact us on the website and that&#8217;s the best way to get ahold of us. We&#8217;re small enough to where those emails actually come to the senior leadership team. So I get them all the time.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:         [41:24]<\/strong>        Awesome. Well, Jonathan, it was great having you on here. I know we know each other outside this, but I was excited to bring you in, talk a little bit about what you&#8217;re doing and the video stuff. I really enjoyed this and really looking forward to watching you guys continue to do your thing.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jonathan:   [41:39]<\/strong>       Thanks a lot. Thanks a lot for having me. It&#8217;s great to talk about yourself. But I appreciate the opportunity and it&#8217;s been great watching your success unfold, and I hope to see much more of it in the coming months as we get through all this.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:          [41:54]<\/strong>       Awesome. Well, thanks for coming on. And for the rest of you, thank you so much for listening. Be sure to like, rate, review, leave a comment, leave feedback, all that good stuff. But that&#8217;s it for this week. We’ll catch you next time on the Socialistics podcast.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I chatted with Jonathan Harris, Co-Founder &amp; Executive Creative Director at Wild Gravity, a creative and production house based in Seattle. Wild Gravity does some incredible work with video for major brands and we discuss what clients and agency owners need to be thinking about when planning and hiring for bigger video projects, as [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7050,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Art &amp; Science Of Running A Successful Video Production House - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/running-production-video-house\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Art &amp; Science Of Running A Successful Video Production House - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I chatted with Jonathan Harris, Co-Founder &amp; Executive Creative Director at Wild Gravity, a creative and production house based in Seattle. Wild Gravity does some incredible work with video for major brands and we discuss what clients and agency owners need to be thinking about when planning and hiring for bigger video projects, as [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/running-production-video-house\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-28T09:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:38:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"37 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/running-production-video-house\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-jonathan-harris\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/running-production-video-house\/#webpage\",\"url\":\"https:\/\/socialistics.com\/running-production-video-house\/\",\"name\":\"The Art & Science Of Running A Successful Video Production House - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/running-production-video-house\/#primaryimage\"},\"datePublished\":\"2020-09-28T09:00:00+00:00\",\"dateModified\":\"2021-01-14T17:38:21+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/running-production-video-house\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/running-production-video-house\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/running-production-video-house\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Art &#038; Science Of Running A Successful Video Production House\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Art & Science Of Running A Successful Video Production House - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/running-production-video-house\/","og_locale":"en_US","og_type":"article","og_title":"The Art & Science Of Running A Successful Video Production House - Socialistics","og_description":"This week I chatted with Jonathan Harris, Co-Founder &amp; Executive Creative Director at Wild Gravity, a creative and production house based in Seattle. Wild Gravity does some incredible work with video for major brands and we discuss what clients and agency owners need to be thinking about when planning and hiring for bigger video projects, as [&hellip;]","og_url":"https:\/\/socialistics.com\/running-production-video-house\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-09-28T09:00:00+00:00","article_modified_time":"2021-01-14T17:38:21+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/09\/image-15.jpg","size":"full","id":7050,"alt":"socialistics-podcast-jonathan-harris","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"37 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/running-production-video-house\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-15.jpg","width":560,"height":315,"caption":"socialistics-podcast-jonathan-harris"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/running-production-video-house\/#webpage","url":"https:\/\/socialistics.com\/running-production-video-house\/","name":"The Art & Science Of Running A Successful Video Production House - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/running-production-video-house\/#primaryimage"},"datePublished":"2020-09-28T09:00:00+00:00","dateModified":"2021-01-14T17:38:21+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/running-production-video-house\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/running-production-video-house\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/running-production-video-house\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Art &#038; Science Of Running A Successful Video Production House"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5203"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5203"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5203\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7050"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5203"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5203"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5203"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}