{"id":5218,"date":"2020-09-21T08:54:00","date_gmt":"2020-09-21T08:54:00","guid":{"rendered":"https:\/\/socialistics.com\/running-production-video-house-copy\/"},"modified":"2021-01-14T17:38:30","modified_gmt":"2021-01-14T17:38:30","slug":"social-media-pro-ashley-ohl","status":"publish","type":"post","link":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/","title":{"rendered":"What It&#8217;s Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl"},"content":{"rendered":"\r\n<p>This week I’m mixing things up and bringing in Ashley Ohl from the Socialistics family who’s been with me since the early days of our agency. We talk about her own path to success in the agency world, as well as what makes for a great remote digital marketer and the tips, tools and strategies to get there.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5490622\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5490622-what-it-s-like-being-a-remote-social-media-pro-at-socialistics-with-ashley-ohl.js?container_id=buzzsprout-player-5490622&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p>[Intro]<\/p>\r\n\r\n\r\n\r\n<p>This week, I&#8217;m mixing things up and bringing an Ashley Ohl from the Socialistics family who&#8217;s been with me since the early days of our agency. We talk about our own path to success in the agency world, as well as what makes her a great remote digital marketer and the tips, tools, and strategies to get there.<\/p>\r\n\r\n\r\n\r\n<p>[Music]<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Hello, and welcome to another episode of the Socialistics podcast, social media agency stories. I am Jason Yormark and thank you for listening. I&#8217;m excited about our episode today. I always intended to pull in members of my team on occasion so that I&#8217;m not the one always talking about stuff. So today I’ve got one of my favorite people in the world. Her name is Ashley Ohl and we&#8217;ve been working together for, I want to say, I think two years or on the other side of two years working on three. And we worked together at a previous company that we both did not really enjoy eventually. And we kind of had a kinship through that dislike of that experience. But the good thing that came out of it was Socialistics and she&#8217;s a huge part of what we do. And I&#8217;m excited to welcome Ashley Ohl to the show. Welcome to the show, Ashley. <\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Hi everybody. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Awesome. So why don&#8217;t we just start by you telling people who you are, what you&#8217;ve done and what you do.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Hi everybody. Ashley Ohl and I am a senior account manager at Socialistics. As Jason said, we worked at a previous company together and we learned a lot and the best thing that came out of that company was Jason and I meeting and the rebirth of Socialistics. When I decided to leave our previous company, it was a hard choice and it was a little nerve wracking, but I knew in my gut that Socialistics was where I needed to be and where I wanted to be. So I left and I think we had one or two clients at the time. And now we are on the verge of having over 20 clients and just being a part of that whole growth has been an amazing experience.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Yeah. So a little more context for those that are listening. So Ashley and I were at a different company, and then she decided, she had just had enough and wanted to leave. And I knew that I was probably on my way out as well, and Socialistics was kind of a side hustle and I knew that I wanted it to be more than that. So I immediately connected Ashley into that world to help, kind of prepare it so that I could slide into it eventually. And then ultimately my hands were forced to do that. I think it was like a month or two after you had left and decided, you know what? I&#8217;m done having my fate being determined by other people. And I&#8217;m just going to go all in on this. And then that&#8217;s when Ashley and I really tackled Socialistics. And that was September of last year. Gosh, it seems like it&#8217;s been longer, but we&#8217;ve been at it now for full time for over a year, actually. Yeah, it was September of 2019. That&#8217;s crazy. It seems like it&#8217;s been so much longer. <\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> It does. It definitely does. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> So yeah, so but tell, I want people to know a little bit more about you, like tell, you&#8217;re a single mom, daughter. I want them to know about your trajectory to where you&#8217;re at now and what that&#8217;s meant for you. Because it&#8217;s important, one of our core values is freedom. And I love, the thing that, the biggest takeaway that I get, the thing that makes me the happiest is giving people the opportunity to live life on their own terms, in your case, that&#8217;s being able to have a career and still be there for your daughter. So just kind of share a little bit more about what that means to you and how you&#8217;ve kind of gotten to where you&#8217;re at.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Yeah. So I am the mother of a budding superstar, who it will be eight in December, and I was 29 when I had Eliana and being a single mom and not in a steady career path at that point. It was a little nerve wracking bringing a child into the world. But also knowing that my career was super, super important to me. And it was an internal struggle of having to put my career on the back burner because being a mom was my top priority. And while still is my top priority, but Socialistics gives me that balance. But when my daughter was born, I knew that I would just have to take jobs that aligned with my schedule with her, with child care, maybe not necessarily in my direct career path. I worked at small businesses in Buffalo. I did help with social media as a part of my job, but it was not the main focus of my job. I was working retail. I worked at a chiropractor. I worked at a school and was just all over the place. But in my head, my goal was when Eliana entered kindergarten, but that&#8217;s when I could start taking my career more seriously again. And so after I worked at a school for a year, I joined the company that Jason and I worked at together and was there for a year. That was a work from home position as well based out of Chicago. And I did a lot of travel. I got to feel like I was actually moving and shaking again and have the chance to rebuild my confidence on where I wanted to go. The people I wanted to be around and having the opportunity to work from home and have that freedom to have a career path that I loved and not have to sacrifice my time with my child meant everything to me. So when the work environment that we, Jason and I were in before Socialistics became too toxic, I said, enough is enough. I am not happy. This is affecting my child. This is affecting my own mental health. And Jason opened the door to Socialistics, and we jumped in feet first and didn&#8217;t know where it was going to go, but whether clients came in or left or the ups and downs in my gut, I’ve always known that Socialistics is where I&#8217;m going to be for the rest of my career and to be 37 and to have that much confidence in where I&#8217;m going and how we&#8217;re growing and what we&#8217;re creating, and being able to be a mom at the same time. They&#8217;re just no words that can express how grateful I am for that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Awesome. And I love hearing that. I mean, I grew up in a single mom environment, so there&#8217;s a special place in my heart for giving people like you, that type of opportunity to be able to have a career and be there for your children, be able to active in their life, especially when we live in a world where that&#8217;s seemingly less and less happening. So I think that&#8217;s important. I love being able to contribute to that. So obviously we&#8217;re a remote virtual company and there&#8217;s a lot of great things about that. What have for you, what have been the biggest challenges working in that type of environment and what are some of the things that you&#8217;ve done to position yourself to be successful with it?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> So I would say one of the biggest challenges for me with being a remote agency is I am an extrovert by nature and not being around people. And the socialization with working with people in an office has presented some challenges, but I found ways around it. I found some favorite coffee shops. I have other friends who own small businesses and I’ll set up shop in their space of business and I’ve been able to make that work. But at the end of the day, being able to be home when my daughter gets off the bus and not have to rush in the morning to get her off to school just the peace that that creates in my life outweighs some of my need to be out in about in an office. And I think with Socialistics, we found ways with zoom calls, weekly meetings, constant messaging. I&#8217;ve never felt like there&#8217;s a disconnect between any of us and Jason, you and I got a lot of time during our travel for the previous company to really get to know each other and spend time together. But I still feel like even with one of our team members in Australia and you in Seattle and our clients all over, we all have been able to make it work. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Yeah, that&#8217;s actually a great point. For those that are listening that are either thinking about starting an agency or are in the beginning stages, you can be a remote virtual agency and be successful, but you definitely have to work in some sort of frequency of your getting your team together, whether that&#8217;s once or twice a year, it is a critical component to have that time with each other in person. Obviously the current situation, the current pandemic is prohibiting that from happening. But I&#8217;m basically waiting for that to go away and then immediately scheduling something for us to get together. Because it&#8217;s been so long which may be a trade show that we&#8217;ve got planned early next year. But it&#8217;s such a critical component. So you really need to work that in somehow. If you really want to run a successful remote agency, still have to have that face time with people. Cause it&#8217;s the, really the way to build a really strong foundation. And a perfect example like Joanna on our team who we had hired and I had met her and in the beginning, it was fine, but it wasn&#8217;t until we got together in Vegas for that trade show that from that point on, like everything took off in terms of our chemistry or professional chemistry, because we had had a couple of days together to hang out and just get to know each other and ever since then, we&#8217;re like all peas in a pod. And so it&#8217;s so important to have that time together to kind of position yourself, to have that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Yeah, it really is. And it&#8217;s crazy to think that we were literally in Vegas, like three weeks before the world shut down. And but again, that face time and that together time really jelled us as the leadership team and just things have just been onward and upward since then.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> So your role has obviously evolved over time as we&#8217;ve grown, but at the end of the day, we are in the service business and we are about taking care of clients, not only through results, but treating them well. What are some of the biggest things that come top of mind to you in terms of what has helped you be successful with client relationships? Like what are the things, what are the top two or three things that you do that you feel are absolutely critical to having successful relationships with our clients?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> I think number one of our biggest things that sets us apart from other agencies is just our desire to help and be there and connect with our clients. And we do take the time to get to know them in our onboarding process with our check-ins and in our response times are amazing. I hate to see if I get an email and I&#8217;m  more than 15 minutes past when they sent it, if I haven&#8217;t responded, I just, internally I have that drive to be there when they call, when they need me. And only in a very few, I could probably count on one hand the amount of times that there have been where a client has waited longer than a half hour before they have heard back from me. And I know from the beginning, that response time just builds that relationship and that trust. And I think that we really do take the time to get to know them on the human level. I mean, our tagline is what&#8217;s your story. And we take that time with our, it&#8217;s our intake form, our onboarding meetings to really get to understand not only the brand, but the people running it. And they feel that natural connection with us because we&#8217;re actually getting, we&#8217;re taking the time to get to know them on that level and treat every client like they&#8217;re our only client. Everybody feels like they&#8217;re getting VIP treatment. And even if we have different price ranges of clients that we&#8217;re working with our monthly retainers, everybody gets the same service. Everybody gets the same response times and everybody feels like they&#8217;re just as important as the next client.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Yeah. You said something though, that I think is interesting around inside you, like when you get an email from a client that sense of urgency of like, I need to get back to them quickly. And again, this is another one of those things I want to highlight for startup agencies or people getting into it. I don&#8217;t, I&#8217;m not convinced that that&#8217;s something you can teach people. Like I always say when it comes to hiring, you always want to focus on the things that inherently a person is, that they don&#8217;t need to be trained on. Like, you could teach somebody how to use a platform. You can teach somebody skills, but inherently someone is either wired that way or not. And I think this is one of those things, because I&#8217;m the same way. Like if I get an email almost to a fault if I get any, especially if it&#8217;s from a client, like I feel like I have to respond to them immediately, like that is just wired in me. Even if I don&#8217;t have the answer or I have to figure some things out before I address whatever it is that they&#8217;re sending me, at least I’ll send them an email saying, Hey, I&#8217;m on it. I just like, I am programmed that way to the core. And I know that you are, I know that Joanna, like I just, I think that when you&#8217;re looking for people, that&#8217;s something that you want kind of want to assess. You want to, like when you&#8217;re interviewing people to work with you at the agency, like you got to kind of unravel and see if people are wired that way, because I think it&#8217;s such a critical component to running a successful agency is that responsiveness. And, I always tell you guys that, when you talk about a client satisfaction it&#8217;s results and it&#8217;s how we treat them, right? So sometimes, the results can ebb and flow and you can survive those downturns if you treat them really well. And if they really like you a lot, like that can go a long way.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> It really can. And I think it goes along with my next point as well, being wired in a certain way. And I find this with you and Joanna as well is we all believe so passionately in Socialistics and that desire. For example, yesterday, I had a 12 hour day and was on meetings for five hours straight while also balancing my meetings are from 4:00 PM to 9:00 PM and had to get dinner made and bedtime ready. But not one moment during those calls, did I feel like I hated my job or I was stressed or annoyed. And it&#8217;s something a lot of people in my world and my age don&#8217;t understand. It&#8217;s that entrepreneurial spirit in that drive of, I am building something that I love right now. And I don&#8217;t care if it means that I&#8217;m working 12, 18 hour days. It doesn&#8217;t matter because I&#8217;m happy. I sleep well at night. I love what I do. And I will do anything to continue to ensure the success in what we&#8217;re building.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Yeah, it&#8217;s always been important to me, especially for the people that have been there since day one, that they have a sense of ownership and not only what they do and how they do it. But working towards, bigger and better things, career opportunities, being able to do work that challenges you, that you&#8217;re passionate about. It&#8217;s definitely an exciting environment to be in. And you just have to, as an agency, you have to, you got to hire great people and get out of their way, let them do what they do. People are going to make mistakes, but as long as you fail forward and learn from that you want to give people the opportunity to kind of grow and try new things. And that&#8217;s been a big part of why we&#8217;ve been able to be as great as we are. I mean, we&#8217;ve reached a point now where I don&#8217;t have to worry about the work. I just have to worry about running the agency and getting new clients. And that&#8217;s a powerful place to be. That&#8217;s really what on an agency can take off when you have, when you&#8217;re surrounded by people that you trust and you know are going to take care of things. So that&#8217;s certainly makes me happy. It makes me sleep at night, which was not always the case. So what are some other things that, like when you think about whether it&#8217;s technology that you use or process, how have you evolved in being able to do your work more efficiently or more successfully? What are some of the things that you&#8217;ve learned over the past year that stands out?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Yeah, well, I have had the experience as we&#8217;re trying to figure out what worked best for us to try different platforms. We switched our scheduling platform. I think we&#8217;re on [19:14 inaudible] number four now, but that&#8217;s okay. But we learned things and we saw things that we liked in different platforms and what helped us work more efficiently, what held us back, what was good for the client. And so this last platform we worked with Plannable was really great up into a point, but excited for our next movement to Sprout Social. I think we can deliver more efficiently to our clients with that, but just confidence was a big thing. I&#8217;ve grown a lot personally over this last year. And I think in the beginning, I over-thought a lot, I wasn&#8217;t confident in the work that I was doing. And it really, some of the things that we did pushed me out of my comfort zone and I had opportunities to gain that confidence and work with amazing clients. And that has just being sure of what I&#8217;m doing has lightened the load a little bit, because I have more room for creative freedom there. Design Pickle has been great. That&#8217;s been a great addition to how we create assets for clients and streamlining our workflow that way. And Slack also huge in our communication and keeping things organized and seeing, and I am saying and a lot.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> That&#8217;s okay. I say I&#8217;m a lot. So we all have filler words.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> We do, we do. I&#8217;m trying to be conscious of that, but not overthink it. But we&#8217;re learning and growing, my position with the agency is different than it was a month ago. And I think it&#8217;s just being flexible and like, okay, wake up this morning. What&#8217;s the next adventure? And we have three more clients and now I have two team members under me and it&#8217;s just, it&#8217;s been super exciting and we&#8217;re creating some internal processes to help make things go a little bit smoother when we bring new people in. But I love the constant movement. I love, I always used to work multiple jobs just because I liked doing different things. And I feel like with Socialistics, I get to have my hand in a couple of different areas, whether it&#8217;s business development or client relationship, content creation that it kind of touches all of the parts that fulfill me. So I get to do it in one job now.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> I dig it. So I’ve got a two part question that we&#8217;ll wrap things up with that I want to ask. We&#8217;re going to have Ashley back and talking about her specific role and social media management and all that kind of good stuff. So, plenty of opportunities in future episodes, but there&#8217;s two areas that I want to ask you about to get your perspective. The first question is if there&#8217;s somebody listening that wants to be a social media manager in a remote position at an agency, and they&#8217;re just starting out much like yourself was a couple of years ago, what are a couple pieces of advice you would give somebody that&#8217;s looking to do what you&#8217;re doing and to follow a similar path? What are some things that they can do to increase the likelihood of having those opportunities and preparing themselves for that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Sure. And so my biggest thing is remote work is not for everybody. You do have to have a certain level of discipline, self-drive, motivation. And if you have that, you&#8217;ll be extremely successful. And if you don&#8217;t, that&#8217;s okay, but remote work might not be the best choice for you. If you know in your gut that that&#8217;s what you want to do.  Stay on top of social media trends, read as much as you can, listen to podcasts like ours and other agencies out there and really have your finger on the pulse of what is happening right now. So when you do get clients and work that you need to do, you can feel confident in the work that you&#8217;re going to deliver to them.<br \/><br \/><strong>Jason Yormark:<\/strong> Alright, second part of the question, if you&#8217;re somebody that wants to start an agency, and I want this perspective from you in terms of what experienced and what you think is important. Like if you&#8217;re an aspiring agency owner, what are the top two or three things that you think that agency owner needs to be think about or ensure that they practice to set themselves up for success?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> I think number one is and you spoke on it a little bit earlier is the people that you hire. Without the right people and the right team behind you, you will not be successful. It&#8217;s been interesting. A couple of the employees who have come on recently are kind of surprised with how close we all are. How healthy our work culture is, how well we communicate with each other, how supported everyone feels. And they&#8217;re like, is this real life? Are you guys sure you&#8217;re not going to change in like a month. And I tell people when we&#8217;re bringing new people on board that we really are a team and we believe in that and supporting each other. And we all have our strengths. We all have our weaknesses, but we work together to balance that out. So nobody ever feels like they&#8217;re just being fed to the wolves without any support. And that in turn just creates such a healthy, happy work environment, not to say we don&#8217;t have our bumps in the road, but because we have that underlying trust and amazing communication, it never blows up internally. So definitely the team and who you hire is huge. And I think as an agency owner, don&#8217;t be afraid to take risks. Sometimes it&#8217;s scary to let go of some clients that might not be serving you or maybe draining you of your time. And not just not be worth it in the long run. And sometimes you just have to say, I&#8217;m going to take this leap and if it works great, if it doesn&#8217;t, I&#8217;m going to try something new, but you have to be a risk taker and you have to have confidence in what you do.<br \/><br \/><strong>Jason Yormark:<\/strong> Okay, awesome. I&#8217;m going to ask one last question. I&#8217;m going to we use this as a recruiting tool. Are you ready? So what is your number one favorite thing about working at Socialistics?<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Besides you being one of my favorite humans in the world.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Beside that. Whatever comes to top of mind.<\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Freedom and getting to live the life on my terms, the thought of being, I have a lot of, a lot of us are working remotely in all the industries because of Covid right now. And I have friends who have to clock in at eight o&#8217;clock, they&#8217;re being tracked, they&#8217;re being recorded, they clock out at four, and even though I can&#8217;t go very many places right now, just the mental freedom of knowing that I don&#8217;t have to clock in and out, people aren&#8217;t watching me. I can go make lunch without stressing. I can go pick up my daughter without stressing. I can take a couple of days off without stressing, that freedom just, it means everything. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Well, I&#8217;m glad you said that. And I’ve said this in previous episodes that, we have five core values, but the one that always stands out to me is freedom. That&#8217;s the driving force behind what I wanted to do here. After so many years of frustration, working in agencies and just seeing so much wasted resources and time and things that don&#8217;t matter. There&#8217;s just nothing more powerful than being able to live life on your own terms. And I think an aspiring agency owner, or if you&#8217;re an agency owner like that is the most powerful thing you can put in place. It&#8217;s bigger than salary. It&#8217;s bigger than monetary or financial benefits. You find the people that want to live a life of freedom, and that can be one of the most powerful things in the world in a growing a successful agency. Because it&#8217;s a benefit that you can give that doesn&#8217;t cost your agency anything. As long as you hire people that are, like you had mentioned before are wired to be successful in a remote environment, that can go such a tremendously long way in keeping people and having your retention up because having to replace people are super expensive. And we&#8217;ve been lucky to not have to worry about that. So, awesome. Well, I&#8217;m going to wrap things up. We&#8217;re going to have Ashley back to talk more in the near future for sure. But there was some good stuff here. I think it&#8217;s always good for people to hear the inner workings of what we do from somebody else. So thank you for taking sometime today from your very busy schedule and we&#8217;ll have you back soon. So thanks for coming on. <\/p>\r\n\r\n\r\n\r\n<p><strong>Ashley Ohl:<\/strong> Awesome. Thanks. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Of course, that will do it for this week&#8217;s episode of Socialistics. Remember to rate, leave a review, like, share all that good stuff that helps us get this in front of as many people to help folks that run agencies or work at agencies. So remember to find us at www.Socialistics.com. Thank you for listening. We&#8217;ll see you next week.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I’m mixing things up and bringing in Ashley Ohl from the Socialistics family who’s been with me since the early days of our agency. We talk about her own path to success in the agency world, as well as what makes for a great remote digital marketer and the tips, tools and strategies [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7052,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What It&#039;s Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What It&#039;s Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I’m mixing things up and bringing in Ashley Ohl from the Socialistics family who’s been with me since the early days of our agency. We talk about her own path to success in the agency world, as well as what makes for a great remote digital marketer and the tips, tools and strategies [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-21T08:54:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:38:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"24 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-ashley-ohl\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#webpage\",\"url\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/\",\"name\":\"What It's Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#primaryimage\"},\"datePublished\":\"2020-09-21T08:54:00+00:00\",\"dateModified\":\"2021-01-14T17:38:30+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"What It&#8217;s Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What It's Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/","og_locale":"en_US","og_type":"article","og_title":"What It's Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics","og_description":"This week I’m mixing things up and bringing in Ashley Ohl from the Socialistics family who’s been with me since the early days of our agency. We talk about her own path to success in the agency world, as well as what makes for a great remote digital marketer and the tips, tools and strategies [&hellip;]","og_url":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-09-21T08:54:00+00:00","article_modified_time":"2021-01-14T17:38:30+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/09\/image-16.jpg","size":"full","id":7052,"alt":"socialistics-podcast-ashley-ohl","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"24 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/09\/image-16.jpg","width":560,"height":315,"caption":"socialistics-podcast-ashley-ohl"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#webpage","url":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/","name":"What It's Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#primaryimage"},"datePublished":"2020-09-21T08:54:00+00:00","dateModified":"2021-01-14T17:38:30+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/social-media-pro-ashley-ohl\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"What It&#8217;s Like Being A Remote Social Media Pro At Socialistics With Ashley Ohl"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5218"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5218"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5218\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7052"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5218"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5218"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5218"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}