{"id":5239,"date":"2020-10-05T15:22:00","date_gmt":"2020-10-05T15:22:00","guid":{"rendered":"https:\/\/socialistics.com\/running-production-video-house-copy\/"},"modified":"2021-01-14T17:38:13","modified_gmt":"2021-01-14T17:38:13","slug":"talking-agency-shop","status":"publish","type":"post","link":"https:\/\/socialistics.com\/talking-agency-shop\/","title":{"rendered":"Talking Agency Shop with Steve Brown From ROI Online"},"content":{"rendered":"\r\n<p>It&#8217;s always great being able to have conversations with other agency owners, and this week I got to sit down with Steve Brown from ROI Online to discuss our shared stories on building marketing agencies, the challenges that come with it, and some great times and strategies for new or just starting out agency owners on how to best grow your agency.<\/p>\r\n\r\n\r\n\r\n<p>Be sure to check out Steve at <a href=\"https:\/\/www.roionline.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">www.roionline.com<\/a>.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-5694628\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/5694628-talking-agency-shop-with-steve-brown-from-roi-online.js?container_id=buzzsprout-player-5694628&amp;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-columns gb-layout-columns-3 gb-3-col-equal\">\r\n<div class=\"gb-layout-column-wrap gb-block-layout-column-gap-2 gb-is-responsive-column\">\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-genesis-blocks-gb-column gb-block-layout-column\">\r\n<div class=\"gb-block-layout-column-inner\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Podcast Transcription:<\/strong><\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[00:10]<\/strong>      Hi there, and welcome to another episode of the Socialistics podcast &#8211; Social Media Agency Stories. Really excited today to talk to a colleague, somebody that probably has experienced a lot of the same things that I have, and hopefully some things I haven&#8217;t so that I could pick up a few things, but let&#8217;s dive right in. Steve Brown from ROI Online, welcome to the show.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[00:34]<\/strong>      I&#8217;m so excited to be here, Jason. Is it okay if we cry as we share personal experiences? <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[00:40]<\/strong>      Of course. I don&#8217;t know that I have tear ducts. My wife says I don&#8217;t have tear ducts because that doesn&#8217;t happen often but let&#8217;s give it a shot. Let&#8217;s see what happens. Awesome. Well, who are you? Tell me a little bit about your background, your history, what you&#8217;re doing all that good stuff. <\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[00:57]<\/strong>      Yeah, so I&#8217;ve always been kind of pigeonholed in a business development position in sales, and I&#8217;ve worked for several companies and helped them grow their market share. The last company that I ended up with was a web design firm. And it happened to be the web design firm that I was working for was the web design firm that I took two companies that I&#8217;d worked for previously to them to redo their websites. And as a salesperson, I had this time to invest on my own initiative to updating the website just because I thought it&#8217;d be smart to help the company become more modern. But what I started to realize was that I was supposed to go out and knock on doors, cold call, just barge in and expect people I interrupt to help me make my quota. And that&#8217;s maybe one out of 10 you can get someone to sign up, but what I started noticing is on these websites that I updated, two out of three submissions of people asking you to come see them and talk about what you have to offer them, they would close. And I was realizing, “Wow, this is cool.” <\/p>\r\n\r\n\r\n\r\n<p><strong>                 [02:13]       <\/strong>So then I ended up at this web design firm, and I was seeing all these other business owners, and I had been in their shoes, and here they were coming and they were having this expectation. They knew inside innately they needed to upgrade their presence online, but they didn&#8217;t have the exact words. And then I would hand it off to development, and it would crash. And they would look at me, the people that had trusted me and I had built a relationship [with], they would look at me to try to help them pull out of the ditch and I wasn&#8217;t in charge. It was really frustrating. So I decided, if I&#8217;m so smart, and I think I could run this business so much better, then maybe I ought to put my money where my mouth is and step out and do it, and I did. So that&#8217;s how ROI Online got started.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:    <\/strong> <strong>[02:58]<\/strong>       How long ago was that? And tell us a little bit about what you guys do.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[03:03]<\/strong>       Yeah, so it&#8217;ll be nine years at the end of this month. Yeah. And so, what we do is, I like to say it like this, we are the Chip and Joanna Gaines of flipping your presence online. You watch Chip and Joanna Gaines of Fixer Upper show and you think about the stage in life that those people, the husband and wife are in. They&#8217;re sitting around talking to each other &#8211; this is not in the show, but you know this conversation happened is like, “Honey, I don&#8217;t think I want to, on this next house, do all the remodel and us live in a construction zone for three or four years. And then me, look at all the things I did wrong or have to fix the things I didn&#8217;t do the right time because it&#8217;s not what I do all the time. So why don&#8217;t we do this? Why don&#8217;t we hire some people that actually know what they&#8217;re doing, and come in and get it done right so we can enjoy our life in this, and the kids can have their soccer team over or we can have people over and we&#8217;re not eating in a construction zone?” <\/p>\r\n\r\n\r\n\r\n<p><strong>                [04:09]       <\/strong>And so, the folks that come to us, they&#8217;re in that stage. They&#8217;re finally at that point where they&#8217;re going, “Hey, we&#8217;re getting ready to scale and I think we need to really get our act together online. We&#8217;ve got good business and good employees and good customers and good products and services, but we need to really get our act together here.” So we&#8217;ll take them and we&#8217;ll do the same thing Chip and Joanna Gaines does. We&#8217;ll flip their house, get their website messaging set up, get a nice, national quality look and feel, set it up in some marketing automation, help them tee up a CRM, and then design one strategic campaign. So we call that a flip or what we call a quick start. And then from there, if we&#8217;re a good fit, we keep going. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[04:55]<\/strong>       Yeah. What makes a perfect client for you? What do they look like? What&#8217;s the persona of a perfect client for ROI marketing?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[05:05]<\/strong>       Yeah. So at first, I was thinking, you know, we got a couple of law firms, “Okay, I guess we&#8217;re specializing in law firms.” And then it was plastic surgeons but then I would run in the next one and they would be the worst client, or like, “We don&#8217;t want this one.” What I realized was, it&#8217;s a progressive-minded business leader that’s starting to go, “All my customers are being trained to expect a good experience online and I expect that of my brands that I go to; I need to walk the walk.” That&#8217;s who we really gel with or really have the proper expectations of that we&#8217;re actually building an asset that&#8217;s going to grow the value of their business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[05:52]<\/strong>       No, I love that.  I get asked that question and I answer similarly, albeit in a little bit different way in that, what are my red flags when I&#8217;m having that initial conversation with a prospect? And one of the big ones is, if I feel like I&#8217;m in a situation where I&#8217;m having to sell them conceptually on marketing, like they either have had really bad experiences or they just think that marketing is a waste of money. I walk away from those situations because even if I can flip them, even if I can get them to at least consider going down a path with us, I know that their expectations are going to be unrealistic, they&#8217;re going to want their world to be flipped positively in a month, and it never ever, ever ends well. So, I can definitely relate to wanting to work with folks that don&#8217;t have to be sold on that. And really, they&#8217;re more excited about the opportunity than having to be convinced about it.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[06:51]<\/strong>       Exactly. If you have to convince them, you want your competitor to take those guys. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[06:56] <\/strong>      Oh, yeah, no, for sure. So, you&#8217;ve been around for nine years. That&#8217;s about six more than we have. So I&#8217;m going to go on a limb here and say you&#8217;ve experienced quite a bit more than we have over that timeline. But tell me a little bit more about [it]. I&#8217;m kind of curious about your team. Are you virtual? Do you have an office? Obviously, right now, things might be different regardless but tell me a little bit about the makeup of your business and your team and how you deliver what you do?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[07:23]<\/strong>       Yeah, so obviously, what we looked at in the beginning is different than what we look now as far as a team in many ways. So at first, when you&#8217;re starting out, and you&#8217;re starting to figure out what you&#8217;re really good at, and you start to gel, you&#8217;re going to change and evolve and upgrade and gain from insights. But my original team was someone that was good at coding and designing websites, someone that had an inclination towards SEO, and then I started hiring students out of the university &#8211; marketing students. They would come and spend a little time, we&#8217;d maybe do an internship, and then if they were kind of a good fit, we&#8217;d just go ahead and start giving them more assignments or more responsibilities. And so, I was developing a team from scratch, because what we do, and you probably relate, people just don&#8217;t come out of school ready to go with this. I mean, we&#8217;re doing street smart marketing more than internet marketing or whatever their teaching in the university. And plus, whatever they learned, even if they learned it three months ago, it&#8217;s different now &#8211; the tools have changed or a trend has changed or some aspect of it. And so, they have to be very open-minded to figuring it out and doing research and testing things. <\/p>\r\n\r\n\r\n\r\n<p><strong>                 [08:54]<\/strong>       So a team grew over the years to where we were coming up on 17, 18 people. And so, I had a core team that was pretty much headquarters. They came in every day, they worked here, they were local. And then I had higher-level talent. And when I say higher-level talent it’s talent that is really good at managing business owners, relating with them. They&#8217;ve got some business expertise or they’ve worked for a while and so they&#8217;re not as thrown off by the very insistent nature of a business owner. These are more remote folks that were very valuable. The time that we applied their expertise, they were really good, they moved the needle, and then headquarters teams became more and more the support crew to the management of the clients. Now since we&#8217;ve had this event and had to kind of pull back, [I have] lost some great clients. I had one client just decimated in the oil and gas service industry. They were responsible for a big monthly retainer and they had 250 employees. Now they&#8217;re like a skeleton, maybe they have 25 employees. But they had to just start slashing and we were one of the &#8211; I don&#8217;t want to say victims, but we were one of the casualties of that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[10:37]<\/strong>       How has the business been since the pandemic hit? Did you go down? Did you come back up? Has it been consistent? Just kind of curious what you&#8217;re experiencing with it overall.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[10:51]<\/strong>       Well, first, we had some attrition from accounts. And then folks that were teeing up and getting ready to pull the trigger pulled back. And so, I don&#8217;t have the story of, “Oh, it’s the best time in our agency.” I don&#8217;t have that story. I have that we&#8217;ve gotten a couple of new accounts, I&#8217;m really proud of them, but people are really hesitant to pull the trigger on doing this until they know what&#8217;s&#8211; We need to feel a little bit better about the future. We need to wait three, four or five more months. And I&#8217;ve just been encountering that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[11:31]<\/strong>       Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[11:31]<\/strong>       People are interested, people are shopping, people are convinced they need to get their act together, especially online now. I mean, who would have thought that&#8211; If I would have called you Jason, like, last December and said, “I hope you had a good year, but let me just tell you, no one&#8217;s going to want to shake your hand, no one&#8217;s going to want to come in your agency, you can&#8217;t go out and meet them at a coffee shop.” You would have thought I was crazy but that&#8217;s what we&#8217;re dealing with.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[11:57] <\/strong>      No, it&#8217;s crazy times. Nobody could have ever predicted this, and it’s definitely going to change the world, no matter what happens. Even when we get back to normal, it&#8217;s going to be a new normal. We started as a virtual agency so we kind of had a little bit of a head start, so it didn&#8217;t really impact us logistically too much. We certainly had some attrition similar to you. I found though, in the past month or two, things have really picked up considerably because I feel like businesses are realizing that either A) this thing, we&#8217;re going to be dealing with this for a longer period of time than maybe we anticipated and we can&#8217;t just stop marketing ourselves. We have to figure out a way to have a stronger digital footprint. I think it&#8217;s that, and even if t&#8217;s not that, it&#8217;s even when things go back to normal, it&#8217;s going to be a different kind of normal because people have gotten so accustomed to working from home. I think a lot of companies are going to shift a lot of their workforce home. People are going to demand it, and that generally means people are going to be online even more than they already were. So I think businesses realized, “Well, if we haven&#8217;t been serious about our online strategies, we better get pretty serious about it now.” So that&#8217;s my guess.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[13:14]<\/strong>       I agree.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[13:14]<\/strong>       So it&#8217;s really started to pick up of recently. What [are] your top ways of getting new business? What are the things that you guys are doing that&#8217;s keeping leads coming in?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[13:31]<\/strong>       Well, for a while, so we were one of the original agencies certified by StoryBrand. And if you&#8217;re not familiar with StoryBrand, it&#8217;s a company out of Nashville, and Donald Miller, he&#8217;s an author, and he wrote a really good book called <em>Building a StoryBrand<\/em>. And it&#8217;s how to really nail your messaging. Really, he offers a framework, so great book. I highly recommend it. So I went out to a couple of workshops there, and we got certified as an agency. And that was like one of the best things I had done because most of my businesses, my business comes to me via referrals, but when I got involved in that, then all of a sudden you had all these people reading the book, getting convinced about it, going into the workshop, and he would do a great job convincing them that this framework is a great way to do it. But then they would go home and go, “Oh, this is harder than we thought. We need to hire someone to help us.” So we were getting great leads, but over time, he brought on like 500 other guides on to that list and so our lead flow had dropped significantly. But in a move to diversify my lead acquisition, and noticing how people that came to us from reading that book were so more aligned with our agency, it pushed me over the hump because, in the back of my mind, I kept thinking, “I need to write a book. I need to write a book. But what am I going to write a book about?” And then that was like the trigger is going, “Oh, okay. So, people that do read my book, they&#8217;ll be more aligned and buy into our philosophy and the way that we go about it.” <\/p>\r\n\r\n\r\n\r\n<p><strong>                [15:22]       <\/strong>And what I was noticing, Jason, is that people would come to us convinced about getting their messaging clear, and it was assumed that they had the fundamentals in place. But the truth is, as you get going along, people would go, “Well, I just don&#8217;t think this is working.” They&#8217;d be happy for a while, but then they would come back, go, “I just don&#8217;t think this is working.” I realized that I assumed they had a great sales process in place and that the leads that were coming in from the website and the marketing efforts were being handled and brought in-house and sold, but that wasn&#8217;t the case. And so, I really recognized that the fundamentals, even though I assumed they were in place, they got it, we were saying, “I say marketing, you say marketing, but you see a yellow sponge, and I see a squid.” We weren&#8217;t seeing the same things, even though we were saying the same things. So that was where I got the conviction why I needed to write my book and make the case &#8211; let&#8217;s make sure you have your fundamentals in place. These are evergreen business, legitimate business processes that investing in it will continue to return value to you on into the future, even as marketing changes.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[16:47]<\/strong>       Yeah. So, I&#8217;ve written a book, but fiction, nothing to do with marketing. More of a passion project, bucket list checkmark. But I thought about that. I’ve thought about, “Man, I know that that could probably be a really great business development tool”, but decided to start with the podcast first, a little lower barrier to entry. <\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[17:10]<\/strong>       Smart.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason      [17:11]<\/strong>       But yeah, that&#8217;s great to hear that that works. And speaking of things that work, I think one of the questions I think would be really beneficial to those either starting an agency or thinking about it, what are the top one, two, three things that come to mind for you if you were advising somebody that&#8217;s thinking about starting a marketing agency? If you could only give them a handful, a couple things of tips or things that they absolutely have to be considering or thinking about, what are the things that kind of jump to mind for you?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[17:46]<\/strong>       Yeah, one of my biggest lessons was defining the kind of clients that we were best for. There&#8217;s a point in your early survival, you just want to make payroll, you want to get to the next month. I call it the Survivorman Dilemma in that you watch that show Survivorman, where they dump this guy out, and he just needs to make it a week. Okay, so they drop him off with, I don&#8217;t know, a knife, and maybe a little… whatever. And he just needs to find a little shelter, find some water, and he can fast the rest of the week if he has to and not freeze to death. And then they pick him up in a helicopter, and he&#8217;s fine and he does another episode. And it just hit me that when you start off your business, you&#8217;re kind of that way. You just want to make it month by month. But imagine if they dropped him off and they said, “We&#8217;re not going to pick you up for a year.” Well, he would approach that week way different, right? He&#8217;d have to start going, “I need to find a place of really good shelter.” So what I&#8217;m saying is, you need to start approaching and setting up systems and business processes. There&#8217;s a great quote in a book by Scott Adams, it&#8217;s called <em>How to Fail at Everything and Still Win Big<\/em>. But he says, “Goals are for losers; systems are for winners.” And it&#8217;s like we can set the goal, but we have to have a system in place to get to that goal. It&#8217;s the same thing in business. So we’ll just start seeing systems, designing systems. It&#8217;s a way to start to create a culture where you can hire people, and they adopt your system and they become more impactful faster. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [19:33]<\/strong>        The culture is really important. You need to have a very defined vision of where you want to be in three years. There&#8217;s a great book by Cameron Herold and it&#8217;s called <em>Vivid Vision<\/em>. And basically, you draw a picture in words of what your agency looks like in three years. So think about the people you hire. They come on and let&#8217;s assume they all have the best intent and really want to help you run a successful agency. But if you ask them where we&#8217;re all going, even though you&#8217;ve said it a couple of times, or you’ve said in a <strong>[meeting 20:14]<\/strong>, they&#8217;re all rowing to different parts to the horizon. They&#8217;re not going to end up in the same point. Defining that vision helps align their energies and also to understand what you&#8217;re about and why you&#8217;re doing it. So it repels people that [are] not going to be a good fit and attracts people that will be a good fit.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[20:35]<\/strong>       Yeah, no, I love that. We established our core values, not right away. I think part of it was just figuring ourselves out, I think, in the beginning. You know, what we wanted to be, what I wanted to build, and it really does make such a huge difference in helping you navigate the people that you take on and making sure that they&#8217;re a good fit. I mean, I went through the gauntlet at Microsoft in terms of being trained on how to interview and hire, so I&#8217;m lucky to have had that opportunity. It&#8217;s so expensive to have to replace people. And I take a lot of pride and put in a lot of effort in making sure that who I hire has the biggest amount of upside in terms of sticking around a long time. Because I feel like an agency&#8217;s ability to be profitable and successful is so reliant on having incredible people that can&#8211; You know, I always say, “Hire great people and get the F out of the way. Let them do their thing.” If you&#8217;re constantly having to churn and burn people, that&#8217;s any business’ killer, especially agencies, and especially in a virtual environment where it gets even more difficult to foster a culture because you&#8217;re not seeing each other every day, you’re not in the same room every day. Especially right now, I think a lot of agencies, if they weren&#8217;t already thinking about going virtual, this is probably pushing them in that direction because they&#8217;re realizing, “Hey, maybe this can work. Oh, wow, we saved a lot of money.” So I predict that this whole situation is really going to&#8211; I think the combination of newer agencies already setting themselves up that way, and then traditional ones taking a hard look at, “Maybe we need to start doing that as well.” So it&#8217;ll be interesting to see how that dynamic works out with agencies trying to deal with that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[22:24]<\/strong>      Totally, I agree with that. And so, it makes it even more important to really define what you&#8217;re about and why you do what you do. And it helps your clients also understand you and align with you.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:    <\/strong> <strong>[22:38]<\/strong>       What do you love about what you do, and what do you hate? Maybe not hate, but what&#8217;s the best thing about being an agency owner and what that does for you, and what&#8217;s the biggest stress or anxiety that you feel about what you do?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[22:58]<\/strong>       The most fulfilling thing is when you see a client, the light bulb go off on them about that asset you&#8217;re helping them create that&#8217;s going to grow the value of their business over time. There&#8217;s a point where a client&#8217;s going to go, “At some point, I&#8217;m going to offload my business.” And well, the other day, I got this phone call. This is a great example. He came to town from Colorado, we&#8217;re in Texas. He came to town from Colorado, and he was going to start doing garage doors. And so, he didn&#8217;t go get a building on a busy street and land and trucks and billboards. He came over here and we got him an online presence and started helping him that way. He ran his business for four or five years out of his garage, if you will. But he calls me the other day and he says, “Steve, I&#8217;ve got these guys that are considering buying my business now. What kind of price should I put on this website? It&#8217;s worth something isn’t it?” And I said, “Well, here&#8217;s the way I would determine it. How many leads or business inquiries do you get a week from your website?” He said, “Well, one a day on average.” And I said, “So what&#8217;s the lifetime value of a new client for you over the course of four or five years &#8211; they&#8217;re going to come back to you they&#8217;re not just going to do one repair?” And so he goes, “Okay”. And then multiply that out. <\/p>\r\n\r\n\r\n\r\n<p><strong>                 [24:44]<\/strong>       So if you&#8217;ve got 350 days a year, let&#8217;s just say you get 300 leads, and you close just one-third of those times the lifetime value of your average client, that&#8217;s what you&#8217;re about to hand off to this guy. In the back of this guy&#8217;s mind is, “All right, I&#8217;m going to pay for this business but how am I going to pay for it?” And then you can show him, “Look, I&#8217;ve got this virtual machine that hands you opportunities every day”, then that can give me clarity on how I&#8217;m going to pay off whatever you&#8217;re asking for. So that just boosted the value of what we had helped him implement. That&#8217;s crazy, but that&#8217;s fulfilling to me because we do that. And we probably, Jason, we probably don&#8217;t really know how well we&#8217;ve impacted that business, not just on leads, but on attracting good employees, maybe attracting partners. Who knows where that goes? A lot of it&#8217;s unmeasured.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>    <strong>[25:52]<\/strong>        Yeah. We&#8217;re pretty big on reporting and analytics, being transparent about what we do, and trying to communicate the value of what we do. And I&#8217;ve been down that road with other businesses where it&#8217;s difficult because a lot of times, they don&#8217;t want to do anything, and they don&#8217;t put the systems in place to truly position themselves to understand where and how they get new business. So oftentimes, it&#8217;s a challenge to be able to&#8211; I mean, because a lot of businesses, people pick up the phone still. There are things that aren&#8217;t necessarily immediately trackable so that&#8217;s always been a frustrating thing. We&#8217;ve worked with home healthcare businesses, and I remember working with one client who was spending a couple thousand dollars on ads, social search, and I could see that they&#8217;re getting inquiries, they&#8217;re getting calls. I could see call tracking reports, I can see the length of these calls. And he would come back and say, “Well, we&#8217;re only getting maybe one or two clients or only five people call that found us online.” I&#8217;m like, “Well, are you sure your people asking the right questions?” And they&#8217;re like, “Oh, yeah, absolutely.” So I did a little secret shopping and sure enough, they&#8217;re not.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[27:17]<\/strong>       No, they&#8217;re not. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:    <\/strong> <strong>[27:18]<\/strong>       So, businesses have to have some skin in the game to be able to make their marketing be successful. Those are the best clients for us are the ones that do want to be somewhat of an active participant. So I can definitely relate to that.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[27:31]<\/strong>       You asked what the stressful part is. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[27:33]<\/strong>       Yeah. What&#8217;s that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:    <\/strong> <strong>[27:40]<\/strong>       For me, it&#8217;s like the stressful part is when a fire pops up, having to come in and be firemen and put out that fire. Now, with really good people, it doesn&#8217;t happen that often. And usually, where the responsibility lies in that is in the sales process, and I&#8217;m the one that does those, and I didn&#8217;t vet that person well enough. So, you think about you get an account, yeah, you got a new account, but if it&#8217;s a bad account, you brought in an extra stress, frustration, push back, diminishing of your team&#8217;s abilities. You can really damage the camaraderie and the morale with just a real crappy client. And I try, but every once in a while, I still make a bad call. And it is stressful, and it&#8217;s costly.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[28:43]<\/strong>       Yeah. So timely comment. Our last episode that I put out was called “The Power of No”, which was basically around getting comfortable and learning how to say no to new opportunities. And it&#8217;s not an easy thing to do, especially when you&#8217;re starting out and like you said, you talked about making payroll every month. It can be hard to walk away from money, period, but it&#8217;s one of the best things that we ever did is just not only being selective but approaching new opportunities with that mindset. And I&#8217;ve been open and honest when I have those exploratory calls with folks, I tell them, “We say no as much as we say yes and here&#8217;s why. We need to make sure it&#8217;s a good fit.” And I feel like businesses really like to hear that. I think then it almost puts them at ease a little bit because they feel like, “Oh, well, this isn&#8217;t going to be a hard sell here”, because a lot of people have had bad marketing experiences. <\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[29:49]<\/strong>       All of them.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:    <\/strong> <strong>[29:50]<\/strong>       Half of what I do is cleaning up other messes.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[29:53]<\/strong>       Seriously.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[29:53]<\/strong>       Having to talk them through, “Well, we did this, and it didn&#8217;t work” and I&#8217;m like, “Well, it was because of this and this.” So there&#8217;s a lot of trust-building, you got a lot of education. So it is a marathon for sure when it comes to landing new business in many cases, because most businesses, it&#8217;s not like that&#8217;s their first rodeo with marketing, it&#8217;s just chances are they&#8217;ve had a bad experience. And unfortunately, if you&#8217;re the person that they&#8217;re <strong>[inaudible 30:26]<\/strong>, you&#8217;re going to have to deal with that to a certain extent in some capacity.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[30:31]<\/strong>       Yeah, what I learned is, and here&#8217;s the other part, you have to be a little courageous when&#8211; Think about saying, “No” as like, “I&#8217;m really going to narrow the number of really good leads. I get 10 leads, but really, only three of them are going to be potentially legit.” And then you&#8217;re not going to get all of those, and so you need to be okay with doing that. And me being a salesperson most of my life, there&#8217;s this nagging thing of not winning every one and so you can be kind of hard on yourself, and then you set up a system that&#8217;s going to push them away. That really feels weird for a while.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[31:18]<\/strong>      Yeah. Before we wrap things up, I wanted to ask you one question that goes a little bit deeper, tell me a little bit about what&#8217;s the future for you, your business? Where do you want to see it go? And what are the things that you&#8217;re either working on or need to do to take it to that place?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[31:36]<\/strong>       Yeah, so the book, my podcast, here&#8217;s where I see things going, is that there&#8217;s a point in your business after a bit where you go, “All right, I&#8217;m running a good business. I&#8217;m a good business owner”, but what&#8217;s the next stage for you? And that&#8217;s to start becoming a mentor. That means that you&#8217;re producing content to support, like you&#8217;re doing and other agencies or business owners and whatever that is. You need to start putting yourself out there and require that of you of collecting your thoughts and getting them succinct, and then starting to publish in some manner where you&#8217;re giving to the community. It&#8217;ll bring you other opportunities that maybe you didn&#8217;t expect or that you couldn&#8217;t have predicted. Maybe more business, maybe speaking, mentorship, who knows what it&#8217;s going to lead to. So in my efforts, you produce a book, but then you need to have a marketing strategy behind it, you need to be producing content, continually introducing people to it because just because you publish a book, put it on Amazon, doesn&#8217;t mean everybody&#8217;s&#8211; It&#8217;s not flying off the shelves. There were like, I don&#8217;t know, 2000 other books published that same day. <\/p>\r\n\r\n\r\n\r\n<p><strong>                 [32:57]<\/strong>       So that, and then what [I&#8217;ve] also been doing, you know, I tell my clients, they need to start seeing themselves as a multimedia publishing house. “But Steve, were plastic surgery practice.” “Yeah, but you&#8217;re a multimedia publishing house. First of all, you&#8217;re not a plastic surgeon, you&#8217;re a businessperson. And now you need to start publishing content on a regular.” That&#8217;s like crazy for them to hear or actually see themselves. So what I&#8217;ve been doing is basically tricking them into becoming that. And here we have all the equipment to do this and so what I started doing was, I want to interview you, Mr. Physician, once a week. And what we&#8217;re going to do is have a conversation that&#8217;s like a content pillar around whatever your strategic campaign is. We can produce lots of great content with just a 45-minute interview once a week and pull it out of your head. So you don&#8217;t need to think about how to write it or how to do the blog, we&#8217;ll just pull it out. And now we got an audio layer, we have a video layer, and we have a text layer. That goes to the team, push it out our publishing system and it’s badass. But this is what happens. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [34:19]<\/strong>        First, they show up with the little Apple earbuds. And then it&#8217;s like, they show up and they&#8217;ve got, “What kind of mic should I get Steve? I&#8217;ve got this Yeti. Is that a good one?” “Yeah, Blue Yeti is a great one.” “How&#8217;s my lighting?” And now they&#8217;re like, “Can we bring someone in and interview them as well?” And then, “What&#8217;s that tool you were talking about? Vidyard?” Because now they&#8217;re starting to see where we&#8217;re going, and they start picking it up and running with it. So what did I do? I empowered them to start becoming a mentor and start producing great content because it&#8217;s fulfilling to produce good content. To sit and have a conversation like this, you and me, and we&#8217;re not being interrupted by our phones, by our kids, by the waitress if we&#8217;re at a pub and having a beer, it&#8217;s cool because we&#8217;re two nerds sitting here talking about something that we really can&#8217;t talk to many people about. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason<\/strong>:     <strong>[35:20]<\/strong>       Yeah. No, I love that. The podcasting thing has just been a really interesting journey. I love doing it. And people that don&#8217;t know anything about the behind the scenes with it, they look at it through a lens of similar to like TV, like, “Oh, my God, you have a podcast?” There&#8217;s like, a celebrity aura to it. We know it&#8217;s not that. I spent 60, 70 bucks on my setup here, and once I did a couple, I mean, it&#8217;s not that difficult really to do it. You just have to want to, and spend a little bit of time getting ramped up, but the production value and the time and the effort is not as significant as people from the outside looking in think. So that was the kind of thinking is like, now I&#8217;m on these calls with leads and trying to cultivate them, and they say something that triggers, “Oh, I talked about that in this episode.” Well, now I can follow up with an email, “Hey, it was great talking to you. By the way, you should listen to episode six of my podcast where we talked about this a little bit.” Then they get that like, “Oh, my God, you have a podcast?” Differentiator, you know?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[36:28]<\/strong>      Yes, totally.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[36:30]<\/strong>      So I can totally see how clients could stand to benefit in much the same way. They just have to kind of be shown&#8211; They&#8217;re just going to get a taste of it. And once they start doing it, they&#8217;re like, “Oh, this isn&#8217;t so bad. This isn&#8217;t so hard. I actually enjoy this.” So that&#8217;s impressive that you&#8217;re able to get clients to do that. We haven&#8217;t personally gone down that road with them but it&#8217;s an interesting way to do things for sure.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[36:55]<\/strong>      You should do it. They eventually love it. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[36:57]<\/strong>      Yeah, I&#8217;m sure they would. <\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[36:59]<\/strong>      You just show up and you do the interview.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[37:03]<\/strong>      Yeah.<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[37:04]<\/strong>      And this epiphany came for me, it&#8217;s like my whole reason I started my agency was to help our clients produce blogs. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[37:12]<\/strong>      Yeah. <\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>      <strong>[37:14]<\/strong>      And decide so how do we do that? Well, we&#8217;d have to meet with them and ask them questions, and then write the blogs and then get them to sign off on it. And that process, you just do an interview, you push it out. They don&#8217;t need to sign off on it. They were there. They said it. It&#8217;s beautiful.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>     <strong>[37:35]<\/strong>       No, I love it. That&#8217;s great. Well, awesome. I loved learning a little bit about what you do with your business. I mean, I love talking to other agency owners just because obviously you can relate so much but hopefully, there [are] some things in here that folks maybe are listening to that they could pull some thoughts or ideas from that might be helpful to them. But tell people where they can find you. What are you doing? Where can they find you across the web?<\/p>\r\n\r\n\r\n\r\n<p><strong>Steve:<\/strong>     <strong>[38:01]<\/strong>       Yeah, so my book, I wrote it for agency owners, and for business owners and marketing directors to help them get on the same page, say the same words, mean the same words, and see the same thing. So, first of all, I encourage you to get that <em>The Golden Toilet: Stop Flushing Your Marketing Budget into Your Website and Build a System That Grows Your Business<\/em>. It&#8217;s the funniest book on marketing, you&#8217;re going to enjoy it. You can get it on Amazon, you can listen to it on Audible, Kindle. Thegoldentoilet.com is my website for the book and then it&#8217;s roionline.com. Of course, I&#8217;m on LinkedIn, Steve Brown. Surprise, there&#8217;s more than one Steve Brown on LinkedIn, so it’s Steve Brown ROI Online. And yeah, reach out. Whatever I can help you as an agency owner and direct you, suggest resources. A great book, by the way, that really helped me, it&#8217;s called <em>The Marketing Agency Blueprint<\/em> and it&#8217;s by Paul Roetzer. I read it about 10 years ago, and I roughly based my business model off of that book. It&#8217;ll really help you with some shortcuts. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:<\/strong>      <strong>[39:14]<\/strong>      Awesome. I’m going to definitely check that one out. Well, thanks again for joining the show. I really enjoyed having you. And I also will be checking out all that stuff. That&#8217;s it for this episode of Socialistics. Make sure you like, review, share with your colleagues, and check us out at socialistics.com. Thank you for listening, and we will catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>It&#8217;s always great being able to have conversations with other agency owners, and this week I got to sit down with Steve Brown from ROI Online to discuss our shared stories on building marketing agencies, the challenges that come with it, and some great times and strategies for new or just starting out agency owners [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7048,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Talking Agency Shop with Steve Brown From ROI Online - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/talking-agency-shop\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Talking Agency Shop with Steve Brown From ROI Online - Socialistics\" \/>\n<meta property=\"og:description\" content=\"It&#8217;s always great being able to have conversations with other agency owners, and this week I got to sit down with Steve Brown from ROI Online to discuss our shared stories on building marketing agencies, the challenges that come with it, and some great times and strategies for new or just starting out agency owners [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/talking-agency-shop\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-05T15:22:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:38:13+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"33 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-steve-brown\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop\/#webpage\",\"url\":\"https:\/\/socialistics.com\/talking-agency-shop\/\",\"name\":\"Talking Agency Shop with Steve Brown From ROI Online - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop\/#primaryimage\"},\"datePublished\":\"2020-10-05T15:22:00+00:00\",\"dateModified\":\"2021-01-14T17:38:13+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/talking-agency-shop\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Talking Agency Shop with Steve Brown From ROI Online\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Talking Agency Shop with Steve Brown From ROI Online - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/talking-agency-shop\/","og_locale":"en_US","og_type":"article","og_title":"Talking Agency Shop with Steve Brown From ROI Online - Socialistics","og_description":"It&#8217;s always great being able to have conversations with other agency owners, and this week I got to sit down with Steve Brown from ROI Online to discuss our shared stories on building marketing agencies, the challenges that come with it, and some great times and strategies for new or just starting out agency owners [&hellip;]","og_url":"https:\/\/socialistics.com\/talking-agency-shop\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-10-05T15:22:00+00:00","article_modified_time":"2021-01-14T17:38:13+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/10\/image-14.jpg","size":"full","id":7048,"alt":"socialistics-podcast-steve-brown","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"33 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/talking-agency-shop\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/10\/image-14.jpg","width":560,"height":315,"caption":"socialistics-podcast-steve-brown"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/talking-agency-shop\/#webpage","url":"https:\/\/socialistics.com\/talking-agency-shop\/","name":"Talking Agency Shop with Steve Brown From ROI Online - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/talking-agency-shop\/#primaryimage"},"datePublished":"2020-10-05T15:22:00+00:00","dateModified":"2021-01-14T17:38:13+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/talking-agency-shop\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/talking-agency-shop\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/talking-agency-shop\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Talking Agency Shop with Steve Brown From ROI Online"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5239"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5239"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5239\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7048"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5239"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5239"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5239"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}