{"id":5309,"date":"2020-12-15T08:00:00","date_gmt":"2020-12-15T08:00:00","guid":{"rendered":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/"},"modified":"2021-01-14T17:36:31","modified_gmt":"2021-01-14T17:36:31","slug":"talking-agency-shop-copy-copy","status":"publish","type":"post","link":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/","title":{"rendered":"Why Being A Month To Month Agency Has Worked Out For Us"},"content":{"rendered":"\r\n<p>This week I&#8217;m flying solo and talking about how being a month to month social media agency has done more good than bad for us, and how you can learn from our mistakes to incorporate the same disruptive offering in your agency the right way.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-6589516\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/6589516-why-being-a-month-to-month-agency-has-worked-for-us.js?container_id=buzzsprout-player-6589516&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-spacer\" style=\"height: 20px;\" aria-hidden=\"true\"> <\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p>Hey there, and welcome to another episode of the Socialistics podcast &#8211; Social Media Agency Stories. This week I am flying solo. I decided to pull the topic out of my list, my bag of topics that I&#8217;ve come up with to talk about this week. And I&#8217;m going to talk about one of the things that we did as an agency from day one that I felt was a little bit of a disrupter and something that would help us land new business quickly. And I didn&#8217;t know if I always intended for it to be a thing that we would always do but we&#8217;ve stuck with it. But before we get into that, just kind of wanted to share insights into how things are going as an agency that&#8217;s relatively new, and obviously, in the middle, or hopefully, at the tail end of the pandemic. We saw quite a rush of new business over the past couple months, but as we&#8217;ve gotten into the tail end of November and into December, things have slowed down, which doesn&#8217;t surprise me. When I look back at my career at all of the roles that I&#8217;ve had, you get the holiday slowdown. A lot of businesses, most, not all are not thinking about investing heavily right now and they&#8217;re probably holding off until the beginning of the year to kind of figure out what they want to do. So my perspective has always been, when you get to this time of the year, to just hold steady. If you can hold on to what you have, that&#8217;s a good thing and that&#8217;s enough. So that&#8217;s my hope.<\/p>\r\n\r\n\r\n\r\n<p><strong>[01:51]<\/strong>     Unfortunately, we&#8217;ve lost a couple clients but when we lose clients, nine times out of 10, they&#8217;re for good reasons &#8211; they weren&#8217;t the right client for us, or they have situations that are kind of out of their control. We rarely ever lose ones because of a lack of results or because we&#8217;ve treated clients poorly. Those things don&#8217;t happen. But it&#8217;s still challenging to lose clients and that&#8217;s kind of the theme for this week&#8217;s episode &#8211; how we lose them and why. And one of the reasons that we do is because we are a month to month agency.<\/p>\r\n\r\n\r\n\r\n<p><strong>[02:33]<\/strong>     Now, we&#8217;re not the only one. So I&#8217;m not naive and want to say that I invented month to month terms as it pertains to the marketing agency industry. There are others that do it, more don&#8217;t. And a lot of my colleagues think that I&#8217;m crazy and that you shouldn&#8217;t do that. And my perspective when we first did it, when I thought about starting a social media agency, I thought of the idea of being a disrupter. And I&#8217;ve spoken to this plenty of times in previous episodes. I love using examples like Uber, and how they disrupted and just changed the dynamic of a person getting a ride from one place to another, and just dramatically changing that experience to the benefit of the end-user. And when I started an agency, I wanted to think about, “Well, what can I do similarly to disrupt? What can I do differently?” And I put myself in the mindset of our clients. “What are the things that they don&#8217;t like about selecting or working with an agency? What are the things that are frustrating to them? What would be an ideal experience for them?” and try to kind of reverse engineer that. And one of the things that came out of that thought process was long term contracts.<\/p>\r\n\r\n\r\n\r\n<p><strong>[04:02]<\/strong>     I mean, let&#8217;s be honest, nobody likes long term contracts, at least on the buying side. Nobody wants to be tied into something long term without knowing really what they&#8217;re getting. Obviously, you can shop around and you can interview and you can have conversations and reach a certain point of confidence that you think that this is going to be a good situation to get into. But ultimately, there&#8217;s always some uncertainty. When you get into a situation where you&#8217;re having to sign a long term contract. Oftentimes, it&#8217;s unavoidable. But I just felt like we had much more to gain than to lose by taking that approach because I believed that if we delivered results, and we treated our clients well, they&#8217;d have little to no reason to ever leave us unless it was for reasons that were genuine. So why not? And I felt like if I put that in place, it lowers the risk for clients to pull the trigger and give us a shot. So I especially thought that that was the way to go out of the gate. And that&#8217;s what we did. And it certainly made a huge difference in being able to get people to a yes. And it helped us kind of compete in a relatively competitive environment. There are thousands of agencies. Many of them are garbage; some of them are great. And there&#8217;s plenty of great ones out there for businesses to choose to work with. So I felt like that was something that we needed to do as kind of a bootstrapped startup agency. And it&#8217;s gone well for the most part. In the grand scheme of things, it&#8217;s been a good decision.<\/p>\r\n\r\n\r\n\r\n<p><strong>[05:54]<\/strong>     Now again, I&#8217;m not naive, my colleagues, and people in the industry will say that it&#8217;s a bad idea because it gives the power to the clients, it devalues your agency because you don&#8217;t have any guarantees in terms of your revenue. So if you&#8217;re interested in selling or being acquired, you&#8217;re going to have a difficult time making that happen because of that fact, and I understand all those things. I think what I&#8217;ve learned over the past couple years is that, again, the advantages have outweighed the disadvantages. Again, it goes back to treat clients well, deliver results, they&#8217;re going to stick with you. And I felt like if and when I ever reached a point that I wanted to sell the agency, I felt like there would be buyers that would look at our history of client retention and that would help alleviate maybe some of the current concerns that they would have that these clients aren&#8217;t tied to long term contracts. A large percentage of our clients have been with us for a long time and I feel like that history speaks for itself. So I feel like that will help negate that a little bit but at the same time, I also understand that it could be a black and white issue for potential buyers. But I&#8217;m not in that headspace right now. And the fact of the matter is, like I said, it&#8217;s been, I would say an 80 to 90% great decision because it&#8217;s worked for us because again, we treat clients well and we deliver results.<\/p>\r\n\r\n\r\n\r\n<p><strong>[07:30]<\/strong>     Now, on the flip side to that is that there have been some challenges with having that in place. One of them is that a client can&#8211; We have incredibly lax terms for our clients. They can literally cancel in the month that they&#8217;re currently in and not be obligated for any future retainer payments. Now, I&#8217;ve actually recently changed it because of some of the things that have happened recently. We&#8217;re learning, I&#8217;m learning about how to navigate contract language and to at least work some things in that alleviate the risks that come with being a month to month agency. We&#8217;ve had a couple examples of clients that have canceled on us for again, reasons completely out of our control. And the fact of the matter is that we lost two specifically this past month that I&#8217;ll use as examples.<\/p>\r\n\r\n\r\n\r\n<p><strong>[08:24]<\/strong>     Now one of them is kind of my fault. We are traditionally a B2B social media agency, but with our name being what it is, Socialistics, and having been in the market for a couple years, we naturally attract B2C as well, and we haven&#8217;t turned that away. And in the instances that we&#8217;ve had those clients, we&#8217;ve done well with them still. I personally believe that the B2B environment is a tougher landscape to navigate for social media. It&#8217;s a longer life cycle for buyers, it&#8217;s a lot more strategic in terms of the things that you kind of have to put in place and how you have to think so I think it&#8217;s more difficult to kind of navigate that. Not to say that good B2C social media campaigns are easy, but usually point and click products have a little bit lower barrier to entry. So we find that transitioning to B2C work is easier for us as an agency based on what we&#8217;ve experienced in the B2B world. But honestly, I should just be saying no to B2C opportunities, or at least sending those on to our partnerships. But it&#8217;s hard, sometimes you see a good opportunity and you want to give it a shot. And in this particular case, we did.<\/p>\r\n\r\n\r\n\r\n<p><strong>[09:33]<\/strong>     It was for a high end, female clothing line. And we did incredibly well. First couple weeks in we drove about $10,000 in sales on a relatively small ad buy and things were going well, but there was always a red flag in the back of my mind with this particular situation because the individual that we were working with, something was off. I couldn&#8217;t really put my finger on it, but I just figured we&#8217;d give it a shot. So I always had a lingering feeling like this isn&#8217;t going to end well in some way or somehow. And this was another one of those examples of me needing to do a better job of trusting my instincts because ultimately, they canceled on us for reasons that didn&#8217;t really make a whole lot of sense because, again, the results were there. And ultimately, just to kind of wrap it up in a bow and make a long story short, just not a good person. And I think they wanted to kind of either bring it in-house or pay less for the work that we were doing. And we&#8217;re not the most expensive, I mean, we&#8217;re like middle of the road in terms of our rates, and [they] kind of gave a really strange, awkward reason. I didn&#8217;t fight for the work because I knew it wasn&#8217;t a good fit, and kind of agreed to separate ways and go our separate ways. And as long as she paid the outstanding invoice for that month, then we would wrap things up for them respectfully. And ultimately, they pulled our access, they haven&#8217;t responded to emails, and they&#8217;re not going to pay their bill this month. And unfortunately, that&#8217;s on me. There&#8217;s a variety of reasons for that.<\/p>\r\n\r\n\r\n\r\n<p><strong>[11:09]<\/strong>     I mean, 80 to 90% of our clients, we actually collect payment information upfront, which honestly, if you&#8217;re listening to this, and you&#8217;re an agency owner, I really recommend that you don&#8217;t take on clients that don&#8217;t provide their payment information for you to run because you set yourself up for situations like this. So I need to do a better job of making sure that that&#8217;s a walkaway thing. If a client doesn&#8217;t agree to provide that, then we&#8217;re not going to work together, which is hard to do when you have a client that&#8217;s willing to work with you because we have clients that are bigger and don&#8217;t provide that information, and they pay their bills. So it&#8217;s not entirely a black and white issue. I mean, if you&#8217;re working with a major enterprise-sized business, they often aren&#8217;t going to give you that information. But because they&#8217;re big, they have a lot of money, they&#8217;re not the kind of companies that typically not pay their bills. You can kind of be a little bit more lax in situations like this. But certainly, for smaller businesses that don&#8217;t have accounting teams and aren&#8217;t enterprise-level, you really need to get their payment info upfront.<\/p>\r\n\r\n\r\n\r\n<p><strong>[12:11]<\/strong>     So she hasn&#8217;t paid her bill. I don&#8217;t anticipate that she will. And that&#8217;s one of the risks of being a month to month agency. She was able to cancel, not be obligated for any future payments, and unfortunately, I didn&#8217;t take her payment info and that&#8217;s the risk that I took. It&#8217;s going to be an expensive lesson for me. And in this particular case, that pushed me to update our contract language a little bit. So now I&#8217;ve worked in where you can cancel, but you have to give a 30-day notice. I was always a little leery of that because, in my mind, it&#8217;s almost like you&#8217;re in a relationship with somebody, like your boyfriend or girlfriend, you&#8217;re in a relationship, and then she wants to break up with you. And you&#8217;re like, “Well, that&#8217;s fine but we&#8217;re going to have to continue this relationship for another 30 days before you can break up with me.”<\/p>\r\n\r\n\r\n\r\n<p><strong>[13:08]     <\/strong>Now I know that that&#8217;s kind of an extreme example, but it doesn&#8217;t make sense. I mean, if somebody doesn&#8217;t want to work with you anymore, to have to continue on another 30 or 45 days of continuing that relationship feels strange, and not authentic. And I don&#8217;t know, I just always felt like, look, if you don&#8217;t want to work together anymore, then let&#8217;s just end this thing, the sooner the better. But now I&#8217;m realizing that I have to think a little bit bigger than that. I can&#8217;t let my own ego or perspective on that get in the way of what is best for our business. Because at the end of the day, it&#8217;s not just about me anymore, it&#8217;s about my team, and I have to take care of them, and I&#8217;m paying them no matter what. So I have to think about it in that way. So we&#8217;ve updated our language to say 30 days. So if they cancel the middle of the month, they still have to pay us for the following month.<\/p>\r\n\r\n\r\n\r\n<p><strong>[14:09]     <\/strong>I&#8217;ve also worked in language to strengthen around collections. This example I just shared is the first time that I&#8217;ve experienced this. So I&#8217;ve had to update our language to make sure that if I send something to collections, that they are going to be responsible for the fees associated with that. So you really have to kind of protect yourself as best as you can. Now we do a pretty good job of getting out in front of all those things. And I&#8217;ve learned some things and that&#8217;s the cost of learning these things. So I&#8217;ve updated our language, I feel like we&#8217;re chipping away and getting better at what we do to mitigate these sorts of situations so I&#8217;m not complaining. In the grand scheme of things, we&#8217;ve been in business for almost three years, this is the first time it&#8217;s ever happened. So we&#8217;re lucky in that regard but I want to learn from it. I want to make sure that we&#8217;re better and to not put ourselves in that position again.<\/p>\r\n\r\n\r\n\r\n<p><strong>[14:55]<\/strong>     So we lost that particular client, but that&#8217;s again, that&#8217;s good attrition, in my opinion, because it&#8217;s not anybody that we probably wanted to work with anyway. The other one, they just worked for a much bigger organization as kind of like an independent franchisee I guess if you would say, and ultimately, the powers that be told them that they couldn&#8217;t go off and do their own thing and that they needed to do all their social media through Corporate. So I think he just kind of went off and did his own thing and that kind of caught up with him at some point. So you come across situations where, like, in that situation, if I had made that guy sign a 12-month contract, what, I&#8217;m going to make this guy pay? We try to do the right thing so it&#8217;s a tough balance. And the pandemic is a good example of that too.<\/p>\r\n\r\n\r\n\r\n<p><strong>[15:21]<\/strong>     We had a couple clients that had tough decisions to make &#8211; pay vendors or pay our employees. I don&#8217;t want to be the vendor that ties them into a long term contract and might contribute to them not being able to pay their people. I mean, that&#8217;s a perfect example of a situation where I feel like a business should have some flexibility in how they spend their marketing dollars. And let&#8217;s be honest, when shit hits the fan with a business, what&#8217;s the first thing that gets turned off or paused? It&#8217;s marketing. And we&#8217;re kidding ourselves if we try to pretend that that&#8217;s not the case. I&#8217;m not saying that that&#8217;s what businesses should do, but ultimately, if they&#8217;re in a position of survival, and it&#8217;s the choice between spending money on that or continuing to keep their people, I mean, I feel like you keep your people, assuming that they’re good employees, and they&#8217;re people that you&#8217;re going to need to kind of help you get through difficult times. But I just chose to recognize and embrace the fact that that&#8217;s the reality that we live in. And like I said, for the most part, we&#8217;ve been able to navigate it pretty well. So I never went into it thinking that it would be flawless and that it wouldn&#8217;t sting us every once in a while, but the goods outweighed the bad.<\/p>\r\n\r\n\r\n\r\n<p><strong>[16:58]<\/strong>     And I certainly have to think about it in the context of one week grow bigger and when we get closer to maybe a point in time where I want to start thinking about being acquired or selling, and maybe I have to try to transition to long term contracts. In my mind, I felt like if we evolve as an agency and start to attract bigger clients, which we have over time, we&#8217;d eventually kind of get into that area and that sweet spot of companies that are bigger, maybe the Microsofts and the Amazons of the world that really aren&#8217;t concerned about month to month, maybe that&#8217;s not a sticking point for them or a benefit. And as we work with bigger clients, maybe we can transition to some more traditional contract lengths. Or with existing clients that have been with us for some time, and we&#8217;ve built a tremendous level of trust with, maybe we can go back to them and say, “Hey, in an effort to kind of increase the value of our agency, would you be open to signing a long term contract with us?” And maybe make it incentive-laden, like, “Hey, if you sign on for six months or 12 months, we&#8217;ll discount this or that.”<\/p>\r\n\r\n\r\n\r\n<p><strong>[18:16]<\/strong>     So there are ways I feel like we can transition into some of that to maybe kind of have the best of both worlds but we&#8217;re not there yet. We&#8217;re still young, we&#8217;re still hungry, and we&#8217;re still trying to compete and navigate in an environment that is tough. Everybody thinks they&#8217;re a marketer, everybody wants to run an agency. There&#8217;s a lot of misinformation and so it&#8217;s a very competitive, tough market to still navigate. And we feel like having month a month&#8211; You know, when I&#8217;m on these sales calls, and these business development calls, to me, it&#8217;s sticking our stake in the ground, saying, “We&#8217;re going to do what we say we&#8217;re going to do.” And the fact that we are committed to a month to month relationship should tell you, the business, that we&#8217;re serious about what we do, and we have to. Our livelihood is reliant on us doing what we say we&#8217;re going to do. So I feel like it creates a level of confidence with them that makes it easy for them to say yes with us. So I’d have a hard time kind of not doing that, I think, for the types of clients that we&#8217;re working with these days. But it doesn&#8217;t come without like I said, its challenges. And right now, after losing a couple clients, it&#8217;s had us rethinking things a bit, updating our language. I&#8217;m curious as to how that will impact things for us moving forward but such is agency life.<\/p>\r\n\r\n\r\n\r\n<p><strong>[19:39]<\/strong>     If you&#8217;re looking to start one, or if you&#8217;re just starting one, these are the kinds of things that you kind of have to think about in terms of how you do what you do. So I guess the big takeaways for this particular episode are [in figuring] out what your disrupter is, whether it&#8217;s being a month to month agency, and hopefully some of this kind of helped you navigate how that could work for you. But ultimately, if you do go down that path, make sure you have language in your contract that protects you as best as it can, in terms of what a situation like that could do. I think you negate it, again, a little bit by collecting people&#8217;s payment details upfront.<\/p>\r\n\r\n\r\n\r\n<p><strong>[20:16]<\/strong>     One thing I did forget is moving forward, that&#8217;s one way to kind of navigate this, right? If you get somebody that says, “Well, we&#8217;re not comfortable giving you our bank information or our credit card information, and they&#8217;re just not going to do it, my first instinct was walk away. But ultimately, another way to deal with that is, “Okay, well, if you&#8217;re not comfortable doing that, we don&#8217;t do any work until we&#8217;re paid because we&#8217;ve been burned in the past. So it&#8217;s okay if you don&#8217;t want to provide your information for us to just run things automatically, but if you want to work with us, we&#8217;re going to send you an invoice on the first of the month that has to be paid, and until it&#8217;s paid, we&#8217;re not going to do any work. So that&#8217;s another way to throw it out there to give them the option. So we&#8217;ll see, we&#8217;re going to try some different things and I&#8217;ll report back on what has worked and what hasn&#8217;t over time. That&#8217;s the whole point of this podcast is kind of to provide insight into clients about how we think about what we do, and also help agency owners who are either new, thinking about it or even existing ones that maybe have had some similar sorts of challenges.<\/p>\r\n\r\n\r\n\r\n<p><strong>[21:19]<\/strong>     So that does it, that&#8217;s it for this week. So thanks for listening. Make sure that you like, subscribe, all that good stuff. And if you have any questions, feedback, or you&#8217;re somebody that might be interested in joining us on our podcast, we&#8217;d love to hear from you. So reach out to us at socialistics.com, follow us on social. Thanks for listening. We will catch you next week.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I&#8217;m flying solo and talking about how being a month to month social media agency has done more good than bad for us, and how you can learn from our mistakes to incorporate the same disruptive offering in your agency the right way.   &nbsp; Hey there, and welcome to another episode of [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7028,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Why Being A Month To Month Agency Has Worked Out For Us - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Why Being A Month To Month Agency Has Worked Out For Us - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I&#8217;m flying solo and talking about how being a month to month social media agency has done more good than bad for us, and how you can learn from our mistakes to incorporate the same disruptive offering in your agency the right way.   &nbsp; Hey there, and welcome to another episode of [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-15T08:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:36:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"19 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#webpage\",\"url\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/\",\"name\":\"Why Being A Month To Month Agency Has Worked Out For Us - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#primaryimage\"},\"datePublished\":\"2020-12-15T08:00:00+00:00\",\"dateModified\":\"2021-01-14T17:36:31+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Why Being A Month To Month Agency Has Worked Out For Us\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Why Being A Month To Month Agency Has Worked Out For Us - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/","og_locale":"en_US","og_type":"article","og_title":"Why Being A Month To Month Agency Has Worked Out For Us - Socialistics","og_description":"This week I&#8217;m flying solo and talking about how being a month to month social media agency has done more good than bad for us, and how you can learn from our mistakes to incorporate the same disruptive offering in your agency the right way.   &nbsp; Hey there, and welcome to another episode of [&hellip;]","og_url":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-12-15T08:00:00+00:00","article_modified_time":"2021-01-14T17:36:31+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/12\/image-5.jpg","size":"full","id":7028,"alt":"socialistics-podcast","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"19 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/12\/image-5.jpg","width":560,"height":315,"caption":"socialistics-podcast"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#webpage","url":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/","name":"Why Being A Month To Month Agency Has Worked Out For Us - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#primaryimage"},"datePublished":"2020-12-15T08:00:00+00:00","dateModified":"2021-01-14T17:36:31+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Why Being A Month To Month Agency Has Worked Out For Us"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5309"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=5309"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/5309\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7028"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=5309"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=5309"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=5309"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}