{"id":6930,"date":"2020-11-24T08:30:00","date_gmt":"2020-11-24T08:30:00","guid":{"rendered":"https:\/\/socialistics.com\/talking-agency-shop-copy\/"},"modified":"2021-01-14T17:36:59","modified_gmt":"2021-01-14T17:36:59","slug":"talking-agency-shop-copy","status":"publish","type":"post","link":"https:\/\/socialistics.com\/talking-agency-shop-copy\/","title":{"rendered":"Confessions Of A Paid Media Director"},"content":{"rendered":"\r\n<p>This week I&#8217;m excited to bring Joanna Bresson from our team to the show. Joanna oversees all of our paid social efforts at Socialistics, and is a rock star at designing and executing real lead generating paid social media campaigns. We talk about what works, what doesn&#8217;t, what to look for as a business in selecting the right experts, and what traits it takes to be successful as a paid media pro.<\/p>\r\n\r\n\r\n\r\n<div id=\"buzzsprout-player-6364024\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/6364024-confessions-of-a-paid-media-director.js?container_id=buzzsprout-player-6364024&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n\r\n\r\n\r\n<div class=\"wp-block-spacer\" style=\"height: 20px;\" aria-hidden=\"true\"> <\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Jason:    [00:11]<\/strong>      Hello, and welcome to another episode of the Socialistics podcast. We are spreading out our episodes a bit because I believe in quality over quantity, and I was out of town for a bit. But I&#8217;m excited today to bring another member of our team on to the podcast today to kind of give us some insights and talk about paid social, specifically and mainly usually the big three or four, Facebook, Instagram, LinkedIn, sometimes Twitter, not so much there. But we do a lot of that work at Socialistics and I am very fortunate to have stumbled across Joanna, I think it&#8217;s been about a year ago, but she oversees all of our paid social media at Socialistics. She&#8217;s a rock star, and I&#8217;m super excited to have her. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [01:02]<\/strong>     Joanna, welcome to your first episode of Socialistics.<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [01:06]<\/strong>     Thank you, thank you for having me.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [01:08]<\/strong>     Of course. Awesome. So why don&#8217;t you just share with everybody a little bit about your background, where you came to be and your stops along the way and all that good stuff?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [01:21]<\/strong>     Sure. So I guess, in a very poetic way, I&#8217;ve been funneling myself down into kind of the position I am in today. So I started in digital media, working for a digital marketing agency that did everything. So SEO, website, kind of anything that you needed done digitally, we would. We either did, or we said we did, and we figured it out later. So I did pretty much everything at that agency but one of the things I was kind of in charge of was social media. So everything from content creation to posting, scheduling, and some paid ads towards the end. And then when I moved on from that agency, the next agency I went to was all social media. So I was focused solely on social media. I was still doing content, but then I really started to get my feet wet in paid ads. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [02:15]     <\/strong>And after about six months there in that all-encompassing social media account manager position, I shifted into doing solely paid ads, some big campaign work. So any company that came in with a big budget, I got to have my hands on and do the media planning and media buying. And then when I moved on from there, I found Jason at Socialistics and have kind of gotten to create my own role within the paid ads side of things. So that&#8217;s been really awesome. So I&#8217;ve kind of just worked my way down from doing everything to social to paid social.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [02:58]<\/strong>     Yep. Awesome. And one of the things I should highlight here, so when Joanna came out, I think I literally had like a couple hours of work for her and she&#8217;s now for all intents and purposes, full time, overseeing all of our paid social. It has grown into that. And that&#8217;s one of the things that I&#8217;ve loved about what&#8217;s happened with Socialistics of the past couple years, it&#8217;s given quite a few folks the opportunity to kind of go from just this side hustle thing, or just one of many things that they do to the only thing that they do. And she&#8217;s definitely one of the huge success stories for us in that regard. And I should have said, and I should have introed that she&#8217;s currently in Australia right now, which I&#8217;d say that only because one, it&#8217;s interesting, but two, it just reinforces the virtuality of Socialistics. We have people from everywhere, and it works, and it can work. Time zones get a little tricky, but when you find awesome people, you can work around that. So that&#8217;s one of the kind of unique things about Joanna. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [04:00]<\/strong>     So one question I have for you that I&#8217;m actually curious about that I&#8217;ve never really asked you is what is it about the paid social? You&#8217;d said you did all these things, and you&#8217;re a jack of all trades, and you&#8217;ve been awesome for us because you’ve filled in in other areas. But ultimately, now, the volume of paid social that we do has become so significant that that&#8217;s all you do. What is it about that facet of social media that you enjoy so much that you prefer to be in that world versus say, content creation and organic?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [04:30]<\/strong>     Yeah. So every agency that I&#8217;ve worked at and been at, when it comes to social media, you kind of have these account managers that are all-encompassing for content and paid ads. And I have always believed that people always lean more towards one side or the other. I&#8217;ve never felt like you can have the skills and the know-how for paid ads as well as kind of the creative content side of things. I mean, some people may, maybe I&#8217;m just projecting onto everyone else, but I&#8217;ve always felt like you kind of shine in one area. So the area that I shine in is definitely the numbers and the data and using the data to kind of inform my creative decisions. But when it comes to creative decisions, I&#8217;m just not as strong in the area, as I am with numbers. So I think that&#8217;s what&#8217;s always attracted me to the paid ads side of things, being able to do the reporting and take clients on this journey of results and numbers and graphs and data, and kind of showing them how the creative side of things is leading to this growth in their business.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [05:32]<\/strong>     Yep. So I can totally relate to that. So in the earlier part of my career, I was definitely the organic side, like the storytelling, the writing, content creation. My brain was wired in that way versus paid social. I didn&#8217;t spend a lot of time in that arena, which was part of the reason it was so awesome finding you and having you part of this team is because I wasn&#8217;t a subject matter expert with that. I needed to surround my people with people that had depth and knowledge and experience in areas that I didn&#8217;t. So that was definitely a plus for us. And I think for any agency owner that&#8217;s listening or wanting to start an agency, that&#8217;s one of the biggest things is, find people that complement what you know, or what you can do, because you&#8217;re not going to be able to do everything. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [06:18]<\/strong>     But another question I kind of want to frame up for you because I&#8217;m curious what your response to this will be. Because as an owner of the agency, I deal with this in the business development side, where I come across businesses that have a lot of skepticism about social and its ability to actually drive real results for them, as opposed to vanity metrics. I mean, sometimes a business, it&#8217;s important that they want to build their brand, so likes and followers and things of that nature can be important to them, but in my opinion, and I&#8217;m sure you&#8217;ll agree, that&#8217;s the easy part. Running paid campaigns to get people to like your page or follow, that&#8217;s not rocket science. Even with just a little bit of experience, you can kind of cross that bridge. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [07:01]     <\/strong>But what really, I think separates someone like you is that you know how to navigate paid social in a way that actually delivers leads and customers and sales. And that, to me is a whole other layer of experience and sophistication. But the question is, that I&#8217;m rambling my way towards is, when a customer or client or a business has no sense of the possibilities of what a successful paid social campaign can do for them, how would you overcome those objections from a client that thinks that all it&#8217;s good for is likes, followers and stuff like that? How would you respond to that?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [07:43]<\/strong>     Yeah, it&#8217;s actually one of my favorite parts of my role is getting to kind of educate clients, because there&#8217;s so much possibility within ads, Facebook, Google, LinkedIn, whatever, and it really is like learning another language. It&#8217;s taken me three years to get to the point that I’m at, and I still know that there&#8217;s plenty that I don&#8217;t know. But it is like learning another language. And so when I&#8217;m able to kind of translate that for the clients and say&#8211; They think all social media is, like you said, getting page likes and engagement and stuff. And they say, “You know, well, I really want sales.” And to be able to tell them that, “Okay, you have this e-commerce store, and I can target people specifically in this niche. And then if they add something to their cart, I can hit them again with a custom ad that shows them the exact product they looked at and says, ‘Hey, you forgot something in your cart.’” And to see the kind of success rate on ads like that, and to be able to show the client the specific metric is called ROAS which is return on ad spend. So to be able to show them that number and say, “Hey, you gave me $1, I made you $2.” Obviously, that&#8217;s just the ratio but sometimes it can be you gave me $1, I made you $10. So that&#8217;s really exciting and I think it&#8217;s mostly just about educating the client on what they don&#8217;t know because there can be a lot.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [09:08]<\/strong>     Yeah, no, for sure. On that note, so obviously, in a B2C environment, so we at Socialistics, our client mix is about 80\/20 &#8211; 80% B2B, 20% B2C. In the B2B world, that&#8217;s obviously a much different approach to what we do around paid. So I&#8217;m just curious, from your perspective, what is the difference? And think of it from the perspective of if a business owner was listening to this, and they&#8217;re B2B versus B2C and they&#8217;re thinking, “Well, our clients take six months to make a decision before they buy something.” What does paid social look like to them? And how can it be successful for them?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [09:50]<\/strong>     Definitely. So I think anyone who knows that they need to invest in some sort of marketing should be interested in social media. So in terms of different objectives that you can run, it&#8217;s not all just about e-commerce and getting people to that end goal of a conversion. So a lot of it can be about brand awareness and reaching a base that isn&#8217;t being reached in your industry, or by your business. So Facebook and Instagram are one of the cheapest places to serve ads. So you can get your name out there, you can get people to your website for really, really relatively low cost compared to taking out space on a billboard or a TV commercial or something like that. Not only that, but it&#8217;s extremely valuable to be able to run these ads for such a low cost and to be able to learn about your audience, get your message out there, get people on your website. And then, later on, six months down the road, you&#8217;ve invested a little bit in just getting people to your website, you can then build a custom retargeting audience and take everyone who spent a certain amount of time on your website and hit them with a conversion based ad after that six months goes by where you think they&#8217;re starting to make a decision. So I would say it&#8217;s always worth the investment, no matter what industry you&#8217;re in, or what your customer journey looks like.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [11:13]<\/strong>     Yeah, and to kind of build on that, when I get on business development calls with B2B business owners, what you just described, I frame it up in this way. I say, “Imagine&#8211;&#8221; Because they look at it from the lens of “The people that buy from us aren&#8217;t going to Facebook to research or find us or look for&#8211;&#8221; And I’m like, “You&#8217;re absolutely right, but you&#8217;re thinking of it in the wrong way.” Facebook has billions of users spending hours of time on Facebook. So regardless of what your personal opinion is of Facebook, whether you use it or not, the fact is, a lot of people do. And chances are a lot of the people that would be interested in your products and services are on Facebook for some extended period of time. So if they&#8217;ve been on your website at some point, Joanna and her team are the ones that are powering the magic of when they&#8217;re laying in bed, watching TV, or sitting on the couch and they&#8217;ve got their second screen, which so many people do, and they&#8217;re just kind of casually browsing on Facebook, not thinking about business. That&#8217;s when you scroll, and you see an ad for your business. And then they&#8217;re reinforced, it&#8217;s another touchpoint. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [12:27]     <\/strong>And anybody that owns a B2B type of company knows that there&#8217;s a certain number of times that your prospects have to be presented your brand before you get them to a point where they are interested in contacting you. And that&#8217;s where paid social comes in. It&#8217;s part of a process. It&#8217;s not meant to be a point and click product. It&#8217;s just meant to be a part of an overarching marketing plan that you have, and social is just a part of it. And that&#8217;s where people spend their time. And that&#8217;s what I love about what you do and your team does is because then it becomes eye-opening to them like, “Oh, that makes sense.” And then sometimes I land them and sometimes I don&#8217;t but that usually helps. That story helps a lot. So you&#8217;ve been with us now for&#8211; Has it been a year yet? Have we hit a year?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [13:24]<\/strong>     I think it&#8217;s been a year exactly. I don&#8217;t want to say today, but I know November.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [13:28]<\/strong>     I should know that. I have birthdays on the calendar; I probably need to put anniversaries on the calendar. So that being said, it&#8217;s been a year, you&#8217;ve seen a lot. What are some of the more memorable campaigns that you&#8217;ve run or things that just really stick with you that you&#8217;ve really enjoyed, have been really successful, or just stood out for you? Or maybe it was a learning experience that didn&#8217;t go really well but you learned so much from it. Is there anything that kind of stands out to you that jumps in your mind?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [13:57]<\/strong>     I think one of the coolest things that we&#8217;ve done quite recently has been the campaigns for one of our clients in the film industry and running campaigns to increase awareness and rentals of a couple of their films on some streaming platforms. It wasn&#8217;t something I&#8217;d really done before. I had obviously driven people to an action but in terms of renting a movie that was already out and everything, that&#8217;s not something I&#8217;d done before. So that campaign, it was hugely successful, which was exciting, but we learned a ton along the way as well. So that was pretty awesome. And it&#8217;s an industry I would love to see more of.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [14:36]<\/strong>     Yeah. So I almost went to film school. I always think about that. Getting them as a client was one of the more exciting experiences in this journey. We still work with them and I&#8217;m excited where that&#8217;s headed but I was blown away by what you were able to do for them. I mean, blew past all expectations in terms of just numbers, and the sheer volume of people that we were able to expose to that film, I think was pretty awesome.<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [15:08]<\/strong>     Yeah, and I think something interesting as well, I wouldn&#8217;t say that it was necessarily a blockbuster hit that you kind of just put on Facebook and cross your fingers and say, “Well, you know, everyone loves movies.” It was definitely more in the independent film category, probably more of a niche audience who would be interested in that. And just judging from obviously the results, you look at the data, but then you look at the comments that you get on the ads, and there&#8217;s just so much engagement and almost all of it, I would say 99% of it was positive engagement, people saying, “I&#8217;m commenting here, so I can watch this movie later.” “Remember to watch this movie later.” I mean, it was just outrageously successful in terms of we hit the audience that we wanted to reach, and it wasn&#8217;t necessarily an easy audience to reach.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [15:54]<\/strong>     Yeah, well, and that&#8217;s what I love about what we do. I mean, I think that&#8217;s what separates us. I think that&#8217;s what separates a great social media agency versus an average one is that just the level of sophistication and the quality of the content that you put out, the intellectual horsepower and experience that goes behind the ad strategy that gets that amazing stuff in front of the right people at the right time, the right numbers of times. So, this is what we always tell clients is, “If you have an awesome product, or you have something really interesting that people want, or need, we&#8217;ll knock it out of the park for you. Period.” That&#8217;s what we need is that you got to have something interesting. You have to have a story to tell. In this particular case, you’re right. It wasn’t like a blockbuster film, but they have realistic expectations, right? But there&#8217;s a very specific audience that would be interested in a film like that. So it&#8217;s not about trying to get that in front of as many people as possible. It&#8217;s about getting it in front of as many of the right people as possible. And that, to me is the magic of paid social. <\/p>\r\n\r\n\r\n\r\n<p><strong>                 [16:58]<\/strong>    And I think that it&#8217;s always interesting to have these conversations with business owners because they&#8217;re just so skeptical, but then it&#8217;s like, “Remember what it was…&#8221;, I mean, well, for the for older folks, “…but back in the day in the pre-90s I guess ish, your ability to get in front of people was billboards, and TV and radio. And that was super expensive, very, not measurable.” And now it&#8217;s anybody, you could start a business tomorrow and affordably market yourself online and know exactly where that money is going and what it&#8217;s going towards versus what&#8217;s working and what isn&#8217;t. So what&#8217;s one of the biggest things&#8211; I&#8217;ve seen you kind of come along a pretty awesome journey over the past year and seeing the level of sophistication and what you know, and what you&#8217;re able to do. What stands out to you in terms of some of the biggest things that you&#8217;ve learned over the past year, that have made you a better director of paid media at this point?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [18:00]<\/strong>     I think the biggest thing has been, in terms of skills, I don&#8217;t want to say I haven&#8217;t improved my skills, I&#8217;m always improving my skills on the tools. So technically speaking, like in ads manager and my grasp on who to target and how to target is always improving. But I think what&#8217;s really been different at Socialistics, as opposed to other agencies is kind of the freedom I&#8217;ve had to take ownership of my work. It&#8217;s not something I&#8217;ve really had before. So I think that has really improved my skills in areas of like client management and presentation and just kind of being the expert in my little world and being able to take clients with me on that journey and educating them and making sure that they&#8217;re along for the ride and I&#8217;m not just handing over a report month to month. So that&#8217;s probably been the biggest benefit to myself at Socialistics is just improving that client relationship.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [19:02]<\/strong>     Yeah, for sure. I mean, it&#8217;s been awesome. It was just you for the longest time and we brought somebody on board here recently, and I continue to imagine that that trend is going to continue. So I mean, the pandemic kind of slowed us down for a little bit, and then things just started to pick up like crazy. And I just don&#8217;t think that there&#8217;s going to be a whole lot of slowdown around companies investing in social because that&#8217;s where people are, and they&#8217;re just spending a lot of time. So what are some things&#8211; You know, a lot of these questions are genuine for me because I&#8217;m not in the day to day. So for me, this is an awesome opportunity just to kind of sit back and be able to learn myself. But what do you think is some of the biggest trends right now that are happening in terms of whether it&#8217;s technology or strategy? What are some of the things that are trending right now for businesses that are working well or that they should be thinking about moving forward?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [20:03]<\/strong>     So something that I&#8217;ve actually noticed recently, I would say post-pandemic is that so many more people are online, and that includes business owners. So like you said, it&#8217;s the best time to be online because everyone else is. So if you want to be seen, get on social and get some ads out there. So what I&#8217;ve actually noticed is you have to be able to stand out from the crowd. There&#8217;s a limited amount of real estate on any user&#8217;s feed. So if you want to kind of pass Facebook&#8217;s algorithms&#8211; Because they&#8217;ve got an agreement. They&#8217;ve got to provide user value. And you, as the advertiser, kind of have to provide that value within your ads. If it&#8217;s a bad ad, for lack of a better phrase, they&#8217;re not going to see it. So I think it&#8217;s really important to just stand out from the crowd, make sure that you&#8217;re following all of the rules and regulations that Facebook has with simple things like text on an image and stuff like that. I&#8217;ve seen a lot of ads just that are just poor quality. And so yeah, that&#8217;s something I&#8217;ve noticed post-pandemic.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [21:12]<\/strong>     Yeah. For a business owner that&#8217;s listening, what do you think the biggest difference is? What&#8217;s the biggest difference that they can expect working with an agency managing their paid versus maybe trying to tackle it themselves? Aside from the results, what do they stand to benefit from? What I&#8217;m trying to get at is a little insight and kind of peeling back the curtains to some of that sophistication that comes with working with an agency. Like what are some of the things that, maybe, a business owner wouldn&#8217;t even think of or know of, that&#8217;s going to impact their ability to navigate paid social successfully?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [21:55]<\/strong>     Yeah, well, I would say at a very surface level, when you have an agency, we have, I don&#8217;t know how many clients we have, I&#8217;m going to take a stab in the dark, and then say 15. Say we have 15 clients. We&#8217;re constantly learning and trying new things with all of our clients. So we learn one trend with one client, and then we can kind of cross that over onto another client, or anytime a new client comes on, we take those learnings with us. If you&#8217;re a business owner, or you have someone in-house working for you, you don&#8217;t get those kinds of learnings. And you don&#8217;t have almost checks and balances of people saying, “Oh, that&#8217;s actually a really high cost per click. Are you sure you&#8217;ve optimized that correctly?” If you&#8217;re running ads in-house, you get your cost per click, and that&#8217;s what it is. And you don&#8217;t have anyone challenging those results, which in an agency, we kind of have each other to be those checks and balances. <\/p>\r\n\r\n\r\n\r\n<p><strong>               [22:47]<\/strong>      At a deeper level, I would say, I don&#8217;t know if this is going to make any sense, but it&#8217;s almost like you don&#8217;t know what you don&#8217;t know. So you can go into Facebook Ads Manager and sure you can set up the ads. I think you were running ads before I came in. And it&#8217;s like, yeah, you can do it, you can click the buttons and you can get the ads live. But there&#8217;s so much in between that starting the campaign and clicking publish that there is to know, and that I think you can just so easily as a business owner, just slip right over. And you&#8217;re kind of missing out on those optimizations that could save you money and could help you reach more people, increase the user value. So just to give a few examples, like for instance placements. There are different sizes for the images that they need to be for different placements. And I think people don&#8217;t realize that when they&#8217;re setting up an ad, and it&#8217;s like that takes actually a lot of time to reconfigure your images or your videos to make sure that when it&#8217;s going to an Instagram Story, that it&#8217;s not a square image with some ugly text over it. You know, it takes a lot of insight. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [23:54]     <\/strong>And then obviously you have your audiences, and a lot of people will just say, “Oh yeah, my audiences are interested in XYZ”, kind of put those in and then move on. But it&#8217;s like, you can also exclude audiences, you can narrow down your audiences. There&#8217;s a lot of targeting that I think people don&#8217;t even realize is available to them. Or they just don&#8217;t have the experience or know-how to know. Yeah, little in split testing audiences. So once you set the campaign up, and then you get to set it all up again with a different split test to see what works better.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [24:23]<\/strong>     That&#8217;s all awesome stuff. Okay, let&#8217;s pivot to agency owner perspective. It&#8217;s actually a two-part audience thingy here I think a potential agency owner this would be useful for and or somebody that&#8217;s interested in a career path around paid social. If you were advising an agency owner in terms of what to look for&#8211; Let&#8217;s say, imagine a dude or a gal looking to launch a social media agency, and they&#8217;re going to go out and they&#8217;re going to hire a you or someone like you. What are some of the things that they should be looking for? What are the three to five non-negotiable things? Like these are things you really want this person to have either experience-wise, personality-wise, talent-wise. So I think this will help a potential agency and or somebody that&#8217;s interested in that path. What are the things that stand out, you think?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [25:15]<\/strong>     I would say definitely, they need to have ads manager experience. So that is the actual tool that they are running ads on, not just, “Oh, yeah, I&#8217;ve boosted a couple of posts here and there.” Definitely back end Facebook Ads Manager experience or whatever, Twitter, LinkedIn, they all have their own ads manager. So that kind of experience. You also need them to have some sort of presentation skills. So they need to be able to translate these boring numbers and data into something that&#8217;s exciting for the client that the client gets excited about and says, “Yes, I want to keep spending money with you.” So you need that person to bridge that gap where the client has no knowledge of it, and you have all the knowledge. You need to be able to kind of take them along with you on that journey. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [26:01]<\/strong>     I would also say, just in terms of personality, you would need someone who is willing to learn and who&#8217;s always saying, “Let&#8217;s test and learn.” The worst thing you can do is go into ads manager and say, “I know exactly who I need to target.” I think the best thing you could do is just be humble and say, “You know what? I have a good idea, but I also have three other ideas that I think might work.” And then I&#8217;ll add a couple others in there just to be safe. And you&#8217;re trying everything and you&#8217;re seeing what works best. You&#8217;re not really going in there with an ego and saying, “I think I&#8217;m going to put all my money on to that because I know best.” Like to have someone who&#8217;s kind of humble in that way and says, “I don&#8217;t know best, but I&#8217;m going to try my best.”<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [26:42]<\/strong>     I love it. That&#8217;s awesome. So I&#8217;m going to ask a couple more questions. I got two questions. Or actually one question, and one thing I want to wrap up that I know that we&#8217;re just launching that I think is really important and the timing is great to kind of talk about that. And this is purely selfish on my part because one of the things I love about what we&#8217;ve built, and I say we because it is definitely a we, is just the chemistry and the just awesome people that we have on this team, and the dynamic that we have, and how we work with each other, and what we do for our clients. Every day, I wish almost like we were being filmed the whole time. And it was some sort of show and people could see just so much of what happens. That&#8217;s what I struggle with is like how can I translate this amazing thing that we&#8217;re doing in a way that more people could see and understand? I think how awesome that would be. And it&#8217;s tough because so much of it happens on the fly, and you can&#8217;t plan for it. But obviously, a lot of that has so much to do with just finding awesome people and having a little bit of luck along the way. So in the past year of doing this, what are some of the biggest takeaways for you in terms of why this has worked well, why you&#8217;ve enjoyed it, and why it works? What stands out for you?<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [28:24]<\/strong>     Yeah. So the first thing that comes to mind is the culture. And when I say culture to anyone in the agency world, I feel like the first thing that comes to mind is the classic agency pitch to a new employee who comes into the cool, shiny office with the cool, shiny toys. They see a pool table and snacks or free food or whatever it is. And you&#8217;re kind of sold this idea that good culture is having drinks with your coworkers on a Friday night and the beers are provided or the first beer free. Or we have happy hour here, happy hour there. And I think a lot of people just buy into this idea that that&#8217;s what a good culture is. And the biggest thing for me at Socialistics has been the shift from culture being something tangible to something that&#8217;s like, what it should be. Culture should be intangible, that indefinable X factor of the camaraderie of all of us together and supporting each other, you know? <\/p>\r\n\r\n\r\n\r\n<p><strong>                [29:30]     <\/strong>I&#8217;ve lost someone this year. I know Ashley has lost someone this year. And to know that I can say, “Hey, this is what I&#8217;m going through” and I without a doubt, do not have to worry about anything until I&#8217;m ready to come back. That to me is the most important thing. That to me is culture. That to me is healthy culture. And knowing that no one&#8217;s talking behind anyone&#8217;s back saying, “Oh, can you believe she did this?” Or when a mistake is made no one&#8217;s pointing fingers or anything like that. I think that&#8217;s the most valuable thing to me that I&#8217;ve seen and gotten to be a part of. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [30:06]<\/strong>     Yeah, well, that&#8217;s like authenticity. It&#8217;s just like everything happens without trying. It&#8217;s like, people are doing things and treating people in ways that are natural to them. And it&#8217;s not forced, it doesn&#8217;t feel like you&#8217;re filling a quota. It&#8217;s just everybody&#8217;s being who they are. And a lot of that is obviously finding the right people.<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [30:38]<\/strong>     No, but I do think it comes from the top down as well. Like, I think a lot of people look to the head honcho &#8211; that&#8217;s you &#8211; for direction on how they&#8217;re going to be treated, and then how they&#8217;re going to treat everyone around them. If you create this dog eat dog kind of world, like, “He who makes the least mistakes will be crowned the employee of the month”, you know? I think it really helps that you&#8217;re very fair, and you appreciate, and we can feel when you appreciate us. Those things are so important. <\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [31:05]<\/strong>     Well, you know what it is, it&#8217;s because I am doing what I always wanted to receive and have on the other end. Like up until I launched Socialistics, look, I&#8217;ve had maybe one manager in my entire career that I can look back at fondly and feel like it was a great experience, and that it&#8217;s somebody that I highly admire and learned a lot from and respected, which is unfortunate. It shouldn&#8217;t be that way. And I was so frustrated along all of my stops along the way, which is part of the fuel on the fire behind wanting to do my own thing is I want to do it the right way. I want to show that it can be done the right way, and it can scale, and you can build a successful business and be awesome to people and be generous and do things differently. And that&#8217;s where it comes from. I mean, yeah, I was always wired that way. I&#8217;ve been a nurturer, and a lot of that just came from how I was raised and grew up. But ultimately, a lot of it was just from going through a lot of shit, a lot of the opposite of that, and then wanting to do it the right way. <\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [32:13]<\/strong>     Yeah, it&#8217;s funny that you mentioned that because I remember, shout out, the owners of my previous two agencies had never really been managed before, they kind of just opened a business, and you could tell. And I remember thinking when I left like, “God, I&#8217;d really love to work for someone who&#8217;s worked for someone because they would know what it&#8217;s like to be treated like an employee.”<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [32:41]<\/strong>     Yeah, no, for sure. I mean, that&#8217;s had a lot to do with it. So there&#8217;s not a day that goes by that I&#8217;m not appreciative and feel really lucky about what we have and what we&#8217;re building. And on that note, I kind of want to finish things up, just because the timing works out. So one of our core values is generosity. And I&#8217;m super excited because everything just kind of came together this week, or in the past two weeks to really figure out what that really means for us. I mean, we&#8217;re certainly generous with each other but what does that mean externally, for the world and what we do? I mean, we&#8217;re just a small little boutique agency. We&#8217;re not a big major player yet. But really, I think what sparked this was Inc. has a new award coming out, and I shared this with you guys. And it&#8217;s something about rewarding businesses. They&#8217;re charging for it; they&#8217;re trying to make a few bucks. But hey, it&#8217;s Inc., it&#8217;s a recognizable name. But it was interesting, because I went in there and when I looked at the questions, one of the questions, it asks something like, “What have you done to make the world a better place?” or “What have you done?” Something like that. It wasn&#8217;t exactly asked like that, but it got me thinking like, “I don&#8217;t know that we&#8217;re ready for this yet.” We&#8217;ve been so busy just trying to grow this business and treat each other well and we haven&#8217;t really been too proactive about how can we extend how we treat each other to the world. And for me, that was like, “Okay, we&#8217;ve got to get serious about this.” And so I&#8217;m really super excited. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [34:08]<\/strong>     So this month, we&#8217;re launching what&#8217;s called Socialistics Cares. And every month, we are going to highlight a charity, a nonprofit, an organization in need that one of our employees or contractors or whoever&#8217;s part of our family really cares about deeply, whether they&#8217;ve had personal experiences with it or just care about it deeply. And we&#8217;re going to highlight one of those every month, and we are going to publish a blog post and publish social media posts throughout the month to create awareness. And in addition, Socialistics is donating $250 to those causes every month. So I&#8217;m super excited about it. We&#8217;re doing it for the right reasons, and it&#8217;s really coming from a genuine place because everybody gets an opportunity to kind of have their organization represented once a month. So this month, Joanna was who picked something out this month for the American Foundation for Suicide Prevention, and we&#8217;ve got her blog post out. It actually went live&#8211; Well, by the time this podcast goes out, it&#8217;ll have been out a couple days. But I want to send it over to you, Joanna to kind of just share a little bit about why this is important to you and who they are and where people can find them, just because I know that it&#8217;s kind of near and dear to your heart.<\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [35:26]<\/strong>     Yeah. So it was kind of crazy timing when we were talking about how we wanted to kind of walk the talk, you know? We say we&#8217;re generous, were generous to each other, were generous to our clients, we wanted to be generous to the world. And I had been looking into some charities and found American Foundation for Suicide Prevention. Like I said, I lost someone earlier this year. I lost my dad, and he died by suicide. And ever since then, I&#8217;ve just wanted to do something that matters. And I think Jason, you said it best when you said at the end of our lives, we&#8217;re not going to be looking back saying, “Oh, wow, we did such great social media work.” We&#8217;re going to be looking back at these things, these moments, and saying, “Where did I give back? Where did I make my mark and have my voice be heard and support a cause that I really care about?” <\/p>\r\n\r\n\r\n\r\n<p><strong>                [36:18]<\/strong>     So I&#8217;ve chosen that charity this month, and like Jason said, written a blog post. We&#8217;re going to post some stuff on Socialistics’ social media. And I think it&#8217;s going to be something really amazing. I&#8217;ve already kind of started to see like, just within our internal stuff, it’s&#8211; For me, it sparked a conversation with everyone else, just saying, like, “Hey, while we&#8217;re telling everyone else to do this, if you guys ever want someone to talk to, I&#8217;m here.” And just to create that culture of awareness within our company, I think it&#8217;s just such a great thing to do, and a great place to start. So it&#8217;s been awesome.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [36:58]<\/strong>     Awesome. Well, I&#8217;m so proud of you for the strength that you&#8217;ve shown through this. And I can&#8217;t even fathom going through something like that, but also just the strength and being able to talk about it and to share it. I think it&#8217;s important that you and anybody that goes through something difficult like that uses that as an opportunity to help others. So I&#8217;m equally excited about raising awareness, not only for this organization but future ones that we&#8217;ll be highlighting. But for those of you that are listening, just go to the Socialistics blog, there&#8217;s a post there about the American Foundation for Suicide Prevention. We&#8217;ve got some links in there to kind of present some awareness to that. But check that out, it&#8217;s important, and we&#8217;re super excited to do whatever we can to make whatever difference that we can when it comes to these sorts of things. <\/p>\r\n\r\n\r\n\r\n<p><strong>                [37:50]<\/strong>     But on that note, also, thank you for joining the show. You did awesome. <\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [37:56]<\/strong>     Thank you.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [37:56]<\/strong>     Joanna was so worried that this wasn&#8217;t going to work. And I tried to talk her off the ledge which made it worse, but you were awesome. There&#8217;s some really good stuff in here. I know we&#8217;re going to have you back on here talking about more specific things about paid social as time goes on. But thanks for joining, I know you&#8217;re busy. <\/p>\r\n\r\n\r\n\r\n<p><strong>Joanna:  [38:18]<\/strong>     Thanks for having me.<\/p>\r\n\r\n\r\n\r\n<p><strong>Jason:     [38:20]<\/strong>     Of course! Absolutely. We&#8217;ll have you back for sure. So that&#8217;s it. That is it for this week. So thank you for listening. Make sure that you follow us on social media, leave us a review, subscribe to the podcast, all that good stuff. Check us out at socialistics.com. But that is it for this week. We&#8217;ll catch you next time on the Socialistics podcast.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I&#8217;m excited to bring Joanna Bresson from our team to the show. Joanna oversees all of our paid social efforts at Socialistics, and is a rock star at designing and executing real lead generating paid social media campaigns. We talk about what works, what doesn&#8217;t, what to look for as a business in [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7034,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Confessions Of A Paid Media Director - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/talking-agency-shop-copy\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Confessions Of A Paid Media Director - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I&#8217;m excited to bring Joanna Bresson from our team to the show. Joanna oversees all of our paid social efforts at Socialistics, and is a rock star at designing and executing real lead generating paid social media campaigns. We talk about what works, what doesn&#8217;t, what to look for as a business in [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/talking-agency-shop-copy\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2020-11-24T08:30:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-14T17:36:59+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"35 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg\",\"width\":560,\"height\":315,\"caption\":\"socialistics-podcast-joanna-bresson\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/#webpage\",\"url\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/\",\"name\":\"Confessions Of A Paid Media Director - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/#primaryimage\"},\"datePublished\":\"2020-11-24T08:30:00+00:00\",\"dateModified\":\"2021-01-14T17:36:59+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/talking-agency-shop-copy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/talking-agency-shop-copy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Confessions Of A Paid Media Director\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Confessions Of A Paid Media Director - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/talking-agency-shop-copy\/","og_locale":"en_US","og_type":"article","og_title":"Confessions Of A Paid Media Director - Socialistics","og_description":"This week I&#8217;m excited to bring Joanna Bresson from our team to the show. Joanna oversees all of our paid social efforts at Socialistics, and is a rock star at designing and executing real lead generating paid social media campaigns. We talk about what works, what doesn&#8217;t, what to look for as a business in [&hellip;]","og_url":"https:\/\/socialistics.com\/talking-agency-shop-copy\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2020-11-24T08:30:00+00:00","article_modified_time":"2021-01-14T17:36:59+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2020\/11\/image-8.jpg","size":"full","id":7034,"alt":"socialistics-podcast-joanna-bresson","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"35 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/11\/image-8.jpg","width":560,"height":315,"caption":"socialistics-podcast-joanna-bresson"},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy\/#webpage","url":"https:\/\/socialistics.com\/talking-agency-shop-copy\/","name":"Confessions Of A Paid Media Director - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/talking-agency-shop-copy\/#primaryimage"},"datePublished":"2020-11-24T08:30:00+00:00","dateModified":"2021-01-14T17:36:59+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/talking-agency-shop-copy\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/talking-agency-shop-copy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/talking-agency-shop-copy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Confessions Of A Paid Media Director"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/6930"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=6930"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/6930\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7034"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=6930"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=6930"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=6930"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}