{"id":7479,"date":"2021-02-10T08:00:50","date_gmt":"2021-02-10T08:00:50","guid":{"rendered":"https:\/\/socialistics.com\/talking-agency-shop-copy-copy-copy\/"},"modified":"2021-02-09T20:03:21","modified_gmt":"2021-02-09T20:03:21","slug":"how-to-leverage-public-speaking-for-your-agency-your-personal-brand","status":"publish","type":"post","link":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/","title":{"rendered":"How To Leverage Public Speaking For Your Agency &#038; Your Personal Brand"},"content":{"rendered":"\r\n<p>I had the pleasure of sitting down with Bob McIntosh who has and is absolutely killing it when it comes to the public speaking game. We discuss how agency owners or anyone for that matter, can position themselves to successfully navigate public speaking opportunities and make the very most of them.<br \/><br \/>Be sure to check out Bob at <a href=\"https:\/\/go3dc.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/go3dc.com\/<\/a><\/p>\r\n<div id=\"buzzsprout-player-7649716\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/7649716-how-to-leverage-public-speaking-for-your-agency-your-personal-brand.js?container_id=buzzsprout-player-7649716&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><b>Jason:   [00:13]<\/b>       Hello, and welcome to another episode of the Socialistics podcast. My name is Jason Yormark and I&#8217;m excited with our guest today. It&#8217;s always fun to bring in other agency owners and people that have gone down a similar path. His name is Bob McIntosh, he is the co-founder of 3 Degrees Consulting. Welcome, Bob, and tell us a little bit about yourself, your path to where you&#8217;re at today, and what you guys do at the agency.<\/p>\r\n<p><b>Bob:      [00:37]<\/b>       Yeah, absolutely. Thank you so much for having me here. I truly appreciate it. And for all of you listening or tuning into this, appreciate you taking the time to listen as well. Yeah, so my path was a little different. I actually started in real estate investing initially. And then through that, because I was partnered with my dad, and I lived in Los Angeles, and he was in Buffalo, I had to figure out ways of supporting the business without physically being in Buffalo. Because if you&#8217;ve ever been in Buffalo, you would know why I would want to live in LA instead, especially given wintertime. But yeah, so I was looking for ways to support, and I just kind of dove into internet marketing and kind of found that, hey, I actually enjoyed internet marketing a lot more. About 10 years later, I was like, “You know what? This is more of my passion, more of where I have a lot of expertise and excitement.” So I started launching an agency and we&#8217;ve just been helping primarily real estate investors, some financial advisors, and a few others, coaches, things like that with anything from websites to social media to pretty much if it touches internet in your business, we will probably do it for you. <\/p>\r\n<p><b>Jason:   [01:37]<\/b>       So how long have you had the agency?<\/p>\r\n<p><b>Bob:      [01:40]<\/b>       We are coming up on two years. <\/p>\r\n<p><b>Jason:   [01:43]<\/b>       Two years. <\/p>\r\n<p><b>Bob:      [01:43]<\/b>       Yep. So not a lot of time but I have been teaching internet marketing to business owners for about since 2012, so eight, nine years.<\/p>\r\n<p><b>Jason:   [01:53]<\/b>       Sure. So was 3 Degrees your first foray into doing your own thing as an entrepreneur?<\/p>\r\n<p><b>Bob:      [02:02]<\/b>       Officially, no; in a serious sense, yes. What had happened is I mean, as any of you guys who are agency owners, and this may be something that you guys need to think about from a lead generation standpoint, I spoke on a lot of stages. I’ve spoken, like I said, a little bit over 3500 hours to more than 10,000 people. And in that space, what ends up happening when you&#8217;re on the stage, you automatically by default, whether it&#8217;s true or not, gain the credibility. And because you gain that credibility, people come to you. Now, at a time when I was doing a lot of my speaking, I think my largest year was, I think I did 36 three-day events in a single year, so it was a lot. But when you start doing that people just naturally come to you. <\/p>\r\n<p><b>              [02:44]<\/b>       Now, of course, at the time, I wasn&#8217;t focused on really handling them, because a lot of it was speaking and I was just doing it for fun because the real estate was happening in the background and things like that. But I started realizing, “Oh, man, people are asking me to do this for them, maybe I should.” And so I kind of put a half-hearted attempt into doing it further with people, but never really went further than that. And then my current business partner, who&#8217;s a trainer for Tony Robbins, and really deep in that world, she understands the power of leverage, and she&#8217;s like, “Bob, you are amazing at this stuff. I&#8217;m going to leverage your butt to get into somewhere better, and we&#8217;re going to make it happen.” So about two years ago, we officially launched, and since then have made a very significant focus in where we&#8217;re going with it.<\/p>\r\n<p><b>Jason:   [03:21]<\/b>       I love it. All right, this episode is about to get selfish because I want to talk about the public speaking side of things because I&#8217;ve done it nowhere near as much as you have. I am an introvert. You put me in a room of 20 people and if I have to go up to people one-on-one and have conversations, I do not want to do that. I&#8217;m horrible at it; it makes me uncomfortable. I run away from that. You put me out on a stage in front of 1000 people… I shouldn’t say 1000, I&#8217;ve had 1000 people… a couple 100 people. No problem, love doing it, doesn&#8217;t bug me. I enjoy it.<\/p>\r\n<p><b>Bob:      [03:56]<\/b>       It’s funny how that works, isn&#8217;t it?<\/p>\r\n<p><b>Jason:   [03:57]<\/b>       I know, I don&#8217;t know why that&#8217;s the case. But I&#8217;ve done my fair share of that, and I really enjoy that, and I miss it. Obviously, in the current landscape of our world, that&#8217;s not happening very much but I look forward to kind of getting back to that. But yeah, I want to talk about this. How did you get into public speaking? I mean, it sounds like you&#8217;ve done a lot of it. Tell me about your path to that and how you&#8217;ve been able to position yourself as somebody that clearly is in demand for those opportunities. Or maybe you&#8217;re hustling, maybe you&#8217;re the one that&#8217;s having to&#8211;<\/p>\r\n<p><b>Bob:      [04:32]<\/b>       Little bit of both.<\/p>\r\n<p><b>Jason:   [04:33]<\/b>       Yeah. So I want to know about it for completely selfish reasons because I need to do better with it. So tell me your way. <\/p>\r\n<p><b>Bob:      [04:40]<\/b>       This is not selfish for you. I mean, maybe it is selfish for you, but I think most folks here are going to find a lot of value in understanding the power of having a stage because it is massively powerful, especially as a lead generation, but also a credibility standpoint. But my story actually starts back in my initial journey into internet marketing. So we had our real estate business, and then we kind of like, “Oh, this whole internet marketing&#8211;&#8220;, as I was learning about it, I was like, “This is kind of cool.” And we created this product that helped homeowners basically reduce the risk of them getting screwed by contractors. So we just taught them the basics of some things so that they wouldn&#8217;t. And we were able to, through the internet, partner with Angie&#8217;s List, and we sold 20 grand of that course in like three weeks. And I was like, “Holy crap, this is amazing.” I was like, “I&#8217;m all-in on internet marketing no.” And this is 2011 so this is before courses were really even a thing that everyone was talking about. <\/p>\r\n<p><b>              [05:31]<\/b>       I had some mentors that had taught me about that. And so I was at one of their conferences, there were about 500 people there. And I had no idea this was going to happen. I was actually sitting in the back of the room more because I didn&#8217;t need to be at the conference. I was just there to network and meet people. And as the main speaker is walking up on stage, he walks by me, he&#8217;s like, “Oh, by the way, I&#8217;m going to call you up in about five minutes, be prepared.” I freaked out internally because this is not me. I have been historically, up to that point in my life, an introvert, hardcore introvert. I was the guy playing Dungeons &amp; Dragons and video games, not the guy on stage doing things like that. But I was like, “Oh, my God, oh, my God, oh, my God, oh, my God, oh, my God,” literally, that&#8217;s what I&#8217;m thinking in my head. There are 500 people in this room so my heart is thumping, but I&#8217;m like, “Well, he&#8217;s not going to let me get out of this. Even if I walk out of the room, he&#8217;ll have someone track me down, so I have to do this.” <\/p>\r\n<p><b>              [06:27]<\/b>       So I get on stage and to this day, I could not tell you a single thing that I said from that stage, not a single thing. I had a complete out of body experience, which by the way, had you told me those [existed], I would have scoffed at you and said, “That&#8217;s not a real thing,” until it happened to me. And I was like, “Oh, my God, I&#8217;m literally floating above myself, watching me talk to these 500 people.” And I had no idea what I said to this day. But what happened was, in that moment, I knew without a doubt, unequivocally in my life, that this is what I&#8217;m supposed to be doing, and how I&#8217;m supposed to be doing it. And to a certain extent, at that time, at least, the people I&#8217;m supposed to be doing it with. Not necessarily the actual people, but this idea of entrepreneurs because they were all entrepreneurs in the room. <\/p>\r\n<p><b>              [07:06]<\/b>       So this happens, and then for the next two hours, I couldn&#8217;t leave the side of the stage. We were the last session of the day and literally for two hours, they were just standing next to me asking me questions. To this day, it&#8217;s still just a blur. I don&#8217;t really know. I was on this crazy high. Then I go to dinner, I&#8217;m sitting at dinner, and people keep coming to me. And I was just like, “This is insane.” From something that was not expected at all to this. And so I knew at that point in time, I had to seek this out. And so I did a couple of things to make it happen for myself. <\/p>\r\n<p><b>              [07:35]<\/b>       Number one, I sought out that same mentor. I said, “Hey, that was awesome. I want to do more of this, how else, where else can I speak? What does it need to look like?” Whatever it was, okay. Now, the funny part about this is that this happened, I still had my full-time job, our real estate business was just kind of getting off the ground, we were only maybe a year and a half, two years in, and I was making good money at my job. And at the time, I was still married, so I was like, I don&#8217;t want to give up. I was making 130,000 or so a year. I don&#8217;t want to lose that just yet. And I was like, “How do I do this?” And he basically [was] like, “Here it is.” And it was going to be a $50,000 pay cut but I could come speak for them a couple of times a year if I did some other things for them on the side. And I was in. <\/p>\r\n<p><b>              [08:15]       <\/b>And I remember at the time, my family and my wife was like, “What are we talking about? That&#8217;s the stupidest thing ever.” And I was like, “No, no, no, no, this, this will pay off in the future.” So that&#8217;s the first thing is just to understand that wherever and however you can get a stage ticket, I don&#8217;t care if it&#8217;s two people, 200 people, 2000 people, if you have to take time off, take a pay cut, don&#8217;t get paid, whatever it is, get out there and do it. That&#8217;s the number one thing because especially for someone, if you&#8217;re introverted, or you haven&#8217;t spoken on stage, there is a ton of skill to it. I don&#8217;t personally know anyone who just rolled out on stage and was amazing. They might have been good, but they won&#8217;t be amazing. So there are a lot of skills that you can learn and that really only comes from practice. And there&#8217;s no way to do it other than that. <\/p>\r\n<p><b>              [08:58]<\/b>       The second thing that I did, and this was what one of the mentors told me. He&#8217;s like, “Go to Toastmasters,” which I don&#8217;t even know if that’s still a thing now with COVID. Who knows? But it was the time at least and I loved it. And I was living in Los Angeles at the time and I found six different Toastmasters groups that met on different days of the week that I could go to, that were relatively close, but obviously, it might only be 15 miles away, but that could be an hour in LA traffic. So I was trying to find ones that were close. And I just went for six days a week for like several months just to hone some of my skills and the things that I needed to get better at. So those two things right there were the starting point of where I went.<\/p>\r\n<p><b>Jason:   [09:39]<\/b>       So how have you, in terms of obviously different world right now, let&#8217;s assume we get back to pre-COVID world here in the next hopefully three to six months when events start kicking back up and you get back into a normal routine. How much of your time is dedicated to the stage in terms of you actually getting on stage and doing presentations? How often are you doing that? And how are you getting those opportunities? Have you reached a point where they&#8217;re approaching you? Or are you having to aggressively kind of put yourself out there expressing your interest? I’m just kind of curious how you build your inventory of speaking opportunities.<\/p>\r\n<p><b>Bob:      [10:22]<\/b>       Yea. So the way that I&#8217;ve gotten what I&#8217;ve gotten so far is a couple of ways. Number one, once you speak for somebody once, in any capacity, they&#8217;re going to have you back again as long as you do a good job and as long as you make the organizer’s job as easy as possible. And this is something that a lot of folks, I think get wrong. They think, “Oh, I&#8217;m here to deliver for me.” No, you&#8217;re here to make the organizer&#8217;s life a heck of a lot easier. Now, you can do that by not asking a million questions that don&#8217;t need to be asked. Excuse my language, don&#8217;t be a dick. Don&#8217;t send over a rider that&#8217;s like, “I need these 85 things ready for me when I show up.” Because, especially if you&#8217;re new, they don&#8217;t care. <\/p>\r\n<p><b>              [11:03]<\/b>       Number three, just put yourself in front of every single opportunity. I literally have one of my team members right now, they go out and they literally just submit me to things. It&#8217;s, “Okay, is this a thing? Can I speak at it? Can I be on a podcast? Can I provide value for somebody there? Then yes, then I want to be there. As long as it&#8217;s my audience or my potential audience, then yes, I want to be there. How do I do it?” So that&#8217;s number one is just hustle and look. Now obviously, right now, with COVID happening, the number of opportunities are a lot more virtual, which actually creates both a bad and a good. It&#8217;s not the same. I know most speakers that I know that were getting paid, they&#8217;re like, “Oh, it&#8217;s virtual, you can do it for like half the cost.” It&#8217;s like, well, it&#8217;s still the same amount of time. Maybe I don&#8217;t have to fly and hotel and all that, so whatever. But it&#8217;s still my time for an hour, two hours, three days, whatever it&#8217;s going to be. And so those opportunities exist. They are lower-paying, but right now, just get out there. <\/p>\r\n<p><b>              [12:02]       <\/b>And I promise you that if you are listening to this right now, and you&#8217;re going, “Hey, I don&#8217;t know,” like, you&#8217;re just questioning yourself, just put yourself out there, you&#8217;re going to get more noes than yeses. I probably only make… I&#8217;d have to look at the exact number but probably less than 5% of the opportunities that I ask for do I actually get. But the few that you get that you nail will have you back a whole lot. So probably, I don&#8217;t know the exact number, but a good chunk of my hours came from one single company. The single largest chunk came from one single company because I nailed it for them and they said, “Oh, let&#8217;s have you back do this, do this, do this.” So we started doing a lot more. So that&#8217;s number one. <\/p>\r\n<p><b>              [12:42]<\/b>       The second thing is make sure that you have the credibility behind yourself in whatever capacity, whatever your agency is about, whatever you&#8217;re doing, have the credibility behind yourself to make it look like you should be there. Because not only is your job to make the organizer look good, but the audience also has to be impressed. And so if you&#8217;re like, “Hey, I&#8217;ve been running my agency for two months and I&#8217;ve never done a deal,” and whatever, you&#8217;re probably not going to be the best candidate for something like that. But what do you have experience in? Start there and then grow it from there, it will make things a whole lot easier. And for me, my podcast is part of that credibility. Because I can say, “Hey, look, if you want to see how I do on stages or in interviews and things like that, here&#8217;s some interview videos, here&#8217;s some stage videos, here&#8217;s podcast videos or audios” so that they have a good feel for who I am before I ever walk in that door.<\/p>\r\n<p><b>Jason:   [13:32]<\/b>       Pre-COVID, how many speaking engagements were you doing a year?<\/p>\r\n<p><b>Bob:      [13:36]<\/b>       It varied. Like I said, my top year was 36 events. Some of them were two days and some of them were three days. And those were twofold. That was interesting. But yeah, 36 events was the most. I would say, would I do that again? I did it for like a year and a half at that pace. I don&#8217;t know that I would do that again. It&#8217;s a ton of time. It&#8217;s a lot of travel. It&#8217;s just a lot. With that said, if I could shoot for one a month, I&#8217;d be good with that, would be my goal. And one, not necessarily just a speaking event, but I&#8217;m looking at a speaking event as being minimum of 100 people. For me, that&#8217;s my minimum right now. Not to say that I won&#8217;t go to something that&#8217;s smaller, especially right now with COVID, but if I&#8217;m going to fly someplace, I&#8217;m going to be there especially for multiple days, there&#8217;s got to be enough people there to make it worth my time as well for what I&#8217;m doing. Now, again, that&#8217;s where I&#8217;m at. If you&#8217;re just getting started, if it was 10 people, I probably take it.<\/p>\r\n<p><b>Jason:   [14:35]<\/b>       Sure. What percentage of the shows that you do are paid versus not? Have you reached a point where you don&#8217;t go unless they pay you to do it?<\/p>\r\n<p><b>Bob:      [14:42]<\/b>       I&#8217;m pretty much only paid at this point in time. That year that I did 36, it was 10 grand per event. So that was about the average is what it was. I would say when I got started though, it was much, much slower. I was getting paid for probably 30% of what I spoke for, and the other 70 was either free or they paid for my travel, like, “Hey, here&#8217;s some mileage or flight costs and hotel costs,” but I wasn&#8217;t being paid to actually speak. So that would probably be in that range. And I don&#8217;t know the exact number, but it&#8217;s probably pretty close.<\/p>\r\n<p><b>Jason:   [15:21]<\/b>       At what point were you able to get paid to do this versus not? Was it right out of the gate, or what needed to happen for you to get into a position where that was the expectation?<\/p>\r\n<p><b>Bob:      [15:41]<\/b>       I set the expectation pretty much from the start that I wanted to get paid. And then I would leave negotiation for up to there. Now, there are two ways of looking at it. The first is, am I going to be able to sell my stuff or not? Can I do Legion? Can I get a text opt-in? Can I do that? If not, I&#8217;m more apt to not be paid to speak because there&#8217;s another opportunity for me to make income by doing that. If I&#8217;m not able to do that, then I&#8217;m definitely going to get paid for being there because otherwise why&#8211; I&#8217;m sure I can build my audience and I can get followers, and maybe a couple of them might ask me for some things, but if I can&#8217;t directly sell&#8211; Now, there&#8217;s also a whole world of selling at 90 degrees so that even at those events where I wasn&#8217;t able to sell, I was selling what I was doing at 90 degrees for them. So it wasn&#8217;t like, “Hey, go buy my stuff,” but I was over here like, “Hey, if you&#8217;re going to buy stuff, make sure you buy it from someone who knows what they&#8217;re doing, has a lot of experience, has done these things.” And they&#8217;re like, “Oh, who is that? Oh, Bob does that, maybe I should talk to him.” But I didn&#8217;t overtly say, “Go buy my stuff.”<\/p>\r\n<p><b>Jason:   [16:44]<\/b>       Right. Well, that makes sense. So strictly from an agency perspective, obviously, again, pretty-COVID, what percentage of your agency&#8217;s business or I should say maybe leads comes from these experiences, would you say?<\/p>\r\n<p><b>Bob:      [17:04]<\/b>       Right now, 100%. But I want to quantify that. Not 100% necessarily directly because I was on stage and I pitched something and they bought it. Because there is some of that, there&#8217;s going to be a percentage of it that is that. But at this point, our agency has fully functioned on my ability, both myself and my partner&#8217;s, who much has a much smaller audience, but she does have some people. Our agency functions 100% on our warm audience, so people who know me, like me, follow me, maybe they have joined one of my free Facebook group, or got a Discord server, or a few other things. They come in, and eventually, they&#8217;re like, “Oh, man, this guy knows his stuff.” And I&#8217;m always providing value, and eventually, they come on board. So it&#8217;s been huge for us.<\/p>\r\n<p><b>Jason:   [17:51]<\/b>       Gotcha. In terms of the events that you go to, are you introducing yourself to them as an option, or have you reached a point where you&#8217;ve been doing this long enough that people coming to you for these opportunities?<\/p>\r\n<p><b>Bob:      [18:15]<\/b>       It&#8217;s both. I would say it&#8217;s 80\/20 &#8211; 80, me reaching out to people still, and 20% coming back to me, excluding the ones who I&#8217;ve already spoken and they&#8217;re asking for repeat business. If it&#8217;s a cold contact, and we haven&#8217;t conversed before about me speaking, it would probably be 80\/20. And I would say, the 20 that are coming to me are oftentimes smaller groups. So especially in the real estate world, because it&#8217;s so localized, there&#8217;s a lot of little meetups of people. And so for example, there&#8217;s one that I have spoken for her, I think six or seven times now. She&#8217;s got a group of like 25 or 30 that show up and maybe 60 that are in the group. But it&#8217;s a continuous driver of business and she always elevates me because she knows that I&#8217;ve done a good job for her in what we do.<\/p>\r\n<p><b>Jason:   [19:00]<\/b>       And you brought up a good point around niche. Are these events that you&#8217;re participating in typically niche-focused or are they more kind of generalized shows?<\/p>\r\n<p><b>Bob:      [19:10]<\/b>       They were hyper niche-focused initially, and they&#8217;ve gone more general, but I&#8217;ve only done two, I&#8217;ll say, completely general events where it&#8217;s just entrepreneurs, instead of, “Hey, this is a conference for these kinds of people.”<\/p>\r\n<p><b>Jason:   [19:28]<\/b>       That&#8217;s a good point actually. When I think about my own experiences, my experience is vastly more limited because I launched my agency a couple years ago and was at traditional businesses and agencies. So any speaking opportunities I had, I didn&#8217;t care really whether they paid me or not, because it was just, “Hey, I get a chance to get out of the office and do something different.” So different world, different experiences. But I&#8217;m kind of curious around assuming that you&#8217;re good on stage, you&#8217;ve got a couple under your belt, is it more likely that getting paid to do those things comes from being more niche-focused than general? Because the experience that I&#8217;ve had is a lot of shows that I&#8217;ve spoken at are like search marketing this or social media this or just something general, and they&#8217;re not going to pay anybody. They might pay for your travel but it&#8217;s really competitive. Just to get a spot on stage is competitive, so they don&#8217;t pay anybody. So I&#8217;m just kind of curious about the world of people getting paid to speak. Is that typically more common for folks in a niche environment?<\/p>\r\n<p><b>Bob:      [20:48]<\/b>       Yes, and no. I would say it&#8217;s not so much the niche as it who&#8217;s putting on the conference that you&#8217;re speaking at. So for example, if we take Social Media Marketing World, everybody wants to be on that stage, take Funnel Hackers Live, everybody wants to be on that stage. Because you&#8217;ve got 1000s of people, it’s a huge event, so your competition to get on that stage is going to be intense. And they know that they don&#8217;t have to pay somebody because there&#8217;s someone who may be 10% as good as you are but they&#8217;re willing to do it for free and deliver a ton of value so that&#8217;s where you&#8217;re going to lose. Now, the reverse side is find companies who want you to come in and speak. So the majority of my paid speaking gigs came from a company who said, “We want you to come deliver this thing that you&#8217;re good at, for our customers, our employees,” whatever group that they&#8217;re hosting this for. <\/p>\r\n<p><b>              [21:43]       <\/b>And the reason that that is the case is because they&#8217;ve already got a budget allocated to that. They know that if its customers, they know the customers bought XYZ, this is part of it, they got to pay me this portion to go do that. And their customers are happy, they keep buying, etc. So that becomes much, much easier to find paid gigs in that world but nobody looks in that world. Everyone always goes to these big conferences, because look, most of my events that I did, I&#8217;d say most of my events were between 50 and 150 people. So they&#8217;re not these 1000 person events that everybody&#8217;s trying to apply to. And a lot of folks would look at that event and go, “Oh, I&#8217;m not going to bother because I only want to go after the big ones.” But not realizing that that 50-person event might actually pay me to be there because there&#8217;s no competition and they know they have to.<\/p>\r\n<p><b>Jason:   [22:27]<\/b>       That&#8217;s really interesting. How do you find those opportunities? What&#8217;s your process? Because I would imagine I mean, I&#8217;m sure maybe every once a while they might reach out to you. But if I&#8217;m an agency owner, if I&#8217;m somebody that&#8217;s interested in those sorts of opportunities, what&#8217;s your process for identifying or finding those, those little opportunities that can pay big?<\/p>\r\n<p><b>Bob:      [22:47]<\/b>       So the number one tip I can give you is find yourself and become good friends with somebody who is an event planner. Event planning, especially in the entrepreneur space, or whatever your niche is, it doesn&#8217;t matter what the niche is, the event planning space in any singular niche is ungodly tiny. If I look at the entrepreneur space for event hosts, like events for entrepreneurs, I would be willing to wager that there are less than 100 people total in the entire United States who focus on that, probably less than 50, realistically. And so if you find one of them, and you become friends with them&#8211; So I have a couple that I&#8217;ve managed to make friends with, they all know each other, and they all talk to each other. So make that person&#8217;s life amazing and easy and they will tell everybody else about you, which is your easiest thing. So then when you go to apply for something that you found on a website, or through whatever, or however else you might have found it, they&#8217;re like, “Oh, yeah, I know you know Joe Smith, whatever. I worked with Joe at XYZ conference, he really loved me. Feel free to reach out to him and he&#8217;ll be happy to&#8211;” whatever. And that credibility right there, when an event planner stands up and says, “Yes, this person is good, you want to have them,” you&#8217;re in, you&#8217;re good. That&#8217;s it. So I would start there. <\/p>\r\n<p><b>              [24:04]       <\/b>And the way that I found those people honestly, is through LinkedIn. Using Sales Navigator, I can target exactly who they are, and hone in and reach out to them that way and just go. And then once you become friends and one of them, I make it a very purposeful effort to continue friendship. So for example, on my birthday Zoom call last May, I invited one of the event planners that I know. Unfortunately, she couldn&#8217;t make it. She had kids and whatever, she couldn&#8217;t come. But again, I invited her to come hang out on my Zoom birthday, which for some people might be weird but it&#8217;s like, “Hey, I&#8217;m going to that level of depth.”<\/p>\r\n<p><b>Jason:   [24:36]<\/b>       Yeah. So what does that introduction look like from you? Say somebody is listening to this and they’re like, “You know what? This is a great idea. I&#8217;m going to go on LinkedIn. I&#8217;m going to try and foster some relationships in this way.” What&#8217;s your intro usually like? Because I mean, when I think about my LinkedIn inbox, it just gets hammered with stuff all the time. Ninety-five percent is just noise. Every once in a while, somebody does something clever or it&#8217;s just timely &#8211; it actually relates to something that I&#8217;ve been thinking about looking for &#8211; so it does work. But I&#8217;m just kind of curious, what&#8217;s been your approach to kind of your initial outreach to somebody to kind of build a relationship? What&#8217;s the message? What&#8217;s the value that you&#8217;re bringing to kind of capture their attention and try to foster a relationship?<\/p>\r\n<p><b>Bob:      [25:18]<\/b>       Yeah, so it&#8217;s a couple of things. At the end of the day, how you reach out to them is everything. If you come at them, like, “Hey, I want to speak at your event,” they&#8217;re going to be like, “Whoa, hang on. Timeout,” shut it down, right? I come at it from two ways. Number one, I always send a voice message, or a video depending on who it is and how important they are. And then number two is, understand that an event planner’s life can go one of two directions at an event &#8211; it can be the smoothest, easiest thing possible, or it can be an unmitigated nightmare. And your only goal for a new event planner is to make their life as easy as you possibly can. And so I do that. I&#8217;m like, “Hey, look, I&#8217;m an easygoing person. Here&#8217;s the value that I can bring to your audience. That&#8217;s what I&#8217;m here to serve is you and your event’s audience and make your life as easy as possible. Let me know how I can do that for you, and I will make sure that it happens.” And I can&#8217;t say nobody because I&#8217;m sure people are, but I think very few approach it right. <\/p>\r\n<p><b>              [26:25]<\/b>       Most people approach trying to speak on stages like they&#8217;re doing the King Kong pound my chest, “Look at me, I&#8217;m a badass, I know all this stuff. I&#8217;m going to do this, I&#8217;m going to do this and I&#8217;m going to do this.” And it&#8217;s like, “Well, you&#8217;re talking all about yourself. And the person who&#8217;s going to hire you ultimately, or at least stick up for you to the person who makes the decision to hire you has to like you first. If they don&#8217;t like you, they&#8217;re never going to. And then, understand that it takes time. You&#8217;re not going to roll into the biggest events for entrepreneurs in the country and say, “Oh, because I was nice to you on LinkedIn, put me on your stage.” It doesn&#8217;t happen. So for example, I&#8217;m good friends with Cole Hatter and the Thrive event, which is a huge entrepreneur event. I know for a fact, because I know him personally, that he gets over 1000 speaking requests for that event every year, over 1000 and there are usually 20 to 25 speakers at that event. So your odds of getting in are impossible unless his event coordinator, her name is Whitney, says, “Hey, you need to talk to this person,” or you&#8217;re in his circle, or one of his immediate circle, like his mastermind, people like that, say, “Hey, this is someone that you should look at because they’re really good for XYZ.” That&#8217;s how you get the attention. <\/p>\r\n<p><b>              [27:40]       <\/b>And I share that story because I think it&#8217;s important as well to understand that if you&#8217;re going for these bigger events, ultimately, the event coordinator is the one who will make or break you, but the event organizer is the one who has to ultimately thumbs you up, especially in big events. And so if you are constantly in their circles, it&#8217;s going to be way easier. So for example, if I was like, “Hey, I want to get on Russell Brunson’s stage for Funnel Hackers Live,” the first thing that I would do is I would join his mastermind. Yeah, it&#8217;s like 50 grand for the year. Okay, so I got to understand, can I do that? If I can&#8217;t, okay, well that’s not going to be reasonable. But if I joined his mastermind, now all of a sudden, I&#8217;m in proximity. And proximity, as Tony Robbins always says is power. Now he sees me, and he goes, “Oh, okay, this guy is cool.” And just keep providing value so that when that ask finally comes around, it&#8217;s that much easier to say yes.<\/p>\r\n<p><b>Jason:   [28:32]<\/b>       Yeah. No, I love that. It&#8217;s a good way to kind of visualize it. Getting into people&#8217;s radar, I think it makes a lot of sense that that&#8217;s the first step, I think, in being able to kind of even be considered for things of that nature. But fascinating stuff around the company stuff and the smaller niche-based opportunities. There has been some great stuff in here that hopefully, people can take away. I want to kind of wrap this up in kind of one question. If somebody is listening to this that hasn&#8217;t maybe done any public speaking, knows that they want to do it, what are one or two things that somebody should&#8211; Assuming that they have the capability of doing it well and that it&#8217;s something that they want to pursue, but they&#8217;ve never done it, what&#8217;s the first step? What do they do to kind of create either some credibility? Because I think that&#8217;s the hardest thing for anybody really, when it comes to just about anything is taking that first step around everything. It feels so daunting and so overwhelming. And it&#8217;s like, well, how am I ever going to get to my ultimate goal? And it just feels like this huge thing. How do you break it down into smaller chunks? What are the first couple things that somebody should do to kind of get the ball rolling for them to create some sort of momentum towards getting on stage and getting some of those opportunities?<\/p>\r\n<p><b>Bob:      [29:51]<\/b>       Absolutely. So first things first is don&#8217;t turn down any opportunity, and if none are in front of you right now, create yours. So if you are an agency owner, can you host a client meet up, even if it&#8217;s just on Zoom right now, and say, “Hey, we just want to bring all our clients in to update you on the latest and greatest that’s happening.” And maybe it&#8217;s only an hour or two hours, whatever it is, but it gets it going. So create your own stage if you don&#8217;t have one that you can go to, and obviously, start seeking out the ones that you can. The second thing that I would say is the thing that I absolutely detested doing but was the single most important factor in me improving as a speaker was I recorded on video, every single event that I spoke at, every single one. And after that event, I would rewatch like a football player, watch my tape. “Oh, I messed up there. Oh, I didn&#8217;t do this here. Oh, I didn&#8217;t hit my Triple H here. Oh, I didn&#8217;t hit the 90-degree seed over there.” And I would rip myself apart, not when I did good, only what I did bad. <\/p>\r\n<p><b>              [30:53]<\/b>       And I know it sounds crazy. But there&#8217;s an interesting idea going around now that you used to always have this idea of when you deliver bad news, you give it in a compliment sandwich &#8211; something nice, something bad, something nice, and they feel good. It smashed it, right? The new way of thinking about it is, when we do it that way, sometimes people only hear the nice and they ignore the bad because they were surrounded by nice and so it becomes less effective. And so I spent a separate time going through, “Oh, I this good, I did this good, I did this good” and a different time going, “I did this bad, I did this bad, I did this bad.” And I would literally keep creating notes for myself. And then next time I would speak on that same topic or subject or talk, I would have those things. Now, not necessarily every single thing, but the points where I was like, “This is my biggest single or one, two or three pieces of improvement that I can make in this speech this time, instead of last time.”<\/p>\r\n<p><b>              [31:47]<\/b>       And then the last thing is, when you&#8217;re getting started, if you don&#8217;t know your talk inside and out&#8211; Literally, let&#8217;s say you&#8217;ve got 100 slides, if you can&#8217;t walk through 100 slides without the slides and know exactly what&#8217;s going on, you&#8217;re not ready to give the talk by itself solo. And what I mean by that is you need to have a crutch and my crutch is my outline. So when I first started, I had a physically printed outline because I was doing a talk about internet marketing and so I was always prepared that what happens if the internet goes down? Okay, well, now I can do this whole thing. If we have nothing but a space outside and me, I can do the whole event because I got a physically printed outline ready to go. And in my outline, I&#8217;ll highlight in red the areas for improvement where I know I messed up so it&#8217;s in my head. So that&#8217;s number two. <\/p>\r\n<p><b>              [32:33]<\/b>       And then number three is if you&#8217;re going to build slides for your show, give yourself virtual cues in the slides to do things that you know you need to do. And what I mean by that is so usually for me, in the bottom left corner of every slide, if there&#8217;s something that I need to hit, say, do, whatever, there&#8217;s going to be a letter down there. And people might see it, but they&#8217;re not going to really know what it is, they&#8217;re just going to say, “Oh, there&#8217;s just a rogue letter on the slide. They don&#8217;t think anything about it. But for example, if I want to seed something for sale 90 degrees, so I don&#8217;t forget it, I&#8217;ll put a 90 on the bottom left. We have a technique called the Triple H, which I won&#8217;t get into because that&#8217;s a whole different crazy, but it&#8217;s a technique of presenting certain information to increase their trust in me as I&#8217;m presenting the information. I&#8217;ll have the H in the bottom H1, H2, H3 because there&#8217;s three H&#8217;s. So I know I need to go to H2 on the slide. Don&#8217;t forget to say this in this way. So all these little cues will help you. Don&#8217;t ever worry about those things. As you get better, you won&#8217;t need them. As you memorize your talks and you know what&#8217;s going on, you won&#8217;t need them. But when you&#8217;re first getting started, it will make a world of difference in what you&#8217;re doing.<\/p>\r\n<p><b>Jason:   [33:44]<\/b>       Outstanding. So I did not expect this to be the public speaking episode but I’m thrilled that it went in that direction because I love it and there&#8217;s some really great stuff in there. So one last thing, we were talking a little bit about technology so I would be hard-pressed to not ask. I asked this question to everybody, just again, selfish. I&#8217;m a gadget freak, that&#8217;s my vice. So I always ask everybody, “What&#8217;s your favorite piece of technology right now? A tool, a gadget, a service, a product, something that you&#8217;ve been using, or just something that you just cannot get enough of right now whether personally or professionally? I&#8217;m always curious about that.<\/p>\r\n<p><b>Bob:      [34:28]<\/b>       That&#8217;s a good question.<\/p>\r\n<p><b>Jason:   [34:31]<\/b>       Or a book you read, anything that stood out to you recently.<\/p>\r\n<p><b>Bob:      [34:36]       <\/b>So this is probably going to be the lamest answer ever, but I just moved to iPhone from Android literally on Christmas Day, and I got Air Pods Pros, and they are the best headphones. I&#8217;m kind of obsessed with how good they actually are, how good they sound. There&#8217;s a transparency mode so people can talk to me and I can still hear them even with them in. I don&#8217;t know. To me, I&#8217;m just obsessed.<\/p>\r\n<p><b>Jason:   [34:58]<\/b>       Now. Honestly, I just bought&#8211; I hate admitting this because people are going to roll their eyes, but I sprung and bought the Air Pods Max. So yeah, I&#8217;ve had the pros, so I can&#8217;t get enough of them. They are fantastic. That&#8217;s interesting. So you&#8217;ve been an Android user for a long time and you&#8217;ve now&#8211;<\/p>\r\n<p><b>Bob:      [35:19]<\/b>       Long, long time. I used to hack banks legally as a living. That was my old job way back in the day, which we didn’t even get to that. But so I was like, “I&#8217;m a hardcore not Apple person because I always wanted to mess with my stuff. I&#8217;m the guy that&#8217;s in there, opening my computer up, overclocking the CPU, and doing all the crazy things with it. <\/p>\r\n<p><b>Jason:   [35:37]<\/b>       So what made you change? What why the switch? <\/p>\r\n<p><b>Bob:      [35:40]<\/b>       Honestly, we have a lot of higher-end clients, and we would text with them, because our highest level clients, we always give them our cell phone number so if there’s something crazy they need. And I got enough stares of the, “Oh, you got the green bubbles, not the blue bubbles?” And I&#8217;m like, “You know what?” And I finally was just like, “Okay, we&#8217;re going to go,” but I didn&#8217;t just get all in. I ordered a Mac, I got the air pods, I got the iPhone. I was just like, “We&#8217;re just ditching all my old technology and getting new stuff. So it will be an interesting ride. If you don&#8217;t hear from me for a month, it’s because I can&#8217;t figure out how to use it yet.<\/p>\r\n<p><b>Jason:   [36:13]<\/b>       So, what has been your opinion? What&#8217;s your honest opinion now being in this ecosystem? I&#8217;m just kind of curious about that.<\/p>\r\n<p><b>Bob:      [36:23]<\/b>       Yeah. So my adversity to Apple was never in the quality of their product. It was in their business model for their draconian principles of how they apply it. That was always what I didn&#8217;t like. So I stand by it, and it is, it&#8217;s nice to have everything just work together. It just syncs seamlessly. I will say that&#8217;s something that Windows just has not figured out yet, or an Android for that matter.<\/p>\r\n<p><b>Jason:   [36:48]<\/b>       I agree. I mean, for me, I&#8217;ve been using Apple now for 10 years. I was at Microsoft for six or seven years, so I definitely drink that Kool-Aid. And then the iPhone came out. And then when I got that I&#8217;m like it changed everything. So I&#8217;ve been all Apple ever since then. But not to the point where I&#8217;m like&#8211; I mean, they do things that suck. There&#8217;s no doubt about it. But super interesting. That&#8217;s awesome. Is there anything I didn&#8217;t ask you that you think might be helpful to folks based on kind of what we talked about today?<\/p>\r\n<p><b>Bob:      [37:23]<\/b>       I mean, nothing specifically. If I can help you guys, come find me. I&#8217;d love to converse. I love talking speaking, obviously, if I&#8217;m a speaker. That’s how much I clearly like talking<\/p>\r\n<p><b>Jason:   [37:34]<\/b>       Tell the people where can they find you? Not only where can they find you, but I&#8217;d love for people to be able to… I&#8217;m assuming you&#8217;ve got some video of you on stage, I think that would really complement what you&#8217;ve talked about today to kind of see it in action. So where can they find you? Or where can they find some of your talks?<\/p>\r\n<p><b>Bob:      [37:50]<\/b>       Yeah, so they can find me pretty much anywhere @thebobmacintosh, and Macintosh is M-C-I-N-T-O-S-H. On literally every platform, it&#8217;s the same handle. So just find me there. Where are my videos of me speaking? That&#8217;s a good question. There&#8217;s a private link that I sent out to people for it but I don&#8217;t know that I have anything on&#8211; That&#8217;s really funny that you bring that up because I don&#8217;t think I&#8217;ve ever been asked that before. So there will be videos. They will be on YouTube at some point in time. So follow me on YouTube because I&#8217;m going to go put them up there as soon as we&#8217;re off here, apparently.<\/p>\r\n<p><b>Jason:   [38:21]<\/b>       Awesome. Well, this was fantastic. When I have these conversations, you never know what direction they&#8217;re going to go, which is what I like about it. Because this is a perfect example of that. It just kind of went into a topic that I love, and I certainly learned a lot from this myself. So hopefully folks that are listening did as well. So thank you so much for joining me today and sharing that wisdom. I&#8217;ll definitely be following you and following your journey and taking some of that advice for myself.<\/p>\r\n<p><b>Bob:      [38:53]      <\/b>Thank you for having me. And for all of you listening, thank you for your time. I know it&#8217;s your most important thing you can give, so I appreciate you giving it to both Jason and myself.<\/p>\r\n<p><b>Jason:   [39: 00]<\/b>      Awesome. Well, thanks again. And thank you if you&#8217;re listening to the Socialistics podcast. We will catch you next episode.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>I had the pleasure of sitting down with Bob McIntosh who has and is absolutely killing it when it comes to the public speaking game. We discuss how agency owners or anyone for that matter, can position themselves to successfully navigate public speaking opportunities and make the very most of them. Be sure to check [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7481,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Leverage Public Speaking For Your Agency &amp; Your Personal Brand - Socialistics<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Leverage Public Speaking For Your Agency &amp; Your Personal Brand - Socialistics\" \/>\n<meta property=\"og:description\" content=\"I had the pleasure of sitting down with Bob McIntosh who has and is absolutely killing it when it comes to the public speaking game. We discuss how agency owners or anyone for that matter, can position themselves to successfully navigate public speaking opportunities and make the very most of them. Be sure to check [&hellip;]\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-02-10T08:00:50+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-02-09T20:03:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"36 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg\",\"width\":560,\"height\":315},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#webpage\",\"url\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/\",\"name\":\"How To Leverage Public Speaking For Your Agency & Your Personal Brand - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#primaryimage\"},\"datePublished\":\"2021-02-10T08:00:50+00:00\",\"dateModified\":\"2021-02-09T20:03:21+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How To Leverage Public Speaking For Your Agency &#038; Your Personal Brand\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Leverage Public Speaking For Your Agency & Your Personal Brand - Socialistics","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/","og_locale":"en_US","og_type":"article","og_title":"How To Leverage Public Speaking For Your Agency & Your Personal Brand - Socialistics","og_description":"I had the pleasure of sitting down with Bob McIntosh who has and is absolutely killing it when it comes to the public speaking game. We discuss how agency owners or anyone for that matter, can position themselves to successfully navigate public speaking opportunities and make the very most of them. Be sure to check [&hellip;]","og_url":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-02-10T08:00:50+00:00","article_modified_time":"2021-02-09T20:03:21+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/02\/bob.jpg","size":"full","id":7481,"alt":"","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"36 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/02\/bob.jpg","width":560,"height":315},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#webpage","url":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/","name":"How To Leverage Public Speaking For Your Agency & Your Personal Brand - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#primaryimage"},"datePublished":"2021-02-10T08:00:50+00:00","dateModified":"2021-02-09T20:03:21+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"breadcrumb":{"@id":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/how-to-leverage-public-speaking-for-your-agency-your-personal-brand\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How To Leverage Public Speaking For Your Agency &#038; Your Personal Brand"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7479"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7479"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7479\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7481"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7479"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7479"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7479"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}