{"id":7785,"date":"2021-04-06T06:24:35","date_gmt":"2021-04-06T13:24:35","guid":{"rendered":"https:\/\/socialistics.com\/?p=7785"},"modified":"2021-04-07T05:37:21","modified_gmt":"2021-04-07T12:37:21","slug":"how-to-integrate-social-selling-into-your-agency","status":"publish","type":"post","link":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/","title":{"rendered":"How Marketing Automation Can Make or Break Your Agenc‪y‬"},"content":{"rendered":"\r\n<p>Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.<br \/><br \/>Learn more about Jason at <a href=\"https:\/\/www.intentionallyinspirational.com%20\" target=\"_blank\" rel=\"noopener\">https:\/\/www.intentionallyinspirational.com <\/a><a href=\"https:\/\/drivedigitalads.com\/\" target=\"_blank\" rel=\"noopener\"><br \/><br \/><\/a>Find Socialistics at <a href=\"https:\/\/www.socialistics.com%20\" target=\"_blank\" rel=\"noopener\">https:\/\/www.socialistics.com <\/a><\/p>\r\n<div id=\"buzzsprout-player-8247891\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8247891-how-to-integrate-social-selling-into-your-agency.js?container_id=buzzsprout-player-8247891&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><span style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" data-mce-type=\"bookmark\" class=\"mce_SELRES_end\">﻿<\/span><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><b>[Music]<\/b><\/p>\r\n<p><b>Jason Yormark:<\/b> Hello, and welcome to another episode of the Socialistics podcast. I am Jason Yormark, owner, and founder of Socialistics. Excited to have you here for another episode. And I’ve got another awesome guest today to talk about something that has perplexed me for quite some time. I&#8217;ve dipped my toe in it, marketing automation, email, all that good stuff. We&#8217;ve certainly figured out social media, but that piece has not been quite figured out for us yet. So I look forward to talking to my guest today. Jason Wright, welcome to the show.<\/p>\r\n<p><b>Jason Wright:<\/b> Thanks for having me. And I must say you have a great first name.<\/p>\r\n<p><b>Jason Yormark:<\/b> Yeah. Agreed. And for those of you that obviously cannot see us. We look similarly as well. So it was a little weird at the beginning, but that&#8217;s okay. I dig it. So welcome to the show. Glad to have you. Let&#8217;s just dive right in and tell us a little about yourself, your background and what you&#8217;re doing these days.<\/p>\r\n<p><b>Jason Wright:<\/b> Yup. So when I&#8217;m not entrepreneuring I love the outdoors, man. I love to golf, love to hunt, love to fish, just love to be outside. So you figure, you know, how it is. You&#8217;re in front of a computer a lot. It&#8217;s healthy, and it&#8217;s important to break up that routine a little bit, you know? So that&#8217;s a little bit about me from a really high level. My background, interestingly enough, is not in digital marketing at all, but I go back to kind of the corporate days, it was HR safety and sales. So it&#8217;s been an interesting journey, I kind of ended up here from seeing opportunities and pivoting and figuring out I&#8217;m good at some things over time. And this particular journey has been about five and a half years so far. So we can dive into any part of that you want to if you want. <\/p>\r\n<p><b>Jason Yormark:<\/b> Yeah, well, tell me a little bit about intentionally inspirational. What is that and what do you guys do?<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah, so intentionally inspirational, It&#8217;s a digital marketing and strategy agency. You know, we help people build sales funnels. We&#8217;ve got a very platform specific focus with it. So active campaigns, that we use for email marketing and CRM, click funnels is what we use for the front end and we use [02:21 inaudible] a lot as well. But when people kind of drift into our sphere of influence, they recognize like yourself that, Hey, I&#8217;m doing some things right and making money. I know who I&#8217;m targeting, but I know I&#8217;m just missing opportunities all over the place. I know that I could build deeper connections with my audience, but I don&#8217;t know what to say to them. So we really help connect those dots. It used to all just be architecture. We would build stuff for you. Now we do, you know, we do that, and we have the active campaigns specific agency, and we do a lot with strategy as well. So I never thought there was as much of a need for ongoing strategy as there is. And it&#8217;s great. I&#8217;ve really enjoyed doing it and meet some really cool people that way and build good relationships. <\/p>\r\n<p><b>Jason Yormark:<\/b> Who are your typical clients that you work with? <\/p>\r\n<p><b>Jason Wright:<\/b> Yep. So it&#8217;s not niche down by industry. It&#8217;s typically entrepreneurs or small businesses making 300 grand a year in revenue or up. The small businesses, you know, maybe 20 or 30 people, corporations making a lot more money, but those folks are usually like head of marketing departments and things like that. But entrepreneurs are usually that, you know, 300K to 5 million a year revenue across all industries, right. Physical products, services, info products, and a mix of all those as well. So really interesting how that&#8217;s worked out.<\/p>\r\n<p><b>Jason Yormark:<\/b> Have you actually had any agencies like marketing agencies that maybe don&#8217;t specialize in that come to you?<\/p>\r\n<p><b>Jason Wright:<\/b> Absolutely. Yep. So I’ve got marketing agency in one of my strategy programs now. So they just do things a little bit differently, which there&#8217;s a ton of agencies out there that focus like yourself on social media or, you know, different things. But yeah, absolutely. So there&#8217;s always opportunities for that. <\/p>\r\n<p><b>Jason Yormark:<\/b> I think one of the things that I’ve learned in running our agency is that you have to just, you can&#8217;t do everything, especially as an owner of an agency. Like I enjoy it. I love kind of figuring things out, but that&#8217;s not the best use of my time. Especially as you kind of get past kind of the agency being bigger than you, now having a team of people. And so I’ve gotten comfortable with kind of, you know, outsourcing facets of what we do and that, you know, that&#8217;s really, you know, what you need to do. You need to make sure that you put experts on the things that you just really don&#8217;t have the time for or should be spending time on. So what does an engagement look like? So let&#8217;s say I&#8217;m an agency and I&#8217;m coming to you. I specialize in social media or SEO or, you know, I&#8217;m not really in the email game. I come to you and I&#8217;m like, I need help. Like what does that engagement look like? And what is it that you&#8217;re actually being able to do for that business or agency? And what facets of this do they still have to own for it to be successful?<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah, so, you know, usually I start, my sales funnel kind of starts with that first phone call, right? We get on for 20 minutes. I want to figure out who are you, where are you and where do you want to go? And I&#8217;m going to know within five minutes, if we&#8217;re a good fit or not, and it has nothing to do with, you know, do I like you or not. Obviously, if you seem crazy, I probably not going to work with you. But like I said, if you know who you&#8217;re targeting, you&#8217;re already making money. You already have a business, but you recognize that what I call the back end of the funnel, the email marketing is a deficiency. I can probably help you. So what I would do is I would say, Hey, this is what we do. We use a program called active campaign. If you want to work with us, you must use it too. Or we won&#8217;t work with you. So I force people to niche down by platform and they don&#8217;t care. And what I&#8217;d recommend is our agency. Hey, we can help build all this stuff for you. We can help you with ongoing strategy. You must own the email copy and the email template design. We&#8217;re not going to help you with that. I&#8217;ll give you recommendations. I&#8217;m not going to do it for you, because at that point, I’ll lose my butt with the way of our package is set up. But it works really well because companies can have that ongoing expert in that little niche. And you know, we can help give them strategy even beyond that, through their overall funnel as well. But it&#8217;s so far so good with that. That&#8217;s kind of a newer offering, but it&#8217;s taken off pretty well. <\/p>\r\n<p><b>Jason Yormark:<\/b> So sounds like you kind of manage the technical sides of things, not so much kind of the creative development of like copywriting and things of that nature.<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah. And the only way that we do copy anymore is if we do like a full custom funnel build, if we build the front end, the back and set up all the traffic strategy, but with the agency stuff, we just, yeah, we stay away from the copy. <\/p>\r\n<p><b>Jason Yormark:<\/b> Got it. And are agencies or business, don&#8217;t you think of what you do, cause I think of it kind of theirs cold outreach and then kind of nurturing. Are most of the clients that you work with, are they coming to you with an existing list of people that they need to nurture or are they looking to kind of have you set up or manage a campaign for maybe a list that they bought or that they&#8217;ve gotten access to that, you know, it&#8217;s cold. It&#8217;s not anybody that they&#8217;ve worked with previously. What are they typically kind of coming to you with?<\/p>\r\n<p><br \/><b>Jason Wright:<\/b> So it can be both. The biggest opportunity that people have is probably help with that. Like we talked a little bit about even before the show, the cold outreach. Maybe they&#8217;ve got some ad campaigns, where they&#8217;ve got some good organic strategies and they&#8217;re getting people into their email list. And then they&#8217;re like, now what do I do? If they don&#8217;t buy something right away, I don&#8217;t know what to do. So we put together a really simple but effective series of automations that helps nurture people through different steps of the customer journey. That&#8217;s another thing we get into a lot, like in my business, it&#8217;s you&#8217;re aware of me, you book a call, we have the call, I represent your options. Either give me a verbal commitment or you think about it and then you either close a winner, [07:47 inaudible] lose you. It&#8217;s a pretty simple pipeline. But in each of those stages, there&#8217;s automations that trigger based on you going there. And it really does help me step away from that, but still continue to nurture people where they&#8217;re at to get them into that next phase. So we help businesses with that a lot. And then for other people it&#8217;s like, hey you know, once somebody becomes a customer, then what would we say to them? So then it&#8217;s like, let&#8217;s talk about that ongoing relationship and the analogy I use a lot, it&#8217;s like think of the next door neighbor. So the new neighbor moves in next door. If you or I say since we have the same name, Hey, I&#8217;m Jason and then we don&#8217;t talk to him again for a year. And then we go over and say, Hey, I need to borrow your circular saws probably would be a pretty weird conversation, because they&#8217;re going to be like, bro, I don&#8217;t know you. Like, I don&#8217;t know you, but if we talk once a week and I give stuff to the relationship and you take stuff and we build a relationship, know who we&#8217;re dealing with, if one of us has that need it&#8217;s a lot less awkward. It&#8217;s much more reasonable to consider, you know, my guard is down, your guard is down. So the relationship building is really what marketing is and email marketing watch you do that very, very well. <\/p>\r\n<p><b>Jason Yormark:<\/b> So as a business owner, I&#8217;d come to you, [08:58 inaudible] do this outside of a site developer. So I’ve got my emails, I’ve got them all written out. What else do I have to do? Like, is there anything else aside from obviously if somebody responds favorably and wants more information, that&#8217;s a given, but is there any other tasks or responsibilities that still fall on a client to be able to ensure that it&#8217;s successful?<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah. So a lot of people will have this idea once they automate everything I&#8217;m done. But I push people to do is like automation is great. I&#8217;m the biggest fan, but I&#8217;m going to push you to also have like a weekly manual email strategy as well. And the reason why is if you make 52 emails that are all automated once a week for a year, it&#8217;s not going to be the same feel as if you&#8217;re actually writing about things that are changing in your business in the world in real time. So I push people to say your best bet is a mix of automation and manual stuff. So let&#8217;s keep this going. Let&#8217;s interpret the data, let&#8217;s adjust where we need to. It&#8217;s always changing. It&#8217;s always evolving. You know, this time, last year, nobody was worried about COVID and the year got weird for a lot of people, you know, at the end of March. So things can change very, very quickly around us. So it just is a, it&#8217;s more relevant, more real when you share stuff that&#8217;s really going on.  <\/p>\r\n<p><b>Jason Yormark:<\/b> Yeah. And I really, the timing of this conversation could have been better. I just kind of got out of, we are having an agency mastermind group and they were talking about the importance of, you know, not like the importance of staying in touch with the your nose, the people that you maybe you&#8217;ve pitched or ultimately said no to you, for whatever reason, like continuing to communicate with them. And we had agency owners that said they, they send something out either once a week or every other week. And my immediate thought was like, I&#8217;m like, really? Because like, for me, I&#8217;m just like, there&#8217;s so much noise and so many messages. And I just couldn&#8217;t imagine, you know, all of the people that have, you know, the folks that have said no to us or that we didn&#8217;t end up working with to continue to send them something that often, my immediate reaction to that was that seems like a lot. Like, we have like a MailChimp account and I’ve been collecting emails and we haven&#8217;t taken it that seriously. And we just started now to kind of put together like a monthly newsletter and it&#8217;s not probably on point, the numbers are horrible on it. I have to do better. We have to figure out a better strategy for that, but I&#8217;m just kind of curious what your take is in terms of like, in a scenario like that, what is the right frequency of, in terms of how many you should send out that ensures that it&#8217;s not going to be received negatively, I guess? <\/p>\r\n<p><b>Jason Wright:<\/b> Yeah. That&#8217;s a great question. And the truth is I can&#8217;t ensure it&#8217;s not going to be received negatively. The reason why is everybody&#8217;s different. You know, I’ve got people that will email me three times a week and I don&#8217;t care how much I like it. I&#8217;m going to get annoyed with that eventually and you&#8217;re gone. Other people that I want to hear from once a week and only hear from them every two months. And it&#8217;s frustrating actually. So what I tell people is if your personality, if once a week feels right to you and it doesn&#8217;t feel forced, go with it. If it&#8217;s, you know, twice a month, go with it. And what I tell people is, I use this concept called the five buckets, right? So I’ve got my business, I’ve got this virtual Venn diagram in my head. What are five areas around the business that we can speak of, not only on our podcasts, with our social media or blog content, even on the email, what can we speak about that still true to our brand, but it&#8217;s not the same thing every week. You know, for me as an example, it might be motivation, right? It might be digital marketing from a high level. It might be sales funnels. It might be you know I&#8217;m just trying to think, leadership. If we were to mix it up, we can just mix it up. And I&#8217;m a big fan of conversational email writing. The way you speak, it&#8217;s way more engaging. It&#8217;s way more real. Is it for everybody? No, no one is going to keep everybody in their list, but the numbers are consistent. And what&#8217;s funny is I was telling somebody this week, touch points make sales. So what I mean is I’ve seen it time and time again. It&#8217;s data-driven, it&#8217;s not me making an upper guessing where I’ve pitched somebody for something, they&#8217;ve stayed on the email list. I see them engaging them stuff. And we&#8217;ve got engagement [13:13 inaudible] all this stuff and you&#8217;ll see people rise up and I&#8217;m like, that&#8217;s interesting. I remember that guy. He didn&#8217;t buy me and he&#8217;s consuming everything, really interesting. He&#8217;s opening everything, he&#8217;s clicking stuff. And then eventually, sometimes people will jump into a different program and they&#8217;ll respond to an email that had nothing to do with anything he ever talked about. He just remembered us because we&#8217;re touching him regularly. So the email doesn&#8217;t have to say, Hey, take this, you know, jump into this program. But he&#8217;s like, I remember who you are. Cause I keep seeing it. And I keep, you&#8217;re staying in front of me. So touch points make sales. It&#8217;s an interesting thing. But some of my emails are pure entertainment. Whatever reason people love it when you&#8217;re like, you&#8217;re not going to believe this massive failure I had. People are sick. They love to hear about your failures, but it humanizes you. Same thing with Facebook lives being authentic with that is great. So for me, it&#8217;s one of my favorite things to do in the week. I really love sending out the email. It&#8217;s a lot of fun. <\/p>\r\n<p><b>Jason Yormark:<\/b> That&#8217;s a great point. And I haven&#8217;t thought about our email strategy the right way like that. Like with this podcast, I just part of why I enjoy it is just, I don&#8217;t feel like I filter anything. I just, you know, I get on a microphone, I get you on the show and we just talk about shit, you know? And it&#8217;s very natural, authentic, and I&#8217;m like, I really need to do that with the emails that I send out. Because it&#8217;ll probably improve open rates and people actually wanting to pay attention to it. And on that note, now I know a little bit about this. I dug deep learning about email deliverability and what affects open rates and things of that nature. And there&#8217;s actually, I mean, a lot that goes into it. So even though I might know a few of these things I kind of want to reiterate that with you to kind of get your take on, you know, what are some of the things that people need to be thinking about to increase the likelihood of not only people opening or looking at your email, but it actually ending up in their inbox versus spam folder.<\/p>\r\n<p><b>Jason Wright:<\/b> It&#8217;s funny, you&#8217;re asking me that, I was just having that talk with a client about an hour ago and deliverability is a bit like the Facebook algorithm, right? There&#8217;s some things we know, there&#8217;s a whole bunch of mystery to it as well. So the things that you can do well, so like if you switch over from like a MailChimp to an active campaigner, one platform to another, there&#8217;s always a period where you have to reestablish your reputation. So you&#8217;re always going to see a bit of a dip when you switch over. And a lot of people don&#8217;t know that. So sending frequent emails to smaller groups of people, you know, there is a way to get that back up. But sending good content is always the key, active campaign and I don&#8217;t know if other people do this or not, but it has a little filter. And if it sees spammy language, it&#8217;ll actually flag it and say don&#8217;t send this until you correct it, because this is going to get flagged as spam. It&#8217;s not going to make it to where you want it to go. You know, sending regular content is really important. Don&#8217;t do bait and switch type stuff. You know, click baity headlines, I mean people will just light you up with spam complaints. So regular content stick with it, deliver value is some of the best stuff you can do. Don&#8217;t buy lists. Buying lists is a horrible idea. Row them the right way. People opting in your stuff, purchasing your stuff, giving you permission in some ways, it is really the only way to do it. If people come to me and say, Hey, I have a big list I bought. I&#8217;m like, I&#8217;m not the guy to work with you cause it&#8217;s not going to end well. <\/p>\r\n<p><b>Jason Yormark:<\/b> I can attest to that. We&#8217;ve pretty much abandoned any sort of cold outreach when it comes to contacting anybody that hasn&#8217;t asked to be contacted. It&#8217;s just to your point, I mean, it&#8217;s just, I mean the amount of time and effort and just, it&#8217;s just a slog and it&#8217;s just not worth it. You&#8217;re much more likely, it&#8217;s just much more successful to just warm outreach, people that you&#8217;ve had conversations with relationships with and then just nurturing them over time. I mean, that&#8217;s definitely the approach that we&#8217;ve taken, and I mean, the other thing is, you know, we&#8217;ve starting to design, you know, landing pages that provide value. Like we&#8217;re working on a social media scorecard so that we&#8217;re getting a ton of traffic to our website. So people come and they want this scorecard. They give us their contact information to get that. That&#8217;s how, you know, that&#8217;s what you want to be doing to build a list. So I think that&#8217;s certainly part of it some of for us. So as part of what you do, kind of providing that filter for people to kind of ensure that they&#8217;re at least from a technology standpoint and from a content standpoint, that deliverability is going to be higher than it might if somebody is going to just trying to wing it. <\/p>\r\n<p><b>Jason Wright:<\/b> Because a lot of times people want to take shortcuts, right? They want to get it done quick. And when they do that, they&#8217;re setting yourself up for failure. So I&#8217;m a nice guy, but I&#8217;m very direct. I can say, Hey, Jason, I hear you, but it&#8217;s a horrible idea. You want to make horrible decisions in your business have fun, but it&#8217;s stupid. So, and I&#8217;m doing that trying to protect their best interest. And most people listen, you always have people that want to do their own thing, but yeah, absolutely. I actually had a conversation with a new client this week and he&#8217;s in the real estate investment space. When you start talking about investment and low-risk and stuff in emails that gets the attention of those spam filters. I said, Hey, we need to find some synonyms for this word [18:26 inaudible]. It doesn&#8217;t seem like it&#8217;s that bad. It&#8217;s says it&#8217;s only 0.1 on the risk scale. And I&#8217;m like being on the risk scale. It&#8217;s like giving a baby a teaspoon of poison, sort of a glass. It&#8217;s still a bad idea. So why not just make the effort and find a different word? Like, why are we going to flirt with danger? It&#8217;s literally a high risk zero reward scenario, which makes no sense. <\/p>\r\n<p><b>Jason Yormark:<\/b> If I&#8217;m a business or an agency. And I know that this is something I want to do. I know it&#8217;s something that I need help with. What are some recommendations that you would make for that business owner agency owner, like how to best prepare to work with an outfit like yours? Like what are some of the things that need to be thinking about or develop to kind of come into a relationship with you ready to really take advantage of what you guys are able to do?<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah. That&#8217;s a good question. Some things that make us different, I try to speak to people in language they understand. I mean, you&#8217;ve heard it. People try to use technobabble and it&#8217;s just a big turnoff. So that&#8217;s one big thing. But knowing your customer journey is real important, the way I would define that is once somebody discovers your brand, then what happens right? Once they get on your email list, then what happens? What&#8217;s the process between that and the sale. And it&#8217;s usually you can outline it from a high level in three to five steps. And a lot of people surprisingly, even really successful people have never thought about it. I had a person say, well, we&#8217;ll get back to you in six weeks on that. I was like, we should be able to knock this out in 10 minutes. Like what are you talking about here? So understanding that, knowing who they serve is real important. Having an open mind is another big thing. Cause a lot of people want to go corporate type, talk with their stuff and I&#8217;m like, nobody wants to read that crap. Do you like doing that? And they&#8217;re always like, no. So giving people permission to be their self is a little scary for some people. But it works and it&#8217;s effective for sure. <\/p>\r\n<p><b>Jason Yormark:<\/b> Got it. You had mentioned that active campaign is the technology that you guys use. What makes them, I&#8217;m like a, I love, I&#8217;m a gadget guy, technology. I just like the, like the shiny new thing, like I just kind of playing around with stuff and figuring out stuff. So what makes that a platform of choice for you? Like what makes them different, unique versus some of the other options that are out there?<\/p>\r\n<p><b>Jason Wright:<\/b> The big thing for me when I got involved with them about four years ago was their automation builder specifically is a visual. So when you look at it, you start at the top and there&#8217;s a trigger and you see how people get in the automation and you can make sense of what should be happening. You know, you look at some of the other ones and it&#8217;s more text-based and it just doesn&#8217;t resonate with somebody who&#8217;s as visual as I am. So with me, as soon as I saw that I was like, oh my God, this is like the way my mind works. So it really makes it easy for me to understand. And it makes it easy for me to understand to clients as well. I use screen-share videos a lot in my business to answer questions and train and things like that. And it&#8217;s been really effective, but it&#8217;s a very powerful platform, it is very user-friendly as well. So you can use it for very basic stuff, and you can do really, really crazy stuff with it as well. Most people don&#8217;t have that need for crazy stuff. They just need the foundational stuff. Let&#8217;s get a lead magnet, let&#8217;s get a welcome sequence. Let&#8217;s get a plan for weekly emails, that right there will change your business. Let&#8217;s integrate it with a pipeline. That&#8217;s stuff that if everybody&#8217;s everybody did, they&#8217;d make more money. So yeah, it&#8217;s been an industry leader. It&#8217;s grown, I&#8217;m involved in a bunch of their programs and just really like it. I like the company and it&#8217;s served me and a bunch of my clients as well. <\/p>\r\n<p><b>Jason Yormark:<\/b> Got it. So I want to kind of dig in a little bit more about kind of you kind of referred. I mean, it sounds like your business is kind of like a hybrid agency product kind of offering. Certainly, service-based. But just tell me about your journey. Like what are some of the things that if you kind of look back to when you started this, like, how have you gotten to where you&#8217;re at and what are some of the key learnings that you&#8217;ve had or things that you would have done differently knowing what you know now?<\/p>\r\n<p><b>Jason Wright:<\/b> Yeah. The one big thing I would have done differently as day one, I would have focused on building an audience, you know, wherever that may be, email list, Facebook group, pick something, you know, if you hate video Tik Tok is probably not a good platform for you or YouTube or anything else. So the audience building, I would have started right away. I used to drive myself crazy, trying to figure out, you know, who&#8217;s my niche, who&#8217;s my dream client. And you have to, in the beginning, just work with enough people to figure it out. You can&#8217;t always say, this is who I&#8217;m going to work with and it&#8217;s going to work because it doesn&#8217;t work a lot of times. I&#8217;ve talked to so many people, like I only work with funnel building for real estate people. I&#8217;m like, Oh, how&#8217;s that going? They&#8217;re like, I’ve never had a client. And I&#8217;m like, well, why are you saying that? Well, I have to pick a niche. Well, why don&#8217;t you let the niche reveal itself to you over time? And then they argue with me and I&#8217;m like, remember you&#8217;ve made no money, but like do what you want. So you know, I’ve evolved. I used to do broad digital marketing. If there was an opportunity in that space, I&#8217;m in. Over time, I’ve realized I want to do paid ads for clients anymore. You know, I don&#8217;t want to work with MailChimp. I don&#8217;t want to work with chatbots anymore. I just want to, it just niched down over time because there&#8217;s enough of a need for all this stuff. Even with what you do, that, if you want to just do what you enjoy and you want to become super specialized, you can do that. And it works. So it&#8217;s been kind of a journey. Intentionally inspirational was originally just a blog. I was teaching, I was talking about quitting the nine to five and starting my own business. And I hadn&#8217;t even done so successfully. I kind of felt like an imposter, but I was like, if I keep focusing on this it&#8217;ll happen someday. And it took two quits from corporate America to happen. But I finally got going. <\/p>\r\n<p><b>Jason Yormark:<\/b> No, I can relate to that. So right now you&#8217;re not really niched in terms of industry, your path was more, I&#8217;m going to specialize in a particular facet of marketing and just focusing on that. <\/p>\r\n<p><b>Jason Wright:<\/b> Yup, absolutely. <\/p>\r\n<p><b>Jason Yormark:<\/b> Yeah. Cause I mean, that&#8217;s the thought that I’ve had, like, in terms of what we like when I came into doing my own thing, I was like, okay, well, are we just going to be social media or are we going to be a generalist agency? And ultimately, I decided on social media because I thought, you know, it&#8217;s competitive. Like marketers are a dime or a dozen, it&#8217;s just super competitive. And I figure if I just kind of picked a facet of marketing, not to mention I was, had experienced a lot in that space. But that&#8217;s, to this day I&#8217;m still questioning is that enough? You know, are we going to ultimately need to kind of zero in on and too much to your point, right? It&#8217;s like the niche finds you versus the other way around, like, I don&#8217;t want to make, I don&#8217;t want to force a move. Like, just because we have experienced with one or two clients in a particular space doesn&#8217;t mean, okay, well let&#8217;s make that leap. I think that&#8217;s what I struggle with is, it hasn&#8217;t revealed itself. Like, yeah. I mean, I&#8217;m super passionate about film and entertainment and I’ve been told, pick something that you&#8217;re passionate about, there&#8217;s money in everything. And we&#8217;ve thought about, maybe we should focus on that, but, you know, until you have enough of that work to really have a foundation, then it&#8217;s like, it just feels like you&#8217;re just making that choice just to make it. So it&#8217;s interesting to hear someone like yourself, who&#8217;s kind of ultimately gone down a similar path of just picking a lane in the marketing sphere and finding success with that.<\/p>\r\n<p><b>Jason Wright:<\/b> What&#8217;s funny is when I was part-time my last job in corporate was those in the mortgage industry. And I would go into these companies and say, Hey, I&#8217;m building a business. And as soon as I can leave, I&#8217;m leaving. Like I&#8217;m not lying to you. And they are going to hire me anyway, you know, higher turnover type industry. And I can remember it was February, into February, beginning of March. And I had made like $3,000 or $4,000  part-time for myself for the month. And I&#8217;m starting to do this every month. Like, this is great. And I was making like $200 or $300 for the month of [26:24 inaudible], which was awful and I&#8217;m spending all my time there and all the time driving back and forth. And my wife who&#8217;s not an entrepreneur is like, hey why don&#8217;t you quit your job? And I was like,  and she&#8217;s like, let&#8217;s see what you can do full-Time, I’ve seen enough to know that you&#8217;re not going to stop. Like, let&#8217;s just turn you loose and see what happens. And that was three years ago in March. So we&#8217;ve been full-time almost three years of the business, but it&#8217;s been great. But when I started click funnels was so important to my business. Like every month I was like, where&#8217;s the click funnels [26:55 inaudible] more money. Then what&#8217;s happened over time is click funnels works much less. It&#8217;s usually a custom funnel builder, which is a high ticket bill, but active campaign is absolutely our bread and butter. They will not in the business tomorrow, we’d have to go straight up marketing strategy. Like, I mean, it would put us into a little bit of a recovery mode, but we&#8217;d recover. So what&#8217;s funny about all this is when I got started, I mastered marketing architecture fairly quickly. I can build the machine. I became very good at it, but I didn&#8217;t really understand marketing strategy. So after I was around it enough and saw enough successful companies, cause people say, Hey, we&#8217;re already making a ton of money, help us optimize this. I start to see the trends and I go, okay, I&#8217;m starting to figure this out. So the strategy came later, but I realized strategy&#8217;s really where the big money&#8217;s at. So, but having the understanding of both sides is great.<\/p>\r\n<p><b>Jason Yormark:<\/b> No, I love that part about your wife. Mine wasn&#8217;t quite that open to my leap into doing my own thing. But and I’ve said on this podcast time and time again, the minute that I, I’ve always looked for stability in my career, in my life, I got to have that paycheck. I got to have the benefits. If I don&#8217;t have that, like where I&#8217;m just this like just floating and you don&#8217;t know what&#8217;s going to happen and the uncertainty, but the reality is as I started to look at, you know, people on LinkedIn and their marketing, like marketing people, I&#8217;m like, man, cause I jumped, I had a lot of different jobs with my career. Not because I got fired, but just because all kinds of circumstances, but I started to learn that the marketing is a pretty volatile career path. And that stability that I was always looking for was actually doing my own thing because I was wired in a way, like, I don&#8217;t want to report to somebody. I want to build something. I want every day to be a little bit different. And the minute that that clicked, and I went all in that was when things took off because I wasn&#8217;t held back by fear. And that&#8217;s kind of the biggest entrepreneurial lesson that I learned is that once you&#8217;re able to kind of go all in a hundred percent mentally, that&#8217;s when things take off for you. And even though maybe my wife didn&#8217;t want me to make that leap, I think one of the proudest moments for me, it was like, everybody&#8217;s different. That threshold that you cross when you know, you&#8217;ve made it and there&#8217;s no turning back and you live, you have that stability. And then when I&#8217;m able to have that with her and then have her be completely on board with that, like to me, that was like the biggest achievement yet. So I can totally relate to that.<\/p>\r\n<p><b>Jason Wright:<\/b> No, it&#8217;s cool. Something you&#8217;ve mentioned that I really love and it&#8217;s a little off topic, but not really, intentionally inspirational is an interesting brand because it&#8217;s not just about marketing. It&#8217;s about that mindset. It&#8217;s about that, It&#8217;s about the motivation and all that. But fear to me is very interesting. Actually I love fear. Fear is one of my favorite things in the world, because you don&#8217;t really know who you are until you are backed against a wall and it&#8217;s absolute fight or flight.  As an entrepreneur, when I figured out, I could use fear for fuel and start fighting like hell, stuff started to happen. When I like, I was telling my wife the other day, I was like, man, so like our business, this business here is four or five different income streams. And I said, man, our project business right now is really slow, which is weird for this time of year. But I was like the agency, which is just a piece of the business that&#8217;s doing fine. Passive income is growing, and I was like, you know, what am I going to do about that project thing? So I had this conversation with myself. I&#8217;m going to make some stuff happen. And just since I had that shift a day or two ago, I’ve already got some conversations going to excite me. So fear is like, there&#8217;s no quit in me. Like it&#8217;s gone, if there was ever there, it is gone. Because the scariest thought in the world, like you said, is having to report to somebody. I hate people telling me what to do, because I&#8217;m always like, how about no, you know, the more people tell me what to do, the more I rebel, but it&#8217;s like the thought of one income stream is terrifying, to think that I was raised and say, this is what you want to do, it doesn&#8217;t even make sense. And I program my kids with it. I&#8217;m like, do whatever you want, but don&#8217;t have one stream. That&#8217;s nuts. How would you do that? <\/p>\r\n<p><b>Jason Yormark:<\/b> No, I agree. And I just, I always remember you know, just throughout my entire career and having marketing roles at different companies, just, I’ve always been a doer. Like I just want to get shit done. And it felt like everywhere I was at, too many things got in the way of getting things done that didn&#8217;t need to. Too many meetings or too many layers of decision-making. And it was always just like the most frustrating thing to me. And just so to be able to be thrust into an environment where you are in control of what gets done, I think is an awesomely, powerful place to be, right? The sense of accomplishment. And just knowing that you don&#8217;t have to deal with that. And then to build an organization that enforces those principles. Now I have a team of, you know, eight or nine people. And just to see my vision kind of permeate in that way and to see us do it differently and to make that work, it&#8217;s like the best thing in the world.<\/p>\r\n<p><b>Jason Wright:<\/b> That&#8217;s awesome. Most people never even get to the point where they bring on a VA because they&#8217;re control freaks. They can&#8217;t let go. Like I can&#8217;t grow. I&#8217;m like, why don&#8217;t you have somebody help take five hours of work off your plate? No, I can&#8217;t, I can&#8217;t do that. <\/p>\r\n<p><b>Jason Yormark:<\/b> To me time is money. Like to me, I am just thrilled to be able to be in control of where, when and what I do. And you can&#8217;t do that unless you trust people and pull people in to help you alleviate that. <\/p>\r\n<p><b>Jason Wright:<\/b> Great job by the way, eight or nine people. That&#8217;s no joke. That&#8217;s really, really good.<\/p>\r\n<p><br \/><b>Jason Yormark:<\/b> Yeah. It&#8217;s been nuts. I&#8217;ve invested in,  I mean, we&#8217;re a people powered business. So that&#8217;s another thing I learned, you know, you have to take some risks and invest in people that are kick ass. You know, it&#8217;s hard to find great people. And once you find them, you know, sometimes you have to invest a little bit into you know, maybe they&#8217;re not being fully utilized, but you know, you got to pull the trigger and bring them on board and kind of let the workload grow from that.<\/p>\r\n<p><b>Jason Wright:<\/b> You said something that spoke to me just a minute ago, you said how frustrated you would get, just want to get something done. And then people want to like artificially slow it down makes me crazy. I&#8217;m all about imperfect forward progress daily. You know what I mean? I may you know, break a window, knock a wall down, but I still moved forward three feet and then maybe tomorrow get knocked back five. But the mentality as an entrepreneur will serve you well and perfect forward progress is so important.<\/p>\r\n<p><b>Jason Yormark:<\/b> It&#8217;s funny. So one of my great best career experiences was definitely Microsoft. I actually moved to Seattle for that and I have nothing but fond memories there, but I mean, I kid you not there, you would have meetings scheduled to discuss future meetings. I mean, it was that, I mean, there was just so much of that and I just, and half the time you&#8217;re just in there, like, what are we doing? And it&#8217;s just, I just always remember being frustrated by that. So if anything now, like we have so few meetings, which is great. Like they all serve a purpose and every minute matters and it&#8217;s just an awesome environment to be in. <\/p>\r\n<p><b>Jason Wright:<\/b> That&#8217;s what I love, like loom videos, where you can make one video, repurpose it to everybody in the team and they can get back to you if they need to type of thing. We use Slack and loom videos a whole bunch, you know, if we should have to jump on a call, it&#8217;s usually like a zoom or it&#8217;s a Slack call, it is not very often at all, but if we have to, we will, but I avoided all calls just for that time suck. I mean, you&#8217;ll look up and be like, man, I just blew 90 minutes and could&#8217;ve just shot an email and handled this, you know. <\/p>\r\n<p><b>Jason Yormark:<\/b> Well, Slack is one of my favorite pieces of technology. We just everything about it just keeps us connected and efficient. And why didn&#8217;t I think of that? 10 years ago or wherever. You think that I could have seen that coming. So awesome, well, just a couple more things. So, you know, I told you, I&#8217;m kind of like a huge technology nerd and I always ask everybody this for my own selfish reasons, but what&#8217;s a piece of technology and app, a tool, a website, a book, a movie, I don&#8217;t know, something that&#8217;s just jumped off the page for you in the past couple of weeks that you just thought was awesome or something that you use religiously.<\/p>\r\n<p><b>Jason Wright:<\/b> That&#8217;s a tough question. Calendly, I&#8217;m a huge fan of Calendly. It&#8217;s amazing to me, how many people still don&#8217;t use any kind of scheduling software. So, you know, Calendly, if you don&#8217;t know, you can share your calendar with people and they can be in different time zones and you can book calls and it stops it back and forth, but they have a little automation system called workflows within Calendly. Very user-friendly when I get off new business calls and different types of calls, it&#8217;ll fire out a thank you email, you know, an hour later. And if somebody cancels a call, it texts me right away because sometimes you don&#8217;t get those emails. So the very inexpensive tool, the fancy plan, $15 a month. And if it was $59 a month, or even a $100 a month, I&#8217;d still buy it. It&#8217;s just a great tool.<\/p>\r\n<p><b>Jason Yormark:<\/b> Hopefully, they are not listening to that.<\/p>\r\n<p><b>Jason Wright:<\/b> I get a bill next month and I am like, what? <\/p>\r\n<p><b>Jason Yormark:<\/b> Oh well, did this to myself. <\/p>\r\n<p><b>Jason Wright:<\/b> But even like with the new business call, like I say, what is this call about? And there&#8217;s literally five specific options. They can pick more than one call and based on the lead source, which is the question before that and what they want to talk about. I already know exactly what to walk it into and it&#8217;s beautiful. And I actually use that new business call as a lead magnet. So you book a call with me in Calendly you&#8217;re in my email list, you&#8217;re in my welcome series, which is very interesting, but it&#8217;s been very, very effective as well<\/p>\r\n<p><b>Jason Yormark:<\/b> If you&#8217;re listening, if you take anything away from this  episode, Cal, I use it religiously much like yourself, I’ve got it plugged into everything and I can&#8217;t imagine working without it at this point. I mean, it is a phenomenal tool. So if  you don&#8217;t have calendar or meeting automation set up in your workflow immediately go check that out. And I don&#8217;t make anything off of that recommendation. It is that good. So I could not agree more, so awesome. Anything that I didn&#8217;t ask you that you want to share with the audience that you think might be helpful based on of what we talked about today?<\/p>\r\n<p><b>Jason Wright:<\/b> I&#8217;m just saying niche is kind of realizing the smell of life, but once you kind of understand the flow of a following, I’ll tell you this, most people have this completely backwards. So most people focus on traffic, right? It could be blogs, social media, etc., etc. Then they focus on website or landing page. And then we&#8217;ll get to that email thing later. You even said a little bit of that of yourself. I actually believe every entrepreneur in business should be doing it in exactly the opposite order. Okay. The email, the back end of your funnel, all the automation, is your foundation, do that first. So you have a plan what&#8217;s going to happen when people into your world or a call doesn&#8217;t go the way you wanted to. What&#8217;s that plan, then build the funnel, then focus on traffic. So it&#8217;s an interesting paradigm shift. Think about it. And if you actually make that your focus, I think it will change your business. <\/p>\r\n<p><br \/><b>Jason Yormark:<\/b> Awesome., I love it. So awesome, that&#8217;s great. Where can folks find you?<\/p>\r\n<p><br \/><b>ason Wright:<\/b> Yeah. My front porch is www.intentionallyinspirational.com. I&#8217;ll give you an idea of what we&#8217;re up to and we&#8217;ll go. <\/p>\r\n<p><b>Jason Yormark:<\/b> Awesome, well, Jason, thank you so much for being on the show today. I loved it. I learned some things which is always a good, a measure of an effective episode. So thank you so much for being on the show.<\/p>\r\n<p><b>Jason Wright:<\/b> Thanks for having me, man. I enjoyed it.<\/p>\r\n<p><b>Jason Yormark:<\/b> Awesome. And that does it for this episode of Socialistics, make sure you like share, subscribe, all that good stuff. We&#8217;ll catch you in the next episode of Socialistics social media agency stories. Thanks, bye.<\/p>\r\n<p>&nbsp;<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset. Learn more about Jason at https:\/\/www.intentionallyinspirational.com [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7799,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Marketing Automation Can Make or Break Your Agenc‪y‬ - Socialistics<\/title>\n<meta name=\"description\" content=\"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Marketing Automation Can Make or Break Your Agenc‪y‬ - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-04-06T13:24:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-07T12:37:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"36 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#webpage\",\"url\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/\",\"name\":\"How Marketing Automation Can Make or Break Your Agenc\\u202ay\\u202c - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#primaryimage\"},\"datePublished\":\"2021-04-06T13:24:35+00:00\",\"dateModified\":\"2021-04-07T12:37:21+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How Marketing Automation Can Make or Break Your Agenc\\u202ay\\u202c\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How Marketing Automation Can Make or Break Your Agenc‪y‬ - Socialistics","description":"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/","og_locale":"en_US","og_type":"article","og_title":"How Marketing Automation Can Make or Break Your Agenc‪y‬ - Socialistics","og_description":"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.","og_url":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-04-06T13:24:35+00:00","article_modified_time":"2021-04-07T12:37:21+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png","size":"full","id":7799,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"36 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-1.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#webpage","url":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/","name":"How Marketing Automation Can Make or Break Your Agenc‪y‬ - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#primaryimage"},"datePublished":"2021-04-06T13:24:35+00:00","dateModified":"2021-04-07T12:37:21+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"Today I sat down with Jason Wright from Intentionally Inspirational, a marketing automation agency and we discussed the power of email and marketing automation, and how it can transform your agency. From tools to strategies, and when to get help as well as more insights into the entrepreneurial mindset.","breadcrumb":{"@id":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How Marketing Automation Can Make or Break Your Agenc‪y‬"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7785"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7785"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7785\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7799"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7785"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7785"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7785"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}