{"id":7833,"date":"2021-04-19T08:55:06","date_gmt":"2021-04-19T15:55:06","guid":{"rendered":"https:\/\/socialistics.com\/how-to-integrate-social-selling-into-your-agency-copy\/"},"modified":"2021-04-22T11:16:23","modified_gmt":"2021-04-22T18:16:23","slug":"what-is-social-selling-and-how-to-use-it-effectively","status":"publish","type":"post","link":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/","title":{"rendered":"What Is Social Selling And How To Use It Effectively"},"content":{"rendered":"\r\n<p>Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.<\/p>\r\n<p>Learn more about Ian at <a href=\"http:\/\/www.intentionallyinspirational.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.linkedin.com\/in\/ianmoyse\/<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<p>&nbsp;<\/p>\r\n<div id=\"buzzsprout-player-8330222\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8330222-what-is-social-selling-and-how-to-use-it-effectively.js?container_id=buzzsprout-player-8330222&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><b>Jason Yormark:<\/b> Hello, and welcome to another episode of the Socialistics social media agencies. I&#8217;m sorry, social media agency stories podcast. You think after 20 times I&#8217;d get that right, but Hey, I slip once in a while, but glad to be here with another episode. Real thrilled with our guests today. He has got some interesting stuff. We&#8217;re going to talk about social sales stuff. So excited about that. I have some experience with that and I&#8217;m excited to kind of hear his experiences and how they might translate to what I’ve experienced. So welcome to the show Ian Moyse, he is the chief revenue officer at one up sales. Welcome to the show. And why don&#8217;t we just kind of jump right in and tell me a little bit about who you are, what you do and where you&#8217;re at.<\/p>\r\n<p><b>Ian Moyse:<\/b> Thank you very much, Jason. Yep. So simple terms, sales leader been in the sales tech industry for many, many years from  originally being inside sales and field sales and leading sales teams. Very hands-on, enjoy being with customers and hearing what&#8217;s really going on and how the buyer dynamic has changed, which I&#8217;m sure we&#8217;ll talk about based on the subject you introduced with and enjoying the new world that we all face, where sales and the customer experience has changed, and we do a lot of video interaction and talk to them in a different manner, in a different place.<\/p>\r\n<p><b>Jason Yormark:<\/b> Gotcha. So how did you, tell me a little bit more about kind of where you started and how you kind of, you know, gravitated towards where you&#8217;re at today? What did that journey look like for you?<\/p>\r\n<p><b>Ian Moyse:<\/b> Sure. So, I started off as a techie. I was a programmer IBM. And in those days, I saw salespeople who had the company car, had the mobile phone, which was the size of a suitcase, but they had the perks. And I thought, well, I know what I&#8217;m talking about. So how hard could it be, passionate about computing, but I was enthusiastic and ambitious. So I left IBM for a smaller company that was distributing Novell NetWare if anyone remembers that it was at one time, the number one networking product on the planet. And it was a small team, and I was supporting as inside sales, three salespeople. And the great thing was I learned on the ground. It was the traditional pad of paper, phone, pen, price book off, you go figure it out as you go make a lot of mistakes, learn the hard way. But I learned by plagiarizing the good that I saw in the three salespeople I supported. And within a year I was promoted to have my own patch, field sales. And again, then right now I have to learn something else. How&#8217;d you do this? What do I do here? How do I own my own micro business within a business, so to speak. And over the years, I’ve worked in different parts of the sales economy from resellers distribution and direct sales in a number of technologies, and ended up about 15 years ago, moving into cloud computing, which today powers an immense amount of what we all use on mobile phones. The web conferencing we&#8217;re using today, the applications and really with COVID is experiencing an explosive growth because it&#8217;s what supports us able to do what we do in a remote environment as effectively as we can. Go back 15 years, this would have been a very different working experience for many people.<\/p>\r\n<p><b>Jason Yormark:<\/b> Excellent. And so you&#8217;re at a company called one-up now. What do you guys specialize in? What&#8217;s kind of your guys&#8217; superpower. What is it that you do for clients?<\/p>\r\n<p><b>Ian Moyse:<\/b> Sure. So our superpowers as you put it, gamification. It is sales and motivation, enabling people to give their teams more visibility what&#8217;s going on. Simple view of all the data sources they&#8217;ve got in the business. So we pull data from CRMs, different data sources, phone systems, etc., and display it in a nice way, and then allow you to gamify it. So to gamify people to compete against themselves, for teams to compete against other teams and for individuals, if they wish to issue a challenge against a colleague, this week I am going to do more calls than you. I&#8217;m going to book more new appointments, this sort of thing, and challenge each other for what the prize would be. So it&#8217;s really motivational and giving managers and leaders and the business easy measurements of what&#8217;s really going on, which in a remote world is particularly important. Are your workers working productively at home and how are they comparing to each other&#8217;s performance? <\/p>\r\n<p><b>Jason Yormark:<\/b> No, that&#8217;s interesting. I haven&#8217;t seen kind of a gamification of social sales, so that&#8217;s kind of interesting. So have you guys develop your own platform or software that facilitates that experience? I&#8217;m kind of curious how it works.<\/p>\r\n<p><b>Ian Moyse:<\/b> Yeah. It&#8217;s our own tech. And what we do is we take data from third party sources. So for example, in the recruitment sector, they will often use proprietary recruitment platforms and CRMs and phone systems. And we will suck the data out of their different systems and or spreadsheets, you know, some people are running bits of their business on data, on spreadsheets. We will take the data feeds. And then once it&#8217;s in our system in real time, you can then decide, how has it metricized? What points do you allocate to different things? Or how do you want it displayed? And how do you want to compare things? So it sounds simple, but you got to think of complexity such as here&#8217;s a team of 10 people, and here&#8217;s a team of five. You can&#8217;t put them against each other equally. So we handle the metrics that will equalize those teams out. So you can put different size teams against each other in a fair manner, but it&#8217;s all about behave, driving the correct behavior, the right activities. You want people maximizing their activity, maximizing their effort on the activity that matters and learning from their colleagues. You know, what&#8217;s working, what&#8217;s the number one, number two seller in the business doing. What activities they&#8217;re spending their time on. It gives that transparency for the others to see that rather than try and dig through complex data in a CRM and try and figure out well, what they&#8217;re doing, you can see it right in front of you every day, what behavior they&#8217;re taking and try and mimic.<\/p>\r\n<p><b>Jason Yormark:<\/b> I like that. Let&#8217;s actually, let&#8217;s take a step back. I should have asked this question first. Now I know the answer to this question, but I want to get your uninfluenced answer to it. For those that are listening, cause you know, we come across clients that don&#8217;t have any idea what social sell sales means or what that is. And so I&#8217;m going to ask you for the purpose of folks that might be listening that maybe don&#8217;t know what that is, what is social selling?<\/p>\r\n<p><b>Ian Moyse:<\/b> So the first thing is social selling is the wrong name, in my opinion, having been involved with this for years, because what it implies and often, I talk to sales leaders and speak at events, etc., and people have this concept, oh, my product couldn&#8217;t sell it over social. It&#8217;s not about selling your product over social. The real definition in my view, it&#8217;s using social media platforms as a way to create a real world engagement. And it&#8217;s a set of methodologies. It is not product, product support you&#8217;re doing this. So people often associate a direct correlation, social selling equal LinkedIn navigator. Now LinkedIn has done a good marketing job around that, but it&#8217;s not just about LinkedIn. It&#8217;s about all of the social platforms and the methodology you use to use the information that&#8217;s available to you and a way to engage with someone, to turn it into a real world conversation.<\/p>\r\n<p>Once you get it to a real world conversation, social selling to most of the degree has done its job. It&#8217;s got you to the point you needed to. Because as a buyer, we&#8217;ve all changed. As a buyer, we filter everything, right? If you get a call on your mobile, you look at the number who doesn&#8217;t do this. Look at the number and you&#8217;re making micro judgements of, do I want to pick that up? Do I want to let someone through the gate, do I let it go to voicemail and then decide to call them back? You know, is it from an area code I recognize, is it from a number I recognize? Oh it might all that. And we filter, we all do it. And there&#8217;s technologies that enable us to filter now and do that as well on the smartphones, etc., and on landlines and on your email and all the rest of it. So we hide behind things because I only want the conversation I want. So as a seller, you know, often people say to me, what does that mean? I shouldn&#8217;t pick up the phone. No, it doesn&#8217;t. If you can pick up the phone and get hold of someone or get ahold of someone quickly do it. But what do you do when you can? That&#8217;s where social selling comes in. What often I see leaders do is, we&#8217;ll keep calling them, call them three times the first day, and then leave a day. Then call them once. Then leave two days. And over the first two weeks, call them 15 times. Do you not think that recipient is going to recognize that number more and more particularly if you leave a voicemail that you filter even more [09:07 inaudible]. That&#8217;s that recruiter, that is that person trying to sell me SEO services. You start to filter more. So you&#8217;re putting more, you&#8217;re helping the customer put a bigger brick wall up, social selling however is not quick, right? That&#8217;s the problem. People want instant gratification. I want my salesperson to get hold of that suspect and do it this week. I don&#8217;t want to hear that in two months’ time they&#8217;ve got hold of them. Well, my answer is use a mix of techniques and methodologies, but the answer is you want to get hold of them though, right? You want to get a conversation at some point, or would you want your person to do lots of activity and never get hold of them? So social selling has its place. It does not replace existing sales scales. It sits at the front of the funnel, but it&#8217;s a tool, a methodology for helping you get engagement with someone that you otherwise wouldn&#8217;t. And if you&#8217;re good at it, you can get to people that other salespeople in your competition do not. Long answer to a short question<\/p>\r\n<p> <b>Jason Yormark:<\/b> No, that&#8217;s fantastic. I could not agree with you more with that. Couldn&#8217;t have said it better myself and you&#8217;re right. I mean, it&#8217;s interesting because I think when, you know, we do a handful of this for some of our clients want to make sense, and then they&#8217;re in a position to accept the realistic expectations of what those efforts mean over an extended period of time. But it really is about you have to, I mean, we all have filters put up, like I don&#8217;t, I&#8217;m practically to the point where I won&#8217;t even answer my phone if I don&#8217;t recognize the number and you&#8217;re absolutely right. Hammering people with phone calls over and over again is counterproductive. That&#8217;s like you said, you&#8217;re putting up a bigger wall between you and that prospect. And the fact of the matter is, you know, and this is my personal opinion when I&#8217;m having conversations with potential clients around social sales is that it&#8217;s a volume-based game. You have to be good at it. And you have to understand that you&#8217;re going to get predominantly ignored and you&#8217;re going to get lots of Nos, but there&#8217;s some Yeses in there and it&#8217;s all about great messaging. It&#8217;s all about timing. Like even my LinkedIn inbox, it is noise. There&#8217;s so much going on there. I ignore it. I ignore it. But every once in a while, somebody writes something really well that&#8217;s jumps off the page for me and or their timing was just good. I was looking for that. Or I’ve been thinking about that thing. And the fact of the matter is you don&#8217;t know, you can&#8217;t predict that. So it&#8217;s just a sum of doing all of these things over an extended period of time that&#8217;s going to build some sort of marketing engine or sales engine for you that&#8217;s going to produce results over time. So I think that I can totally relate to where you&#8217;re getting from on that.<\/p>\r\n<p><b>Ian Moyse:<\/b> But let me give you an example of the biggest mistake I think people make with that. And tell me, I want to do this with audiences. I usually joke, or, you know, put your hands up if you get this. And if you don&#8217;t, it&#8217;s going to worry me that I&#8217;m the only one they&#8217;re targeting with this. You get a LinkedIn message, which will say they want to connect with you. They see value. I saw you did this. They might do the first bit [12:19 inaudible] and I saw you spoke at this event, or I saw you that blog you wrote, it was really good, and this is, so there&#8217;s a little bit of engagement and personalization, and it&#8217;d be great to connect with you, just, you know to follow your content. Yeah. It looks valid I’ll connect. Then start your little clock. How long before the next message comes, which is now you&#8217;ve connected you&#8217;ve just given me permission to give you my sales pitch. Thanks for that. And it&#8217;s not real world. I encourage people think about real world. What you&#8217;re doing is the equivalent of going to an event in the old world as we know it, where there&#8217;s sets presentations, etc., you&#8217;re getting your coffee in the morning and there&#8217;s someone stood next to you and you invoke chat. And you in for the seminar? Yeah. [13:05 inaudible] Oh my God, did you come on the public, did you get stuck on the track, bit of niceties, a bit of rapport building, you don&#8217;t then immediately that they start talking back to you and you&#8217;ve got a bit of reciprocation I.e., they turn towards you a little bit, and they&#8217;re glad to find someone to talk to because they don&#8217;t know anyone there. You don&#8217;t immediately go anyway, by the way, my name is Ian, and this is what we do. And let me give you my pitch. You just don&#8217;t do it. What you might do is chit chat about it as what you hear to see today, which sessions are you looking forward, then during the day you might bump into them again, cause you&#8217;ve got a bit rapport and you hunt each other. Oh, it feels familiarity. Chat a bit. At some point in the day, they may say to you, you know, what are you doing Ian? What&#8217;s your side? What do you do? Because it&#8217;s progressed a bit that the rapport is built through a number of engagements that they&#8217;ve opened the gate. That&#8217;s what you want to happen on social. For me, the perfect social selling is that you nurture that piece to the point where they ask you what you do, they ask you, Ian I’ve had people say, Ian we&#8217;ve been connected so long. I love your content. What is it you guys do? We should jump on a call at some point, just to check if there&#8217;s any synergy between us. I haven&#8217;t had to knock a wall down. It doesn&#8217;t feel rude, but it isn&#8217;t instantaneous. But if you go for the instantaneous, most times, do they not block you? And people say to me, yes. So why you do it? Why you do it repeatedly? What? Because your manager tells you, you&#8217;ve got to do so many a day, but you&#8217;re not getting the results. So do you want the results, or do you want the activity.<\/p>\r\n<p><b>Jason Yormark:<\/b> Yeah. That doesn&#8217;t work for, I mean, we&#8217;ve had situations where we&#8217;ve turned down business because we knew that an organization wasn&#8217;t ready for it, or they weren&#8217;t looking at it through the right lens or that they had unrealistic expectations about you know, dipping their toe into this sort of thing. So you&#8217;re absolutely right. It&#8217;s about building relationships and it&#8217;s about just you know, you don&#8217;t have to sell, you know, be authentic, have a conversation, learn about who it is that you&#8217;re talking about. And eventually it&#8217;s like you said, they&#8217;ll ask you what you do. You know, it&#8217;ll naturally get to that point and you can&#8217;t let you know sales quotas or numbers, you know dictate your strategy. I mean, ultimately, you have to play within the sandbox that you&#8217;re in. You know, there&#8217;s just certain ways that you need to do things for it to work. And if you don&#8217;t have the patience and the stamina to do it and see it through, well, then you&#8217;d better just kind of stick to your old world ways. But honestly, those are the businesses that are going to, you know, are going to die. That&#8217;s the ones that have that patients that are willing to put in the time to do this effectively. So on that note, when you&#8217;re, so it&#8217;s kind of like a two-part question or one question asked in two different ways, who&#8217;s your ideal client, who&#8217;s the ideal client that you work with and where do they need to be at? Or how do you ensure that they&#8217;re actually ready for this sort of thing?<\/p>\r\n<p><b>Ian Moyse:<\/b> Yeah, so, right now in the role, the ideal client is a mid-market not an enterprise customer with a sales team, you know, perhaps 10 to 50 people, you know, we&#8217;re going to move up the scale and we&#8217;ll do that. But at the moment, there&#8217;s such a wide area to go after. And we have a lot of recruitment customers. So, you know, I&#8217;m picking where do we need to focus. Because you can&#8217;t boil the ocean. I remember an old boss of mine always said to me, the one thing I’ll always remember he said was, don&#8217;t boil the ocean  pick where you are to play the battle where you can win most and go there. Cause there&#8217;s plenty of it out there. Don&#8217;t go scattergun and I&#8217;m using LinkedIn. I&#8217;m using LinkedIn navigator to filter down, to look at the scale, to target what is my profile target audience, but what I&#8217;m then doing is going, you should talk to me, you should talk to me, you should talk to me. You know, it&#8217;s partly creating good content, making sure that content gets in front of them as well and nurturing it and nurture by, so if you identify, pick a number for different people listening, if you identify look here&#8217;s 2000 key target people in my patch, my region, my vertical, whatever it be, you know, start nurturing that with them, start connecting, you know, make connections, see what connections you&#8217;ve got in your internal network that connected with them. Do your homework because often there&#8217;s you know, Joanne Black wrote a book no more cold calling and [17:38 inaudible] oh, well, you just don&#8217;t, it&#8217;s not about not doing cold calling. It&#8217;s about making it a warm call through having information that it doesn&#8217;t feel like a cold call. It is really, but you found a to get that interaction that doesn&#8217;t feel like a salesman, just going, I want to flog you something. So for me, it&#8217;s about targeting who you want to go after, identifying that target audience and what the profile is, the ideal profile doesn&#8217;t mean you can&#8217;t go outside it, but you&#8217;ve got to have, where&#8217;s your main focus, who is in that target universe and who do they listen to? Who are their  influences. Now that might be an association. For example, in the recruitment sector, there are lots of recruitment associations that they&#8217;re all want to be members of, great! Where&#8217;s the best place to get your content in front of those people. And to get that audience and people go for this, it&#8217;s directly. They just go for the direct approach. Well, there&#8217;s already people, your audience follows. There&#8217;ll be groups they&#8217;re in, there&#8217;ll be Twitter accounts, they&#8217;ll follow, etc., etc., etc. So one of the things I always look for is how do I get my message to the target audience? I&#8217;ve defined through people that they&#8217;re already listening to because they&#8217;re not listening to me. They don&#8217;t know me so I can shout loudly, but they&#8217;re going to walk by. But if someone they trust already shares that piece of content or gives them a voice or says you should speak to Ian, they&#8217;re more likely to do it, we all know right, if you call a friend and say yeah, can I talk to her? You know, the first thing I did when I joined was contact certain sales leaders who I know I’ve worked with in the past, and guess what? They will respond to me straight away, even though it&#8217;s about something new, because I’ve got a relationship, not rapport, I’ve got a relationship with them.  And I had one respond to me today saying it doesn&#8217;t fit with us because the decisions in the US, but here&#8217;s why it&#8217;s not. But I hope you didn&#8217;t mind me reaching, no, no problem at all, you&#8217;re doing the right thing. I&#8217;d expect you to do that. But I&#8217;m already past the point of, I&#8217;m just another one knocking on the door. It&#8217;s how do you get to that. Well, how do you come through the back door? Most salesman, try and knock on the front door. I want the neighbor to go and knock on the back door with me beside them going, you should talk to this guy. You shortcut the process and it works. It&#8217;s referral selling in whatever way it is, but it&#8217;s changed slightly today. And that we all have these wondrous tools where you can identify your way in, let me give you something on social selling, a phrase that I came up with a number of years ago. You want to be sure a lock, not Lestrade. What I mean by this, if you&#8217;ve read Sherlock Holmes, Lestrade will come into a murder scene. Lestrade of Scotland yard, and he will look at what&#8217;s there. And you&#8217;ll make a decision. This is what happened and who did it. Sherlock Holmes will invariably turn up a few minutes later and surmise the room and say, nah, totally different story. And here&#8217;s 20 things you didn&#8217;t spot, but they were all there for you to spot Lestrade, but you didn&#8217;t, you didn&#8217;t spot them and correlate them to the facts. In social selling you can do the same, right? And I often challenge people to do this. When I train slide material, I will show them here&#8217;s an example. Here&#8217;s a profile. Tell me what&#8217;s on that profile that&#8217;s going to help you as a sales individual, you can all see the same thing. And I can do this with a room full of people, you know, 50, a 100 people. And often not one of them will spot it until I click, and it highlights the particular bit. That&#8217;s on the screen still. And suddenly they all go, oh, what would you do now if I’ve highlighted that. And suddenly bang all the salespeople know exactly what to do. You&#8217;re blind to it. The clues are usually there in the information if you read it and it&#8217;s not just reading their headline, it&#8217;s who are they connected to that you&#8217;re connected to. Who do they follow? What groups are they members of? What content are they sharing? Whose content, where did they work before? Because you may  know someone who isn&#8217;t connected to them, but you may say, oh my God Sue used to work at that company. Well, I know he was there eight years. I bet he probably knew her, but if they&#8217;re not connected, which not everyone connects to everyone they ever work with, then ask, oh yeah, I knew him, but they weren&#8217;t connected. The clues are often there. People don&#8217;t do this. They have a quick look at the profile and they just want to get going and plow in and they don&#8217;t get the outcome they want. <\/p>\r\n<p><b>Jason Yormark:<\/b> You kind of, you started to answer this question that I wanted to ask, but again I want you to kind of expand on a bit more you know, a lot of, and I remember when I was at a previous agency in one of my main responsibilities was managing a social sales team for Microsoft and a big part of what we did was basically training and educating salespeople on how to leverage social media as part of their sales responsibilities, about what they would do on a day to day basis. And much of, like you said, they had no idea. From the perspective of a traditional sales person or somebody that has not gone down this path, in addition to what you&#8217;ve kind of already talked about, you know, research, you know, research is definitely one of them you know, what are the top two or three things that you would advise, you know, somebody that&#8217;s coming into this new, what can, like, what would, cause I would imagine a lot of the reservation is for old school salespeople is like, well, I don&#8217;t have time for this and I don&#8217;t want to do this. And this is the way that it&#8217;s been done. Like from their perspective, how would you help them understand what are they getting themselves into? Like what is their day, how&#8217;s their day going to look differently and how are they going to best prepare themselves to be successful in an environment like this? What are the top two or three pieces of advice that you would give someone like that to kind of at least start to position them to understand it and be successful with it? <\/p>\r\n<p><b>Ian Moyse:<\/b> Sure. So first is, it&#8217;s not an excuse for not selling. It doesn&#8217;t replace the phone email and in the normal world visits and all the rest of it, it doesn&#8217;t replace anything else. It&#8217;s just another tool in your kit bag. And it&#8217;s a methodology, not a product. So the platforms and products that can help you do this, and there&#8217;s a breadth of them as you get more and more into it, you&#8217;ll find more ways of using clever tools to help you. But it&#8217;s about having the skillset and a methodology and thinking of how you approach this. That&#8217;s the first thing. First job you do is make sure your profile looks good. You know, your personal brand is about do you come across to your target audience appropriately, professionally, and even down to the photo. Everyone talks about that, you know, your profile photos, but still how many people get it wrong? And they&#8217;ve got a jokey photo or photo of them at a party, whatever, it&#8217;s just, get it, the photo is the first impression. And first impressions count. We&#8217;re always taught that in sales and people make micro decisions as a human. They do, you can&#8217;t help it. And on social it&#8217;s like the MTV generation on steroids. You scroll through, everyone&#8217;s looking at things really quickly. You know, what you want is to be noticed firstly by a bit of  content or a message you&#8217;ve said, you want someone to notice you in a positive fashion. And if they invariably do, they will look at your profile. If you&#8217;re going to have a call or on a video call with five people, today, it&#8217;s even more heightened because you know, they&#8217;re sat in front of a PC all day. Cause where are they going? They don&#8217;t have any meetings. You know, we&#8217;re all sat at home. So there&#8217;s much more likelihood just before they jump on the call with you, even during the call with you, they&#8217;re not on a phone, [25:24 inaudible] on a video call, they could have your profile open. In the real world we used to know people would have sat in front of you in a meeting or would have been on a phone call in between meetings, busy and busy and might have intended to think about, but they didn&#8217;t even think about looking you up. Now they will because it&#8217;s so easy. I could do it while I&#8217;m talking to you right now. And you wouldn&#8217;t even know it with a camera on because I got another screen. And you think I&#8217;m looking at you and I&#8217;m looking at your LinkedIn profile. It&#8217;s just the world we&#8217;re in. So make sure your profile looks good. Plagiarize what other people do. By all means  take a look at my profile afterwards, I&#8217;m always holding it. I&#8217;m plagiarizing what I see other people do. I&#8217;m always looking at it and nurturing it. You know, it&#8217;s not just about buying the plant and stick it on your desk. It&#8217;s about watering it as well. You&#8217;ve got your profile for free. Now keep tuning it, too many people set it up five years ago and they&#8217;ve never touched it since. And the platforms have moved on where you can do neater things and make it, I&#8217;d look at it all the time. And I see someone&#8217;s telling me, there&#8217;s nothing wrong with plagiarizing and saying, oh, I didn&#8217;t know you could do that. My view is always to make it better and better and better. How do I make my profile stand out and in a professional manner and make myself look credible. That if anyone&#8217;s going to engage with me, sees a post I’ve made or a comment on their post and they click back to me, what&#8217;s there to make them think at least I&#8217;d engage with this guy, [26:51 inaudible] he&#8217;s got credibility. And that&#8217;s down to whether you&#8217;re a junior salesperson, inside salesperson or a senior person. It doesn&#8217;t matter. You all got the same access to the same platform. The only thing that&#8217;s different is your job title is how you use that platform. So spend time getting it right. The number of people I click on and they&#8217;ve got links, you know the links you can share in there, for example, or to a company, they worked out five years ago. It&#8217;s attention to detail. Well that takes 10 seconds to change. You&#8217;ve not even noticed it yourself. Now, I want people to come and I want to see that if I’ve engaged with someone&#8217;s content or with their tweet, I’ve retweeted it or I’ve liked it. Or I’ve put a comment on there. The perfect for me is to notice that they&#8217;ve come back, or they&#8217;ve liked a bit of my content or they followed me. And I’ve had many people over the years where I’ve used these methodologies to nurture, engaging with them where they&#8217;ve then followed me back. They then shared a piece of my content. You&#8217;re getting there now because they&#8217;ve chosen to do that. You push content their way, they might see it, or you can tag them in, but they didn&#8217;t make the choice. You did. That&#8217;s your sales agenda. The minute they engage back, they&#8217;re starting to open that door up. They&#8217;re starting to feel that, if they follow you back, they&#8217;ve already told you I see value in following your content. <\/p>\r\n<p><b>Jason Yormark:<\/b> One of the best pieces of advice I ever got from the one mentor I felt I ever had in my life and he said it was a really, really brief phrase. Everything speaks. He said, everything speaks, everything matters. And your picture, how you talk about yourself, everything tells a story and you&#8217;re absolutely right. People, sometimes you don&#8217;t even, it&#8217;s down to the point, down to the effect of where even when we&#8217;re running, when you&#8217;re running Facebook ads or you&#8217;re running AB tests, you know, one little color or this photo had two people and this one had three, people don&#8217;t even realize sometimes what influences the decisions that they make, and the littlest things can all influence that. So you definitely want to look through a lens of, am I presenting myself the way that I want to be, and that is authentic and is going to, position me as whatever it is that I need to do to influence those that I want to do that I want them to do. So I absolutely love that. I couldn&#8217;t agree more with that. So super interesting stuff around social selling. One of the questions I always ask all the guests that I have on out of selfish reasons is what&#8217;s a piece of technology, a book, something you&#8217;ve read, an article, a blog. What&#8217;s something that stands out over the past couple of weeks that you just can&#8217;t get enough of or has made a meaningful, a difference or impact in your life in some way.<\/p>\r\n<p><b>Ian Moyse:<\/b> So I&#8217;m purely going to pick. And I just reached to the shelf behind me, you know, and it&#8217;s a very valid question. Cause my opinion is, I’ve been in sales and sales leadership a long time. I&#8217;d always say, you&#8217;ve got to continue to learn and adapt, because the people around you and the environment is changing. This year has highlighted that, right? Because we&#8217;ve all had a major shifting change. And I learned from the young salespeople that work for me have been doing sales for a year. I always say to them, look, I’ve just been doing it longer. So I’ll have more experience, but you&#8217;ve had different experiences, where you will come up with things that maybe I haven&#8217;t thought of because you&#8217;ve got a clean, fresh look and you&#8217;ve been through a different journey than I’ve been through. So I can learn from you. But I&#8217;m always looking at new books and stuff and the new one I’ve got, key person of influence by Daniel Priestley. And I’ve started reading that. And whilst I do a lot in personal branding and all this stuff, there&#8217;s always nuggets of simple things you go, oh, I didn&#8217;t thought about that. Or it validates something that you are doing, but you&#8217;re not sure to keep doing it. So that&#8217;s the latest one I&#8217;m reading. The other good one to read is social selling by Tim Hughes. Tim&#8217;s become a friend of mine over the years. And I knew him just as he was launching that book. And that&#8217;s another good read and it&#8217;s not complex. It just, it bangs into your head the simplicity of what this is about. So those would be two I&#8217;d recommend to your listeners.<\/p>\r\n<p><b>Jason Yormark:<\/b> I love it. Well, that&#8217;s great. Anything that I didn&#8217;t ask or anything that you wanted to expand on that you think might be helpful for the audience to hear based on what we&#8217;ve kind of talked through today?<\/p>\r\n<p><b>Ian Moyse:<\/b> Sure. So one I’ll give you. Usually, what I say is, come and have a look at my profiles and I&#8217;m not professing to be perfect. I&#8217;m still learning. I&#8217;ve got an opinion, cause I’ve just done this for a long time. And I’ve self-taught this stuff before we had all the labels of personal branding and social selling. Because as a sales leader, I was just looking to, how do I remain successful? How do I face up to the challenges that every sales leader I speak to says, well, we don&#8217;t get enough leads and we&#8217;re trying, and it&#8217;s harder to get hold of a customer prospect and all that stuff. I was having the same thing. So I was trying to constantly look at what can I do different, because doing the same old, same old, isn&#8217;t getting the results it used to. So I need to change some things. And if you want to come look at my profiles, here&#8217;s an interesting personal branding. Hint, go to www.ianmoyse.co.uk or www.ianmoyse.cloud. And all you&#8217;re going to end up at is my LinkedIn and my Twitter profile. But what I haven&#8217;t just done is said go to LinkedIn, search for name. Cause imagine my name is John Smith. Good luck with that one. You know, my name happens to shortlist down quite quickly, but all I’ve done is registered domain few dollars a year, you know, easy to do, go and check in. And then I’ve just pointed it at the social posts. So I’ve got that for all my social profiles, by the way. Just again that I can put in a URL or give to someone www.ianmoyse.co.uk. Really easy to do. You&#8217;ll probably remember that because all you got to do is just remember the name of who you spoke to, Oh yeah. And you&#8217;ll find my profile. <\/p>\r\n<p><b>Jason Yormark:<\/b> No. That is a great point.<\/p>\r\n<p><b>Ian Moyse:<\/b> And [32:55 inaudible]  micro thing of, well, that&#8217;s a bit professional. To your point I&#8217;m looking for micro pieces. There&#8217;s no one big epiphany I can advise anyone on social media to do. Here&#8217;s one big thing. It&#8217;s a hundred small things that all take you a few minutes and are either free or take you a few bucks here and there. <\/p>\r\n<p><b>Jason Yormark:<\/b> No, I love that because I mean, cause I mean, as a marketer and a public speaker, like I have my own website, there&#8217;s a reason I have that. But for a lot of salespeople, they probably, you know, it&#8217;s probably overkill. They don&#8217;t need their own website. So that&#8217;s a great point. If you&#8217;re listening to this and your it’s like buy your name, I mean, it&#8217;s probably taken if you have a common name, but some variation of it get a domain name. They&#8217;re like eight, nine bucks a year. And as you said, point it to your LinkedIn profile, make it that much easier for people to find you. So fantastic tip. I love that. So, awesome, well, I am really thankful to have you on the show. I love great insight. I could not agree more with the depth of advice in context around social selling, super great stuff. Where can, I know you kind of mentioned it, but again where can people find you?<\/p>\r\n<p><b>Ian Moyse:<\/b> www.ianmoyse.co.uk, LinkedIn, and www.ianmoyse.cloud on Twitter. You know, I share a lot of content, write blogs around stuff we&#8217;re talking about. And sales matters and share a lot of content cause I follow a lot of good people. So take a look at the content I share and the people that I follow. There&#8217;s a lot of good information out there that in the world we&#8217;re in is free, you’ve just got to make the choice to digest it.<\/p>\r\n<p><b>Jason Yormark:<\/b> Awesome. Well Ian thank you so much for being on the show. Good stuff.<\/p>\r\n<p><b>Ian Moyse:<\/b> Thank you. <\/p>\r\n<p><b>Jason Yormark:<\/b> Absolutely. And that does it for this week&#8217;s episode of socialistic. If you&#8217;re listening, you know the drill, download, subscribe, leave a review, tell your friends all that good stuff. Appreciate you listening. And we&#8217;ll catch you next week with another episode of the Socialistics Podcast.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries. Learn more about Ian at https:\/\/www.linkedin.com\/in\/ianmoyse\/ [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7880,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Is Social Selling And How To Use It Effectively - Socialistics<\/title>\n<meta name=\"description\" content=\"Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Is Social Selling And How To Use It Effectively - Socialistics\" \/>\n<meta property=\"og:description\" content=\"Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-04-19T15:55:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-22T18:16:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"31 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#webpage\",\"url\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/\",\"name\":\"What Is Social Selling And How To Use It Effectively - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#primaryimage\"},\"datePublished\":\"2021-04-19T15:55:06+00:00\",\"dateModified\":\"2021-04-22T18:16:23+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"Today I sat down with Ian Moyse, a technology sales leader who\\u2019s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"What Is Social Selling And How To Use It Effectively\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What Is Social Selling And How To Use It Effectively - Socialistics","description":"Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/","og_locale":"en_US","og_type":"article","og_title":"What Is Social Selling And How To Use It Effectively - Socialistics","og_description":"Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.","og_url":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-04-19T15:55:06+00:00","article_modified_time":"2021-04-22T18:16:23+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png","size":"full","id":7880,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"31 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-2.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#webpage","url":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/","name":"What Is Social Selling And How To Use It Effectively - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#primaryimage"},"datePublished":"2021-04-19T15:55:06+00:00","dateModified":"2021-04-22T18:16:23+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"Today I sat down with Ian Moyse, a technology sales leader who’s racked up countless awards as a keynote speaker, blogger and influencer when it comes to the world of social selling. We chatted about what social selling exactly is and how it can benefit leaders in all industries.","breadcrumb":{"@id":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/what-is-social-selling-and-how-to-use-it-effectively\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"What Is Social Selling And How To Use It Effectively"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7833"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7833"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7833\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7880"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7833"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7833"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7833"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}