{"id":7877,"date":"2021-05-03T08:00:12","date_gmt":"2021-05-03T15:00:12","guid":{"rendered":"https:\/\/socialistics.com\/?p=7877"},"modified":"2021-04-22T11:20:48","modified_gmt":"2021-04-22T18:20:48","slug":"how-to-up-your-agencys-sales-game","status":"publish","type":"post","link":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/","title":{"rendered":"How To Up Your Agency&#8217;s Sales Game"},"content":{"rendered":"\r\n<p>Even as agency owners, we have plenty to learn when it comes to nailing the sales process. In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.<\/p>\r\n<p>Learn more about Elias at <a href=\"http:\/\/www.needclientsnow.com\/\" target=\"_blank\" rel=\"noopener\">www.needclientsnow.com<\/a> <\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<p>&nbsp;<\/p>\r\n<div id=\"buzzsprout-player-8330243\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8330243-how-to-up-your-agency-s-sales-game.js?container_id=buzzsprout-player-8330243&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark:<\/strong> Hello, and welcome to another episode of the socialistic podcasts, social media agency stories. My name is Jason Yormark. I&#8217;m excited about our guest today. I have this uncanny ability to apparently schedule guests around things that actually relate to what I am personally going through with my agency. So I feel like this will be a very natural conversation, but I want to welcome Elias Zepeda, founder, and CEO of need clients now. Welcome to the show.<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Thanks so much, Jason, looking forward to this.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. Well, why don&#8217;t we just jump right in. I always want to have everybody just kind of give us your background. What&#8217;s your story. Where did you start. Where have you been and where are you at?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Awesome. Happy to do so. I started my marketing agency at a very young age. I was 21 years old when I started marketing. And initially the first five years of running the business, we were primarily an experiential marketing agency. We were producing events. I was hiring, training, and staffing brand ambassadors. We were creating experiences and that type of stuff, and that was great. I have a huge passion for events, and I will always be involved in events in some capacity, but over the years people would ask me, do you do online marketing? And do you do Google advertising? Do you do social media advertising? And, we were initially always just an exponential agency, but I couldn&#8217;t get away from it. It was at that time, social media was starting to become rampant and a lot more common and online and local advertising. And I realized what we did as an experiential agency. It&#8217;s amazing and it serves its purpose, but when it comes to delivering more value and making a difference in a business, really online marketing is absolutely an extremely powerful, so we couldn&#8217;t get away from online. And we slowly transitioned into really focusing on online marketing and specifically focusing on building sales funnels. And that&#8217;s how we transitioned. In year five of the agency, Now we&#8217;re in year 11. And so for the past six years, we&#8217;ve been really focusing on lead generation, on providing done for you funnel services and everything that encompasses what a sales funnel is, which there&#8217;s a lot of moving pieces to that. And so, throughout the years I’ve built a team that successfully produces high converting sales funnels across a handful of industries. And that&#8217;s where we&#8217;re at now.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Gotcha. Awesome. So it&#8217;s interesting to me. So I was a little late as starting an agency, a late bloomer. But it&#8217;s interesting to me when I run into folks that actually started at a relatively young age. So you had mentioned, you started an agency at 20. Tell me a little bit about why, how, how come you didn&#8217;t go down a traditional, corporate path and jumped into entrepreneurship at a relatively early age.<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Absolutely. So to be honest, it was an opportunity, I didn&#8217;t plan on it. So my father is an entrepreneur. So, I did, learned a lot from my father and, and seeing him run his business, but it wasn&#8217;t really my intention. Let me start a marketing agency. It didn&#8217;t really work out that way. So, to make a long story short, I worked for the family business when I was, you know, 18, 19, 20 years old. And then at that time, we had the market crash and the real estate industry. This is back in 2008, and I needed to do something else I needed to get away from the family business. And so I got hired as a manager for a marketing company, and I worked for that marketing company for about eight months. And that marketing company, what they did is they did direct sales, they did newspaper marketing, which meant that they would participate in having sales representatives at football, at baseball, at basketball, at events all across, all across the city and the area. And my responsibility was to hire, train and manage sales representatives at these activations, at these special events. So I did that for eight, nine months, and I was pretty pleased with it, but I realized that I was more ambitious than my boss. I realized I had bigger goals than my boss, and, to make a long story short, the client, which is a contractor, the person who oversees circulation and vendors for the newspaper organization, and the client knew that I was being held back. And he at a meeting said, Hey, you know what? Your boss is holding you back. I would be more than happy to give you your own territory and your own contract, but in doing so, you would need to have a business, you need to have an incorporated business. You need to sign up as a new vendor. And so that&#8217;s kind of the Genesis of my entrepreneur story. It was offered to me by a client and I&#8217;m fortunate and thankful. And so at that time, it was a really scary decision because I was 21 at the time. I was very young and fairly inexperienced, and I decided to jump into it and the rest is history.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Okay. That&#8217;s awesome. You know, that&#8217;s one of the things that I’ve really enjoyed about this podcast. And a lot of the content we create is helping, younger folks be able to take that leap and hopefully not make the same mistakes that I have along the way. So, but I think what&#8217;s really interesting to me that kind of really wanted to dive in with you today is around basically sales funnels and the importance of building sales funnels, marketing automation, how to be more effective with your sales process, especially as an agency. I think that for, we&#8217;ve been, I’ve been fortunate to have a little bit of a runway to kind of figure out a lot of this through trial and error. And while we&#8217;ve reached a point where we have a good flow of inbound opportunities, we realize that if we really want to get to where we want to go, we need to create more in essence funnels, we need to create more opportunities to connect with more people even if they&#8217;re not ready to necessarily buy from us today. So we&#8217;re in the beginning, kind of in the middle stages of kind of figuring that out. What does that look like for a social media agency and what kind of value can we provide? And how can we connect with opportunities that may be aren&#8217;t ready to buy now, but maybe they are three, six, 12 months down the road and really kind of nurture those relationships. So let&#8217;s start with just telling me a little bit about, you know, the important, like most of our listeners probably know what a funnel is, but just an overview of, what does that look like to you, and how do you start thinking about creating that for your business?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Absolutely. I mean, funnel is one of those, it&#8217;s one of the buzz words of the past four or five years, but really what it is, is a strategy and it&#8217;s the path to conversion and it&#8217;s the customer journey, right? And so there are many different types of quote unquote funnels and you nailed it, for an agency it&#8217;s about demonstrating your expertise. It&#8217;s about providing value. It&#8217;s about indoctrinating your prospects, right. And that&#8217;s kind of what it comes down to. And so there are many funnels that I would recommend for agency owners like yourself and funnels that we produce and manage on a day-to-day basis, but going within the lines of providing value and demonstrating our knowledge and expertise and providing as much value as possible. You know, a webinar campaign is certainly one of the most effective ones. And that&#8217;s something that we do day in and day out last night, we had two webinars running across the country in different States. And that&#8217;s a great strategy for certain businesses and specifically agencies because you have an hour, you have 45 minutes, you have an hour and a half to really dig deep into the pain points, into really demonstrating your expertise, establishing your credibility, telling your story. And then if you have an offer in place and you have an opportunity to showcase and present your irresistible offer, or it can just be the type of funnel where you&#8217;re delivering value. And then the opera will come in at a later date, depending on who the audience is, and depending how you want to approach that, but webinar is really effective. And that funnel could work for many different industries, many different services, of course. So it&#8217;s not going to work. Like if you&#8217;re selling a, you know, a t-shirt, if you&#8217;re selling like e-commerce product, it doesn&#8217;t make sense. And so it has to be a service that ideally isn&#8217;t that thousands of dollars, right? It&#8217;s not going to be, you know, $30,000, $50,000, super high ticket product, but it&#8217;s not going to be, you know, a t-shirt or a $50 e-commerce product. So that really fine line of a service that&#8217;s in the thousands of dollars and where you have that opportunity to really share your story and share the expertise and the value, and then spend really an hour, an hour time with your prospect. And so that&#8217;s an amazing funnel. And that&#8217;s one that works really well for this industry, especially industries like agencies, where you have the ability and the viability to continue having recurring payments. So a monthly retainers, and so it&#8217;s a great you know, top funnel starter funnel for agencies.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> So if an agency is kind of not doing these things, where does that start? Like, what do they need to be thinking about and how do you, you know, what are the, how do you kind of ensure that you can be successful with it? Like what are the questions that you need to ask yourself? What are the, where&#8217;s the time that you have to put into kind of prepare yourself to be even in a position to facilitate a successful funnel strategy?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Yeah, absolutely. I mean, the truth is webinar funnels, a fully integrated webinar campaign is labor intensive, right? So now we have a full team that does it, designers, developers, someone that&#8217;s mapping out the specific funnel steps and someone that&#8217;s doing the tech. But there&#8217;s a lot of moving pieces. There&#8217;s a lot of variables in this specific funnel. And so one of the mistakes I made in the first six years of running my company is, as I was working with so many different industries. I was really working with lots of companies. If I had a referral and it was something, I knew very little about. I would take it, I would take it. And that&#8217;s one of the biggest mistakes I’ve made. And if I can help someone avoid that mistake and focus on one or two niches, that&#8217;s one of the biggest advices I can give. Because when you focus on an issue, you know, so much about that audience and you know the pain points, you know the challenges, you know their fears, you just know so much about it, and it becomes so much easier to systematize and to grow and scale. So back to the webinar, this has to be a topic in an industry, a vertical that you&#8217;re very familiar with. And that&#8217;s really how it works. You have to advertise, unless you already have an email list that you&#8217;re going to be emailing, inviting them to. So it comes down to what&#8217;s the traffic source. So a lot of our customers, they have a list, but they want new people to be at the top of funnel. They want new people to register and attend the webinar. And that&#8217;s really kind of where it starts. You have to have an invitation, people have to visit your registration page and you have to have a compelling headline that says title of the webinar and the benefits and what they&#8217;re going to get and how they register and all that fun stuff. And so that&#8217;s kind of where it starts in getting registration. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> Got it. I think for most agencies realistically, and we&#8217;ve learned this through trial and error that in order to really pull off that sort of thing, oftentimes you&#8217;re not going to be able to do all of it yourself. I mean, you&#8217;re busy with enough running the agency. So that realistically, you know, bringing in another agency or someone to help kind of navigate helping develop that, run it, play a part in it to ensure that there&#8217;s consistent movement with it. But aside from, you know, getting help, what are some of the tools or resources out there that an agency owner or aspiring agency owner could tap into to kind of help them get the ball rolling?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Yeah. So, like I said, webinar campaigns, they&#8217;re labor intensive, and there are so many moving pieces that are a part of it. And so you know, let&#8217;s focus on one of them. So we have a registrant&#8217;s, we have enough people that are registering, let&#8217;s say we have 200 people that we&#8217;re registering from, let&#8217;s say, hypothetically, YouTube, Facebook, and Instagram ads. So that&#8217;s our first, that&#8217;s the first KPI that you want to focus on is people as registrants, the second KPI is number of people that actually end up showing up to the webinar and that&#8217;s important. And to have that you need to have systems in place, you need to have tools and software’s to use so that you&#8217;re sending reminder campaigns. And so that&#8217;s where the automation comes into play here. And so what we do for webinar campaigns is we send email reminders, various email reminders, right?  Because people forget and, you know, if you register for something last week,  it can very well happen that you forgot you registered. And so having these automated reminders are very vital, but it doesn&#8217;t just stop with email. We also like to send ringless voicemails as well. Cause that&#8217;s just a different touch point. And I love ringless voicemails. They&#8217;re cool. They&#8217;re fun. It&#8217;s a voicemail that you suddenly get your phone probably did not ring, but you get a voicemail. And that voicemail says, Hey, this is Jason. And I just want her to send you a quick reminder that we have our webinar this evening, and I&#8217;m going to be sharing with you X, Y, Z. So these are fun, short little messages. So that&#8217;s a second touchpoint. And then of course the Bell of the ball, text message marketing, right? So text messages are extremely effective. And so these are just short messages saying, Hey, Jason here you know, our webinar&#8217;s going to be starting [14:40 inaudible] at six, really looking forward to seeing you there, you know, and then there&#8217;s typically some type of URL that either connects them to register or [14:48 inaudible] link or, you know, whatever the use case is. And so that&#8217;s the second KPI using technology, using these automation tools so that you have an omni-channel kind of approach to getting as many people to actually attend, because what&#8217;s the point if you have a lot of red registrants, but no one&#8217;s really showing up. Then it&#8217;s a giant waste of money. So same KPIs number of people that show up. We just had a webinar earlier this month that we had our highest, our highest show up rate. And it was like 73%. And I’ve never seen anything that high, then, like I said, yesterday, we had two webinars and they were in the 40%, which are really good. And that&#8217;s again because we&#8217;re focusing on, on sending emails, text messages and ringless voicemails. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> Interesting. I didn&#8217;t even think about the ringless voicemails. That&#8217;s very interesting. I&#8217;ve always wondered. I&#8217;ve gotten voicemails every once in a while. And I&#8217;m like, I don&#8217;t remember the phone ringing. So, I mean, it doesn&#8217;t surprise me that exists, but that&#8217;s a very, that&#8217;s an interesting tactic. I hadn&#8217;t even thought about it. I would imagine that the thought there is, there&#8217;s some automation there in the sense of the message that&#8217;s, I mean, I guess tell me, how does ringless voicemail work? Is it, you record one message and then it shoots it out to everybody.<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Exactly, exactly. You record it. It&#8217;s an MP3 file. And then you upload it to the tool and then it does its thing. And then you have the numbers, the phone numbers stored already, and then the database.  And that&#8217;s as simple as that. And then it has analytics. That&#8217;ll show you how many were delivered, how many were not delivered. And then the best part is, it&#8217;s very inexpensive. Like I&#8217;m talking, I don&#8217;t have the exact number of price memorized, but it&#8217;s like an average client for like a local campaign is going to be spending less than like $30 to run a ringless voicemail campaign to hundreds of people. So it&#8217;s very inexpensive. And again you know, the bell of the ball, text messages, but ringless voicemail was worked really well because people are curious, like, who sent me a voicemail cause lots of people don&#8217;t even send voicemails anymore. So it&#8217;s really interesting and it&#8217;s very effective and that&#8217;s why were able to command, you know, these 40% like show up rates for our campaigns. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> That&#8217;s awesome. So the automation piece is really interesting to me. That&#8217;s something that I haven&#8217;t done a good enough job with. I think for us, I’ve always, you know, we tried some cold email outreach and it&#8217;s just never been really that effective. And there&#8217;s only so much time in the day that I have to work with. And I’ve reached a point with our agency that I have enough inbound opportunities that, that takes up the majority of my time. That doesn&#8217;t mean that we need to be doing more. You know, I&#8217;m pulling in, you know, I&#8217;m growing our sales team. And so we know that we have to do more for the longer funnel opportunities. And I&#8217;m learning a lot about automation and where that makes sense.  Where  does automation start and stop and where does that custom personalized one-to-one kind of take over.  So I&#8217;m interested in from your perspective you know, for again, an agency owner, that&#8217;s looking to kind of get this going in their world.  I think  the better question here is what can&#8217;t be automated. You know,  even if you&#8217;re kind of putting these funnels in place and you&#8217;re putting the automation that you can in place, what does an agency owner still need to expect in terms of they&#8217;re still having to do, non-automated like, what&#8217;s the time commitment? Like, what are the things that they&#8217;re going to still have to do, even if they have an ideal automated system in place?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Gosh. That&#8217;s a loaded question there, Jason. It&#8217;s a tough one because automation is amazing. It gives us and grants us the opportunity to save time, right? So like, in these webinar campaigns, we&#8217;re automating the emails, the reminder emails, we&#8217;re automating you know, the reminder sequences. And then for those that did not even attend the webinar, the other 60, 70% using the webinar funnel, as an example, we&#8217;re automating, we&#8217;re sending them the replay of the webinars. So, and then we&#8217;re sending or automating other emails for those that did watch it, but did not take action to whatever the offer was. We&#8217;re automating like, Hey, it looks like you didn&#8217;t take advantage of our offer. You know, let us know why not, you know, or schedule a call with a representative, right. Depending on what the offer is. So there&#8217;s automation that&#8217;s involved heavily in these funnels and in these types of campaigns. I see sometimes where automation, you know, really does not work. And that&#8217;s where, you know, you sneakily try to make it sound like it&#8217;s personal, but it&#8217;s not, you know, but it&#8217;s not like that. You don&#8217;t want to do that. Like, you don&#8217;t want to do that. I don&#8217;t suggest it. People are not going to mind reminders. People are not going to remind, you know, invitations like that, and they&#8217;re not going to care whether they&#8217;re automated or not. But when it comes down to, depending on the product or service that you&#8217;re selling, you still have to have some involvement. And so I don&#8217;t suggest unless you have a very small price point, I don&#8217;t suggest automating the actual sales conversation. You want to speak to your customers, right? You want to ask them questions and you want to be able to, you know, to really have your sales team deliver. And you don&#8217;t have that one-on-one communication with them. So there are lots of ways to use automation and reminders and follow-ups and invitations and so forth, and obviously an email marketing, of course. But yeah, I really think that you have to be strategic with it so that you don&#8217;t, so that you don&#8217;t miss the Mark and really having that personal communication with your prospects. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> So I&#8217;m going to ask you a question. So I think I&#8217;m good on sales calls. Of course, I&#8217;m sure I could be a lot better, but you know, one of the questions, one of your talking points that jumped out to me that I wanted to ask, cause I want to see if I can learn something today or at least give the audience something to think about is you know, how to be more effective with sales calls. Once you get the opportunity, once you get them on the phone and you have that opportunity, what are some of the things that you recommend agency owners or salespeople at agencies, or really anybody that&#8217;s doing a sales call, like what are some, what are the top two or three things that kind of jump top of mind around how to really make the best use of those opportunities?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> So, I mean, it depends on the history of this person. It depends on is this inbound, is this outbound. So there&#8217;s lots of things to really consider here. What&#8217;s really worked for us. And again, it focuses on knowing so much about a niche, about an industry. So right now, one of the verticals that we are working with heavily across the country is beauty academies. You know, these are institutions that are certifying, you know, future beauty business owners. So that&#8217;s a niche that we&#8217;re specializing in and that we&#8217;ve worked with for years now. And so we have so much knowledge on it. So as soon as I get on the phone and I’ve been doing sales and business development for, you know, since I started the company, so I&#8217;m quite comfortable with it. And so there&#8217;s lots of factors that come into play. One is passion. You know, people need to see that whoever&#8217;s doing the sales, whether it&#8217;s a CEO or a sales professional is passionate about the work that they do and the results that they deliver. And so that&#8217;s a really big one. And when I started, since I started the company at such a young age, I didn&#8217;t have that much experience, but people saw the passion through me, and they saw the enthusiasm. They probably saw I was going to work my tail off. And they gave me opportunities. I look back at some of these proposals that I won, you know, eight, nine years ago. I&#8217;m like, I cannot believe anybody would hire us with these types of proposals, right? So maybe the same for you. You look back at how much you guys grown and improved and new things you guys added. And so that&#8217;s a big one is passion. For us having a well thought off deck really makes a big difference. Something that is nicely designed, and it&#8217;s really optimized. So having done so many sales presentations, just having that journey of walking, of creating a sales deck, asking questions, making it interactive, showing case studies. There&#8217;s so much that goes into it. But it really comes down to having knowledge of the industry, being passionate, having sales materials, i.e., a deck that is complimenting your pitch. And then most importantly asking the right question. So it depends on your sales format, you could do a one cold close or a two call close. We have found the two cold calls work best. So we have someone that is initially off of an inquiry. Let&#8217;s say it&#8217;s an inbound lead. We have someone that&#8217;s contacting the prospect and is pre-qualifying them to see if it&#8217;s worth, you know, putting together our 45 or one hour pitch presentation. There&#8217;s a lot of energy. And that goes into these presentations. So kind of a prequalification call is typically about 15 minutes. And it just ask, it just pre-qualifies the person, you know, do you have a real business? How long have you been in business, ask them series of questions. And then that tees it up for the second call, like the decision call, we were actually delivering the presentation. So we have found for our price points and our industries that kind of a two cold call close works well. And we have found that putting together a thorough sales deck that compliments the presentation really makes a difference for us.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Interesting. So I love what you said about passion. I completely agree. Oftentimes we get potential clients on the phone and we get ask questions like, well, what makes you unique? What makes you different? And at the end of the day, an agency is an agency. I mean, there&#8217;s good ones, there&#8217;s bad ones, just like anything in life. You know, if they&#8217;re talented, if they&#8217;re experienced, everybody&#8217;s [24:48 inaudible] results, but you&#8217;re spot on with passion. Like, that&#8217;s what I always tell prospective clients. Like you can tell if who you&#8217;re talking to seems authentically passionate about what you do, and if you&#8217;re really looking for a differentiator, that&#8217;s the thing to look for. It&#8217;s kind of hard to fake, you know, either you can tell if somebody is faking, whether they&#8217;re really excited about something or not. So that&#8217;s really what to look for. So I couldn&#8217;t agree more with you. You had mentioned something, now I&#8217;m going to get self-assured because I&#8217;m jealous if you&#8217;re actually closing clients on two calls. So I&#8217;m kind of curious about, and we use a similar tactic, we have that initial call and try to get a sense of whether they&#8217;re a good fit and whether, you know, we move on to kind of like a pitch proposal stage. But it&#8217;s very rare for us to get a yes or no at the end of that second pitch call. It&#8217;s usually, you know, we go through it with them and you know, my approach has always been, Hey, either we&#8217;re the right fit, or we&#8217;re not, you know, I&#8217;m not going to make you make a decision any faster than you want to. And that&#8217;s probably an area we need to get better at is maybe just pushing to ask for the sale to kind of make that happen. So I&#8217;m just curious, in your experiences, are you getting a lot of decisions made in that moment at the end of that second call pitch proposal? Yes or no? And if yes, like what do you think are the things that you do that ensure that that happens?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> I love this question. And I got a great answer for you, but again, it really comes down to like, who are these prospects and how big are your retainers. That makes a difference. If you&#8217;re selling you know, some agencies are selling $2000, $1,500 retainers. Ours are a lot higher than that. You know, we have $5,000 to $13,000 per month retainers. So of course you&#8217;re doing one call closes because your product is only $1,500, right? So it comes down to a lot of factors, but on a two call closes, you have to frame, you have to frame them. So at the beginning of the conversation and be like, Hey, at the end of this presentation, you know, there&#8217;s going to be a decision that&#8217;s going to be made. And I think by that time, I’ll have answered all your questions, but are you comfortable at the end of the presentation for you to, this is a decision call for you to let me know whether this is something you really are able to do. And are  you able to give me an answer on that? So you&#8217;re framing that from the very beginning, but it has to be done strategically. It can&#8217;t be forced, you know, you have to have confidence in it. And so it boils down to the prospect, where the prospect is coming from and what they&#8217;ve seen before, how indoctrinated they are, most of the time they&#8217;re already going to be excited to already get on the phone with you because they need marketing services.  And so they&#8217;re coming to an agency because they need leads. They need sales, they need help with branding, whatever it is. So at the end of the day, you have to frame that question and you have to ask them like, hey obviously you have to make sure you&#8217;re speaking to the right person. The decision maker, of course, that&#8217;s, you know, sales 101, right? You don&#8217;t want to pitch a person that is not a decision maker. So there&#8217;s a couple of steps to do, but I’ve found that framing it from the beginning and asking strategically and politely and saying, Hey, at the end of this call whether it&#8217;s a yes or no. And if it&#8217;s a no, that&#8217;s perfectly fine. I just want this to be a decision call. Is that something that you agree to and something that you&#8217;re comfortable with?<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Now do you do that, what you just said, do you do that on the first call saying, Hey, you know, we&#8217;re going to do this thing. We&#8217;re going to put this together for you, but our expectations, it&#8217;s a lot of work. And we think we&#8217;re going to give you what you need to make a good decision. Do you think you&#8217;re going to be ready to, [28:17 inaudible] and if they say it, like if they say, no, I don&#8217;t. I mean, is that where you&#8217;re a little hesitant to kind of go down that, you know, that far with them, if they&#8217;re kind of waffling on that.<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Exactly. You&#8217;re framing it from even the first call. You&#8217;re framing it from the first call and then you&#8217;re framing it again. And so, one thing I want to add is, is, you know, again, where&#8217;s this person coming from, is this inbound, is it an outbound? What do they know about the company so far? Was it a referral? So there&#8217;s a lot that goes into it. But one of the really the key pieces here and getting high conversions for agency sales is social proof, right? So if you have videos in your presentation, you have videos on your website. If the customer&#8217;s already seen them before, they&#8217;re going to be more excited to speak to you and to make a decision, some of these people are going to be pre-sold already. I&#8217;ve had conversations with customers that says, you don&#8217;t even need to finish I&#8217;m ready to go, because they had done their homework. And then I had conversations with others that they may need a third call or even a fourth call. Like, of course not all of our sales are closed on two calls. A vast majority are at our retainer levels right now. But you know, it&#8217;s common. People are wired differently. People need more info. They need to take a little bit more time and whatnot. But if you have that social proof and the best social proof to have for an agency is a video testimonial. And we have great ones, people that are sharing their heart and their story. And you can tell when they&#8217;re authentic videos, because nowadays, you know, in the online marketing world, there are lots of people that are fake testimonials. Especially if they&#8217;re texts ones. It&#8217;s like, Oh, well, like how do I know? You know, so video testimonials are King when it comes to social proof. And if that&#8217;s a prospect that, if it&#8217;s a niche that you&#8217;re specializing in, and if that person knows some of the clients that you worked with, and those clients say are raving about you, that&#8217;s going to really help this conversion process. So there&#8217;s so many different factors that go into sealing clients for agencies, but that stuff really helps. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> No, that&#8217;s a great point. So we&#8217;ve used like clutch and gotten a lot of, I always thought it was a heavy lift to get a client to spend 15 minutes with clutch, to be interviewed and do reviews there. But it sounds like you&#8217;re saying you&#8217;re actually having clients provide video, like the video of them talking about their experiences with you, how are you facilitating those? And you just say, Hey, can you video yourself talking? Like, how do you set that? How do you get them to kind of do that?<br \/><br \/><strong>Elias Zepeda:<\/strong> Yeah. So there are questions to that you can ask, but you have to be very careful with that. Because if a customer is just reading it, I started working with this company and this like, you&#8217;re not going to get the best testimonial. So, I mean, it depends, it&#8217;s kind of a case by case basis. Let&#8217;s say we&#8217;re doing webinar funnels, then we&#8217;re already coaching our clients through you know, how to be engaging and tonality and you know how to deliver a good video, like general media training. So that our clients are now comfortable with recording videos because we&#8217;ve coached them on that. And so they&#8217;re comfortable. It&#8217;s not going to be scary for them to record, you know, three, four minute video, right? So you don&#8217;t want to be too long. 15 minute testimonial, that&#8217;s a very, very long, detailed case study, people are probably not going to watch that unless it&#8217;s a hell of a story. And you don&#8217;t want it to be too short. I had a great experience with this company. They are amazing. Nope. That&#8217;s a terrible testimonial. So the key is getting these really good, two, three minute, you know, testimonials where they&#8217;re just sharing authentically, they&#8217;re sharing what was their issue before they started working with you.  So what was it before,  and what is it now and  what&#8217;s been happening and as a result of what that company is doing what changed . So that&#8217;s how you&#8217;re able to really get the best type of testimonials. So I used to do this and, you know, we have a great company, we have a great service, but I realized I didn&#8217;t have enough leads, or I was doing my sales process one to one, and I needed to do one to many. And that&#8217;s how I learned about need clients now. And so those are the best testimonials. And then they share, like, now I&#8217;m able to do this, this, and this. So those are the best types of social proof you can have. And if you have that, if you sprinkle that on your website and on your sales presentations, it&#8217;s just, it&#8217;s going to be your best friend that&#8217;s going to help you seal these deals.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> That is awesome. That&#8217;s great stuff. A couple more questions. When you think back on your agency journey, if you can kind of go back and do something differently you know, I think it was always a great question for up-and-comers. You know, if there&#8217;s some, you can go back, do it differently, change it out. What would that have been?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Gosh, I mentioned this a couple of minutes ago, but man, really our biggest mistake is just saying yes to everything, you know, especially in the first couple of years. Oh, can you do a video? Can you do this? Can you do content marketing? And it&#8217;s like, yes, yes, yes. So being a yes man in an agency is the worst, the worst thing you can do. So that&#8217;s number one. And number two, really, there are riches and niches as they say, you know, so the reason why we&#8217;re closing deals now is because we know so much about an industry you know, there&#8217;s no question with that. So really when you focus on just a handful or one niche, you&#8217;re going to become the go-to expert in that respective niche. So those are the really the two big things that if I was able to go back in time and fix that, that&#8217;d be the first thing that I do. And then lastly, really what it comes down to is you know, coming up with a service that&#8217;s going to get results, right? And that&#8217;s why we build an offer a done for you funnel service, because funnels, if done correctly, you&#8217;re going to be, your clients is going to be getting results and they&#8217;re going to get results very quickly. And I&#8217;m not knocking other marketing services. They all work well. And they serve their purpose and SEO and content and blogging.  They&#8217;re all amazing. And they serve its purpose. But what I have found, you know, and the years that I’ve been in business as clients, they want results quickly. They want results now, they want results yesterday. So having to frame the client and be like, Hey, this can take a couple of months to, for you to actually get some engagement and so forth. I have found that clients don&#8217;t really have the patience or want to  really wait long in order for them to see results. And that&#8217;s how we decided to focus entirely on funnels because within 45 days, we can launch a funnel. We can run traffic to it and the client at that phase is going to already start having leads and conversations and clients, and is already going to start seeing returns on their investment. And that&#8217;s really what&#8217;s worked well for us and the funnel services that we&#8217;re offering now, it need clients now. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. No, I love it. And I&#8217;m always asking everybody this, what&#8217;s your favorite app, website, gadget, book, something that really has stood out to you recently that you would recommend?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Gosh, so many man, our tech stack is pretty big, a really cool one that we&#8217;ve been adapting. We started really adapting it last year. It&#8217;s like video email. So we use a tool called Bonjoro. So if you have a high ticket client. And it&#8217;s going to be worth your time for you to record a video and say, Hey, I had a great conversation with you. I&#8217;m really looking forward to the next call. It&#8217;s going to be worth it for you to spend a little more time, providing a little more care to that prospect and showing them that, you know, your level of excitement you know, tools like that, video emails, you know, I guess that is referred to, it&#8217;s really cool because it&#8217;s still pretty new, in any, you know, lots of times when you can show these clients like new tools and features, it kind of gets them excited. Because they&#8217;re unfamiliar with, you know, like ringless voicemails, they have no clue what that is, no clue how it works, video emails and that type of stuff. And so I&#8217;d say Bonjoro is really cool too, I recommend. And then two, Loom, man, I love Loom. And I’ve been a Loom user for quite some time when they first started. And it&#8217;s just great, like it works well, and you screenshot things. And so one of the things we started doing in our agency is doing these like weekly video recap. So, Hey, this is what the team has been working on this week. And then you&#8217;re showing exactly what the team is working on. And it just gives the client confidence that you&#8217;re still delivering and working for them, even though if you don&#8217;t have a meeting this week or update call with them. And so I would say Bonjoro and Loom for the win.<br \/><br \/><strong>Jason Yormark:<\/strong> Oh, I love it. Yeah. We&#8217;ve been using Loom a lot too, so love it. Good stuff, man, I really enjoyed this, really awesome stuff. I&#8217;ve learned a ton. If I learned a ton, then that means this is probably going to be a pretty good episode. So I really appreciate you sharing your insights. Is there anything that I didn&#8217;t ask you that you feel might be important to share with the audience before we wrap up?<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> I think we covered a lot, and you know, thank you so much for the opportunity, really what it comes down to is regardless of what service and what industry and so forth, you know, learn about sales funnels, and learn what is the best type of funnel for your business. Again, make a significant difference. And that&#8217;s what we do day in and day out is make differences in our client&#8217;s lives. So learn about the power of a funnel and see how you can adapt it to your specific business. You know, and if there&#8217;s any questions people can contact me. You know, our website is www.needclientsnow.com. You can email me at Elias, elias@needclientsnow.com and I&#8217;m pretty available and accessible through Instagram and Facebook and clubhouse and all the other things.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. Well, thank you so much for carving out some time today. I really enjoyed speaking with you. And certainly somebody that I plan on keeping my eyes on, because like I said, learned a lot from our conversation. So thank you for joining us today.<\/p>\r\n<p><strong>Elias Zepeda:<\/strong> Thanks so much, Jason. <\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. That does it for this episode of Socialistics, make sure you like share, subscribe, all that good stuff. We&#8217;ll catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>Even as agency owners, we have plenty to learn when it comes to nailing the sales process. In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7881,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Up Your Agency&#039;s Sales Game - Socialistics<\/title>\n<meta name=\"description\" content=\"In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Up Your Agency&#039;s Sales Game - Socialistics\" \/>\n<meta property=\"og:description\" content=\"In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-03T15:00:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-04-22T18:20:48+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"33 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#webpage\",\"url\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/\",\"name\":\"How To Up Your Agency's Sales Game - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#primaryimage\"},\"datePublished\":\"2021-05-03T15:00:12+00:00\",\"dateModified\":\"2021-04-22T18:20:48+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"In this week\\u2019s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How To Up Your Agency&#8217;s Sales Game\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Up Your Agency's Sales Game - Socialistics","description":"In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/","og_locale":"en_US","og_type":"article","og_title":"How To Up Your Agency's Sales Game - Socialistics","og_description":"In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.","og_url":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-05-03T15:00:12+00:00","article_modified_time":"2021-04-22T18:20:48+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png","size":"full","id":7881,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"33 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-3.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#webpage","url":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/","name":"How To Up Your Agency's Sales Game - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#primaryimage"},"datePublished":"2021-05-03T15:00:12+00:00","dateModified":"2021-04-22T18:20:48+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"In this week’s episode I sat down with Elias Zepeda owner and founder of Needs Clients Now, and we discuss some incredible insights, strategies and tactics around how to build successful sales funnels, integrate more innovative automation into your process and how to upgrade your sales calls.","breadcrumb":{"@id":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/how-to-up-your-agencys-sales-game\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How To Up Your Agency&#8217;s Sales Game"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7877"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7877"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7877\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7881"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7877"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7877"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7877"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}