{"id":7879,"date":"2021-05-31T08:00:30","date_gmt":"2021-05-31T15:00:30","guid":{"rendered":"https:\/\/socialistics.com\/?p=7879"},"modified":"2021-05-07T10:30:21","modified_gmt":"2021-05-07T17:30:21","slug":"how-to-build-a-scaleable-culture-rich-virtual-agency-team","status":"publish","type":"post","link":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/","title":{"rendered":"How To Build A Scaleable, Culture Rich Virtual Agency Team"},"content":{"rendered":"\r\n<p>This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. <\/p>\r\n<p>Learn more about Michael at <a href=\"https:\/\/buzzworthy.biz\" target=\"_blank\" rel=\"noopener\">https:\/\/buzzworthy.biz\/<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8330272\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8330272-how-to-build-a-scaleable-culture-rich-virtual-agency-team.js?container_id=buzzsprout-player-8330272&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><strong>Jason Yormark: <\/strong>Hello and welcome to a another episode of the Socialistics podcast. I am Jason Yormark your host, owner, and founder of Socialistics. Today we have another interesting guests that I&#8217;m excited to have here. We&#8217;re going to talk more agency shop and some things about how to simplify digital marketing as a small business owner. Welcome Michael Buzinski from buzzworthy integrated marketing. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Thanks for having me, Jason. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>Absolutely. So let&#8217;s just kind of jump right in and the same way I typically do with every guest. Tell us a little bit about your backstory, how you came to be, where you came from, what you&#8217;re doing, all that good stuff.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Yeah, sure. So I was in the air force for 10 years and before that I was a failed musician, a failed musician from for about, oh, I&#8217;d say, what did I do about 15, 16 years I was a working musician. Never really made it. So when I got out of the air force decided to work a, I&#8217;m sorry, let me get this. I didn&#8217;t know. This is supposed to be silenced. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>No problem. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Just want to get this off, cause it&#8217;s going to go off again. There it goes. So that&#8217;s off and you didn&#8217;t hear anything else, so we&#8217;re good to go. Okay, cool. So do you want to just start over?<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah, just pick up, like, after that, answering to that question, you can just start over. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> All right. Well, so I started my journey right after being in the air force for about 10 years. Before the air force, I was a working musician and throughout my air force career, I was working musician. And so when I got out, I finally figured out I was a failed working musician. So I decided to start a recording studio. And so the original rendition of my businesses, buzz biz studios, and I was a recording studio for starving musicians. And I realized within a year that living off of starving musicians was a horrible business plan. So I quickly pivoted into media production and my other passion, which is small businesses and just dealing with entrepreneurs. I just like the mindset of an entrepreneur and business owners. I connect with them at the same level. So it&#8217;s great. And so I started working with those and then over the years I started getting asked more and more marketing questions. And so it eventually evolved into a creative agency. And then a couple of years ago, you know, we&#8217;re about two and a half million, about 25 folks in-House 13,000 square foot facility, the whole nine yards. And I just looked at everything and I&#8217;m like, I hate my job. I own a job. I&#8217;m not a marketer anymore. I&#8217;m a CEO, I&#8217;m a babysitter, I&#8217;m a building manager, I&#8217;m everything but a marketer now. And it just, it wasn&#8217;t where I was at and my brain wasn&#8217;t liking it. And so I decided to restructure my entire company and I broke it all down into two different divisions. And I kept the media production for my legacy clients. And then I pushed forward with a new brand called buzzworthy integrated marketing, where we only focus on the digital marketing for small businesses and the web development for those campaigns. And that&#8217;s all we do now. And I just love it. I have 10 folks now that worked for me, but we went completely virtual. So everybody has their own home offices, both my W2 and my 1099 contractors. They all work the same way. It was just a matter of like who wants what as far as how they like to get paid. And so we&#8217;re just kind of have a very different culture now and I get to be a marketer on a regular basis, which is beautiful.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>That&#8217;s awesome. I can definitely relate to a lot of, kind of what you&#8217;re saying. One thing I’ve got to throw out there, you said air force. So one of our clients is the air force. About six months we worked with the Pacific Northwest division with their recruiting and we ran their social media efforts to help with recruiting. And I mean, it went really well, but it was just one of those bureaucratic things where they ran out of budget. They could only pay a certain agency, a certain amount over a certain period of time. So it didn&#8217;t end up lasting beyond that, which was really unfortunate because we were just killing it for them. Man, I mean, I loved doing that and you know, hopefully there&#8217;s an opportunity for us to kind of work with them again. So had to throw that out there.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> No worries man, federal, I’ve done some federal work and contracting is a pain, when I was in, I actually had a side job. I flew on Awacs . So I was what they call a flyer. And so when you&#8217;re a flyer, you don&#8217;t fly every day. And on mine as a big plane, we only flew a couple of times a month when you were home. So you had a side job, and it was an additional duty as we called it. And resource advisory is their kind of accounting thing. And we dealt with people dealing with that kind of stuff. And it was like the contracts, all of the stuff that they have to jump through is ridiculous. Just to get a contract and hold on to is ridiculous, but you&#8217;ll probably get another chance.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Hopefully, I would hope so. You said some interesting things there, I kind of want to dive in, personally, just from my own experiences. I&#8217;m curious about your team makeup. You mentioned how you had a mix of W2 and 1099 folks. How did that, as you kind of grew as an agency, how did that navigate, did you kind of come out with kind of hiring both or do you kind of let the prospects of the people that you were interviewing kind of dictate, which they prefer, I&#8217;m curious how you navigate how you build your team and how they fall under umbrella or the other?<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Okay, good question. And so when I was reorganizing the company and we went virtual, I had to dive into the tax code and there&#8217;s a lot of reasons why employers love to have 1099 because it costs you about 12% less on the dollar to 1099 somebody. You have a lot less control over that. So there&#8217;s these pluses and minuses of having one. When I originally did it, you know, I&#8217;d look at all right, who are non-essential or who are essential to my business. If I didn&#8217;t have them, would I still be able to work? Can they work for multiple Mes? Because that&#8217;s kind of where that definition goes. So my first, like my first three regulars were 1099 contractors because I didn&#8217;t have a lot of hours for them, enough hours for them to be a full-time position. And in my reorganization, I didn&#8217;t have any benefits. With the Obamacare that was one of the things that hurt my creative agency was that Obamacare was cheaper than our group healthcare. And I was like, you know, we&#8217;re all wasting money here and you could get better care. And in my venture to give them the best for my team, I actually cut my nose off despite my face, and ended up with the people like, well, why would we work for you then? Like you have no benefits. I&#8217;m like literally trying to help you people. So anyway, so I have one, so to answer your question, I kind of go with the flow as far as how many hours there are going to be. And does it, is it beneficial for them because I’ve just decided it doesn&#8217;t matter what I want. I need somebody to do work and I have a certain amount of money to give them. And I don&#8217;t, I used to say, well, if you&#8217;d like to make 10% more, I’ll do a 1099. And I don&#8217;t have to do all the paperwork at the end of the year, but now I&#8217;m like, whatever you&#8217;re comfortable with. So I have an account coordinator that lives in Massachusetts, never worked. She&#8217;s been out of the workforce for a long time. She&#8217;s getting back in and she doesn&#8217;t know anything about 1099. She doesn&#8217;t understand self-employment tax, all this stuff. And I&#8217;m like, we&#8217;ll just put you on a W2 and you&#8217;ll never have to worry about it. And it makes her very happy teammate. So really, I don&#8217;t have a hard and fast, like, you know, who can be, except for like my executive assistant. She has to be a W2 because there&#8217;s very specific things I need her to do in a certain amount of time dot, dot, dot, dot, dot. Even though she&#8217;s not full time. Because we don&#8217;t need her full-Time. That was one of the things that I realized when I reorganized my businesses. If I don&#8217;t have an on demand firm, I don&#8217;t need to have somebody on the phone the whole time. So if you can do on demand hiring, then when you&#8217;re busy, you&#8217;re paying more. But when you&#8217;re busy, you&#8217;re making more. So now your variable costs come with it. Where, when you have a salary, man, you&#8217;re stuck with that. And if you don&#8217;t fill their time, that&#8217;s sunk cost and you never get it back. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>It&#8217;s really interesting. I have the same mindset as you. So I built a team of folks that, I just feel like we live in a different world. I think that especially, I mean, the pandemic kind of, kind of pushed it along further and faster, but a lot of the people that I come across are not, they&#8217;re fine being 1099. The like to have that freedom of diversifying their income and not being an employee or being controlled. They&#8217;d rather be paid more and make their own choices about how they invest in long-term savings or how they facilitate health benefits. Like a lot of the folks, I have a predominantly all woman team and all of them either stay at home moms or, you know, they just want to have a career and be able to be around their families. They get health benefits from their spouses. So they&#8217;re like, I don&#8217;t need that from you, pay me more. So I&#8217;d like, very much like you, I let the people dictate what&#8217;s important to them and do what&#8217;s best for them. And ultimately that&#8217;s predominantly how it&#8217;s played out. Now, you know, there&#8217;s legal and tax, like all that stuff I&#8217;m still trying to kind of dig through. But eventually I know I have to kind of be able to offer both, but it&#8217;s interesting to kind of get perspective from, from someone else that&#8217;s kind of going through that. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> I think that my team is predominantly, I think I have me and one other gentleman and the rest of them are females. And I would say out of those, the two W2&#8217;s have husbands and the rest of them, don&#8217;t, the rest of them have a mix of husband and single, but they also have other clients. So I&#8217;m like usually the biggest client they have. And then they have other work that fills in when I&#8217;m not keeping them super busy. I think the biggest thing with remote working is that people think, well, they&#8217;re not working with me in my office. Now they can be 1099. That&#8217;s not always the case. So it&#8217;s good that you&#8217;re doing that research and keep researching because they keep changing the laws. Just stay ahead of it. That&#8217;s all you can do.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah. No, my guiding lights always just been take care, take care of your people, do what works best for them and take, you know, just treat them really well. And the loyalty&#8217;s there, the hard work&#8217;s there, it doesn&#8217;t matter how they&#8217;re classified or categorized as long as they feel like they&#8217;re being compensated fairly and they&#8217;re happy, you know, they have a good work-life balance. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Well, I got lucky because I went remote a year before a year and a quarter, like 15 months before the pandemic hit. So I didn&#8217;t have to do a lot of the scrambling a lot of these other firms had to do. But my culture changed tremendously from having an all in-house W2 staff to having predominantly [11:31 inaudible] 1099s. But I’ll tell you the biggest thing is your processes. Like you can&#8217;t scale without those processes. And that&#8217;s something even now I&#8217;m like trying to rewrite all of my stuff that we&#8217;d had for 15 years of documentation. It&#8217;s like, all of that goes out the window because now you don&#8217;t have a building. You don&#8217;t have all of these other positions. I was able to get rid of 40% of my positions without having to not needing a building. I got rid of 70% of my overhead that wasn&#8217;t tied to payroll when I got rid of my building. And now I&#8217;m like, how do I do it without a building? Like co-workspace and home offices?<\/p>\r\n<p><strong>Jason Yormark: <\/strong>I mean, I can&#8217;t fathom. It&#8217;s interesting. Cause we were virtual to start, about a year or two before the pandemic hit. And I had that vision in my head that traditional path. Okay, well, we&#8217;ll start there. We&#8217;ll build up, we&#8217;ll get the office space. We&#8217;ll do the whole, you know, do the whole song and dance. Then the pandemic head and just kind of like forced us, keep, stay the path. And then we just started getting really good at what we did. Like the virtual thing was working, you know, and it allowed us to be more competitive on price. We were figuring out process and ways to build culture in a virtual environment. I stopped thinking that I had to have this big fancy office to impress clients and I started to spin it and say, no, actually virtual is better. And here&#8217;s why that benefits you. And now we&#8217;re at a place where like, we embrace that, and I can&#8217;t even fathom ever thinking about taking on the expense of some big office. I just think we live in a different world and I think it&#8217;s going to dramatically change, especially when it comes to agency life. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> I Agree with you a hundred percent. I mean, it wasn&#8217;t too long ago. I had a $15,000 mortgage payment a month, you know, and that was not including the everything else that goes along with it. And the coffee is like, you know, you&#8217;ve got 25 people and they want three different types of coffee and all the other things that go along with that. And it&#8217;s just like, it&#8217;s so much easier to pay them a little bit more to be at home. I give my folks a stipend for their computers every year. So I have, you max out at a certain amount. And so if you work this many hours, you get this, that&#8217;s a percentage of the hours available and you get that what you get for your stipend. And then that way they, you know, I&#8217;m promoting them working from home and providing them a benefit for working from home, besides just the flexibility of it. Like we have soft phones for everything. Nobody has a hard phone unless they absolutely need it. I have one in a drawer that I can send to somebody to do an IP, you know, VoIP phone. But other than that, everybody&#8217;s on their cell phone. So they can be in the grocery store doing whatever they need, and they can respond to Google chat and do all that stuff. So I mean that right there is like the freedom that people want, but without the headaches of entrepreneurs, like most of my employees that my contractors are folks who just don&#8217;t want to sell anymore. They don&#8217;t want to deal with the clients billing and all these other side. Like, can I just work for you and do the work? I&#8217;m like, yes, that&#8217;s exactly what I need.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah. You said a word there recently that is our, it&#8217;s the biggest word in our vocabulary. And it&#8217;s, to me the most powerful, it&#8217;s more powerful than money. It&#8217;s more powerful than time, time kind of relates to it. But you said freedom. And I think that&#8217;s been, that has been my driving force in how, and what drove me to start this and to build this team was I wanted freedom. Yeah, do I want to make a lot of money? Sure. Who doesn&#8217;t? You know, but at the end of the day, it was like, I want to be free. I don&#8217;t want to be forced to sit in a car three to four hours a day going to work. And I don&#8217;t want to be tied and chained to a desk because that&#8217;s where you&#8217;re supposed to be. I want to be able to go wherever I want, work when I want, you know, controlling that faith. Freedom was such, that was it for me. And now that has been an incredible currency and the team that I built because everybody that I brought in, that&#8217;s what they want more than anything. If you tell them to stack rank like the benefits of what they like, it&#8217;s freedom. It&#8217;s the fact that they can go anywhere in the world and still do their job. Fact that I don&#8217;t tell them that they have to work certain hours. To be in control of your own life like that is the most powerful thing. One of the most powerful things in the world, because they value that so much and you know what that costs me? Zero dollars.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Actually makes you money. Cause I find like my webmaster has stepped up so many times over and over and over again and is selfless with the hours I give her so that we can have more diversity on our team. And it&#8217;s like, I never asked that from her. And I would never ask that of any contractor. She just does it. You attract the type of person that you want when you are authentic to that. You know, and I probably work harder than anybody in my business now, but once I get it automated to a point where I can delegate the responsibility of making decisions for clients on a regular basis, I&#8217;m taking my wife to Machu Picchu for her 40th birthday in November. I have a deadline, I have to be gone out of the country for 3 weeks. And she wants me off the phone for two of those. So that means I can&#8217;t touch my business. And so have you read anything by Mike Michalowicz? <\/p>\r\n<p><strong>Jason Yormark: <\/strong>I have not. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Okay. So there&#8217;s a guy named Mike Michalowicz, he&#8217;s a business book author. He wrote the pumpkin plan, which is great for starting entrepreneurs. And then the one that I got into was his profit first. And then what we&#8217;re talking about is his book clockwork, which basically allows you to helps you build an efficient business that then allows you to be able to take off a month, a year without touching your business, looking at your business and coming back with more clients, happy clients, it&#8217;s like it&#8217;s grown without you so that if you wanted to take another month off, you could, right. That&#8217;s freedom. That&#8217;s freedom. Yeah. Yeah. Well, it&#8217;s a good book.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Cool. You mentioned culture, I&#8217;m kind of curious. That&#8217;s certainly been one of the challenges is how do you build a strong culture. Look at the end we know that, you know, I would choose this path and this environment over the traditional one all day, every day, but there&#8217;s advantages and disadvantages. When you&#8217;re not in the same room with people you miss out on, you know, the social ramifications of that. So I&#8217;m curious, what have you done, what have you learned and what steps or technology, or what have you put in place to kind of build a successful business and be able to kind of foster a culture in a virtual environment?<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> So one word is communication. Like your communication in a virtual realm is completely different than when you&#8217;re seeing people day to day. Like you can smile at one of your employees walking down the hall and they know that you appreciate them. You don&#8217;t have that luxury virtually. So you literally like, so we use Google Hangouts to do day to day just chatting, like, okay, we&#8217;re in the office, that&#8217;s what you do. And if you&#8217;re not available to chat, it just sits there until you are. So that&#8217;s great. So it gives them that freedom, the whole nine yards. But then I always turn around and I say, please, I say, thank you. When I see something that somebody has gone a little bit above and beyond, not a lot, just a little bit, I’ll be like, I appreciate you doing this more than you needed to. I appreciate you taking the extra step, that appreciation and that communication has to be conscious it&#8217;s because you can forget about it. And I will catch myself like, man, I haven&#8217;t said thank you enough this week. I feel it, you&#8217;re like, oh, why it feels so cold today? Oh, that&#8217;s why. Okay. I haven&#8217;t said enough of how much I appreciate my team around me. And that is probably the hardest thing, but it is there. My culture is always been one of having a client centric employees or team members, and is now where we call them with a team member centric company. So all you have to do is take care of the clients and all I need to do is make sure that you can do that at the best of your ability. Everybody wins from the company down to the client and back. And that right there paired with a term I borrowed called constructive dissatisfaction. There&#8217;s nothing anyone can&#8217;t do, period. There&#8217;s more business out there than all of us can try to do. And so I always say like, I want more good firms out there so that they can drown out all of these hacks that are trying to just collect money from Unknowing people, you know, with the next big, you know, I’ll guarantee you this, guarantees and marketing, then you&#8217;re a fly by night, right? Like let&#8217;s talk about things actually move the needle and go that way. So I’ve always said, take care of the client and the money will follow. And so then I built my culture around that and just make sure that I communicate it now in a way that they see it. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>No, I love that. I think, so I can relate to all that. Some of the things that we put in place that have just created an amazing culture, it&#8217;s just, you know, it&#8217;s just some technology plays like, you know, using slack, but we use this program called Bonus.ly, bonus.ly it&#8217;s integrated in there. So I’ve empowered the team to kind of recognize each other quickly and easily, you know, just rewarding them. They can reward each other for just that, the smallest things of the biggest things. And, you know, they get like an allotment every month to kind of share and so they can trade it in for gift cards. So that&#8217;s been huge.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> That&#8217;s cool. A little gamification then. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah, it is. And they love it. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> That&#8217;s awesome.<br \/><br \/><strong>Jason Yormark: <\/strong>And, you know, for a couple of hundred bucks a month, you empower the team to kind of reward each other. It&#8217;s just takes it a step further than just you doing as a business owner. You&#8217;re doing that for them. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> I love that. I love that. And I also, another thing that I’ve done just recently, we just hired a new web tech and I let my webmaster, a 1099 actually do all of the first round picks and interviews. And I chose from her top two is who I chose. And she like, that right there, we talked about, we had a failure to launch on this guy’s predecessor and I was like, so what would you do differently? Like, I always, you know, get feedback from the team, you know, when I feel like I could do better as a leader. And she says, well, can I be a part of the process? I said what if I make you the process and I just clean up at the end and she says, you would do that? I was like, yeah. And that trust that she will pick somebody that&#8217;s going to work better for her, and which means it&#8217;s going to work better for me and the clients. I mean, that&#8217;s priceless.<br \/><br \/><strong>Jason Yormark: <\/strong>Yeah. Empowerment, you know, just empowering your team to feel like they have some skin in the game that they&#8217;ll go so far into getting people to just naturally and organically want to do more than what their job specifically states. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> But you don&#8217;t usually give a contractor that kind of empowerment. They&#8217;re usually transactional.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Oh yeah. And that&#8217;s the environment I&#8217;m in. I have to be careful what I say, because it&#8217;ll probably come back to bite in ass. But I mean, I have contractors, but I mean, I treat them like employees in the sense that I don&#8217;t look at them as just a resource.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> You are not a vendor. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah. I take care of them. I still, that&#8217;s an environment on paper that makes sense for them, but I still treat them like, they&#8217;re a part of the business and that they have skin in the game. You know, it&#8217;s just a different world.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> I mean, we, I mean, really, if you think about it, look at your best clients, how do your clients treat you when you do a really good job? They nurture you. I mean, I’ve got, you know, some of my best friends today are clients that I’ve had for a decade. You know, you just become that people you work with on a regular basis, and you do business with people you like and trust. And so I think it&#8217;s natural to have a contractor become part of the family, if you will.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>No, absolutely. Before we kind of dive into some, I want to talk a little bit about this rule of 26 that you talk about. But before, I want to wrap up this, the agency side of things, like when you look back at what you&#8217;ve done as an agency owner, you know, just imagine, cause I think that there&#8217;s aspiring or early stage agency owners that listen to this, what are some of the things that you look back that you would have done differently? Or what are the things that really stand out that really helped you propel the agency to where you guys are at? <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Oh Man. So many lessons. You know, I used to be in these masterminds and people would always talk about niching and focus and all these other things. And I always thought, you know, being a small business agency was good enough. And so, since we did all these things, we were able to be this one-stop shop and all these other things. And what my company has become has been extremely niched. And to the point where it&#8217;s like, I felt like there was too much offering in one brand, I actually broke it into two different brands so that each of them can focus specifically on those, the processes and stuff like that. So number one is niching and niching to an industry or niching to a size of business that you want, or a style of business. So like I focus on service-based small businesses, and if you&#8217;re not in that realm, you got to convince me to do work with you for you. Otherwise I refer you to somebody else because it&#8217;s not there. It&#8217;s so much work to try to get all of the business that you&#8217;re not ready for. If you get a lot of requests for it, that&#8217;s great. Put that feather in the cap and go, you know, how many times am I going to hear that before I make a service out of that, but then you do that, calculate it. And instead of saying yes, and then figure it out later, that&#8217;s where you lose so much money. So much time, effort, you know, quality of life, everything just goes down in the crapper. And I watch young agency owners do that. They&#8217;re like, oh yeah, I just got my first dot, dot, dot. I&#8217;m like, I didn&#8217;t ever, I never heard you talk about that. Well, they asked about, and you know, I don&#8217;t want to say no, like, yeah, you actually do want to say, no, they&#8217;ll respect you more later when they&#8217;ve had a bad experience and they say, you know what, now I do that. Oh, great, you&#8217;re prepared to do that instead of sucking at that. And now you&#8217;ve wasted all of that trust they had in you. So I think that&#8217;s the biggest one there. And then number two, pay yourself first. Profit first, I used to give out Michael Gerber&#8217;s E-Myth to help businesses understand why they needed me. Now I give folks, I tell people about profit first because every business should do their accounting this way. And it&#8217;s really paying yourself first, regardless of what that percentage is, you are always paying yourself. Cause I spent 15, almost 16 years not paying myself first. I had people that made more money in my company than I did, and they didn&#8217;t even work as much as I did. And that right there is a big disjustice. Time, time is a commodity that entrepreneurs give away so often, and it&#8217;s a one commodity you cannot replace. And so just respect yourself, pay yourself first and give yourself the respect. I mean, that&#8217;s all it is, is like you have to value yourself more than that business, make that business work for you. Not you work the other way.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah. I&#8217;ve approached it that way for sure. I mean, you got to, I always wanted to make sure that foundationally, we were in a good spot before I pulled people in and started paying them because even though they might be 1099s, I wanted to be able to meet assuming that they do a good job, and they deliver results. I want to be able to maintain that commitment to them and build off of that and never have to pull it back because I grew too fast or I pulled too many people in. Certainly, part of that is, you know, you got to take care of yourself, cause if you don&#8217;t do that, that&#8217;s going to come back to bite you in the. Cause then you&#8217;re going to start asking yourself, why am I doing this? <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> And I think that you bring up a good point though, is that, you know, creating that foundation is all about systems. And I have always struggled with that just because, you know, when I was much smaller when I only had four or five of us, you know, it was easy. I was the guy, you know, boom, boom, boom. And I never took time to document my thing. So now I use this a program called Trainual and we now are documenting, and it makes it so much easier to swap people out. Cause contractors do come and go, and they don&#8217;t always work. But if you have this, it&#8217;s a lot easier to bring somebody on. Because a lot of times I would hold on to people because I&#8217;m like, man, I can&#8217;t lose all that knowledge. They&#8217;ve been with me for three years, No, no, no, no. Or instead, and you know, towards the end, when we had everything lined out, I was like, oh, that&#8217;s great, you want to go and do that. I celebrated them taking on another job and that told everybody else there that, Hey, listen, [28:23 inaudible] wants us here if it&#8217;s good for us, he&#8217;s not trying to hold us hostage. And I think that&#8217;s really good for culture as well, but that documentation is the only way you can do that. <\/p>\r\n<p><strong>Jason Yormark: <\/strong>I love it. Okay. Before we wrap anything up, I want to kind of dig in a little bit to this thing you call the rule of 26. We were talking previously about how we both defined small business. I think that&#8217;s open to interpretation, but share a little bit about your insights about how you define small business and this rule of 26 that you talk about.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Sure. So small businesses is, it&#8217;s such a vague term, right? And it depends on who you talk to. If you talk to the government, it&#8217;s one thing, you talk to lenders, it&#8217;s another, if you talked to us, even you and I were thinking, you know, oh, if you&#8217;re a million dollar, you&#8217;re not a small business. I&#8217;m like, yeah, you are. And then it&#8217;s like, what does it look like? And so I usually look at it as like the size of the business, right? How many employees do they have? How many leaders does it take to run the business? So I have an $11 million client that is run by a divorced couple. It works. Don&#8217;t ask me how. They&#8217;re both getting, they are both getting remarried. But they&#8217;re seasonal. So they run a landscaping company. So they do most of their business and about seven, eight months out of the year or six, to seven months out of the year. And so that means that they go from a hundred employees during the summer down to about 20 and back and forth. And some people would think 20 employees, well, if you&#8217;re doing labor work, you never see those people at the office. They&#8217;re out there. And the only people who are in charge are those two people and maybe one or two project managers. So at best they got a staff of four. That&#8217;s a small business, even though they bring in $11 million. Think about it this way. How many people does a podcaster who brings in a million dollars have? One person, probably one, maybe two people, right? That&#8217;s a small business, even though they might be grossing $4 million a year, they&#8217;re still a small business. So I look at it that way. I don&#8217;t look at the money they&#8217;re bringing in. I look at how they operate their business. So one of the things that I deal with is I usually only deal with the owners because they&#8217;re the ones that get the money at the end. And so one of the challenges over the years is like to try to help them understand KPIs. And if you go to like a HubSpot, they&#8217;ve got like 68 key point performance indicators. And I&#8217;m like, nobody&#8217;s paying attention to 68 KPIs. It&#8217;s stupid, right. And if I told my clients, Hey, these 10, we&#8217;re going to look at, right. So I decided I needed to find a way to really bring it down to lowest common denominator. And I created the rule of 26. And the rule 26 goes is strictly for working to make your website a money-making tool in your marketing toolbox. So I did the math and I figured out that if you increase your traffic, your conversion rate and your average value per purchase or average value per client life by 26% each, you will get 100% increase in your revenue from your website. That&#8217;s a really easy thing to do when you chunk those down at those three steps and they can understand. So I just need to get if I have a hundred people coming to my website, I get 126. Okay, great. We did that. All right, so I’ve got a 1%, now I need a 1.26% conversion rate. Okay. We got that. All right, the value of my clients is a hundred dollars. Now I need $126. Boom. Got it. And now I&#8217;m making twice as much money as I ever was with the, and you do it again. So it&#8217;s like, okay, we did that. Great. Now let&#8217;s do it again. And the bigger you get, the harder that 26% gets. And there&#8217;s other things you can do to do that, but for a small business, to tell them three things, and that&#8217;s all you get to focus on. As a digital marketer. Now I have three objectives and they know if I win or not, because they feel it in their pocketbook.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Yeah. Now we take a similar approach or philosophy like around reporting oftentimes, the air force is a perfect example. They came to us and they&#8217;re like, we were confused. We don&#8217;t know what&#8217;s going on. And then they shared the report that they had been getting on a monthly basis with their previous agency. And it was like this 30 page report with a bunch of nonsense in them, and I&#8217;m like, I can&#8217;t even make sense of this. Like a client&#8217;s going to look through this. And I&#8217;m like, that&#8217;s horrible. And that was the part, I mean, part of the reason of looking, they just, they didn&#8217;t know. And they were being overwhelmed by crap that didn&#8217;t matter. And that&#8217;s the approach we take with [33:09 inaudible]. Like we create a really customized dashboard that just gets to the point of the things that matter to that business and just simplifying it so that they don&#8217;t have to spend a ton of time trying to figure out what should we be thinking about, what should we be paying attention to. I think that that&#8217;s where a lot of agencies slip is that they think, oh, I’ve got to present this massive thing that demonstrates all the depth and breadth that we have of knowledge around marketing. <\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Building value. <br \/><br \/><strong>Jason Yormark: <\/strong>That is not what clients, you know, that&#8217;s not what they&#8217;re looking for. They want to just, what is it that they can just, you want to make their life easier. And there&#8217;s so many situations where that doesn&#8217;t happen.<\/p>\r\n<p><strong>Michael Buzinski:<\/strong> Well, I think that you have a lot of agencies that like to fluff up the numbers so that they can, if you have enough KPIs, something&#8217;s up higher than it was before, so then you focus that is the win versus, Hey, listen, none of the key, the actual key KPIs, the three, for rule 26, these three things none of these increased where we wanted them. Why not? It&#8217;s okay not to win every month, as long as you learn. And it&#8217;s like, okay, well, we tried this, this didn&#8217;t work the way we liked it. We&#8217;d like it to work for you. So we&#8217;re going to try this now. Okay, great. Let&#8217;s keep going that way. And you keep that there. So being vulnerable to that, not winning every time I feel allows you to be more, give more clarity to your clients. Instead of trying to hide behind, I did a blog on one that was like, don&#8217;t go chasing KPI waterfalls is what it was called. And it was like, you know, you just don&#8217;t like, that&#8217;s all fluff. And there was a time as an agency owner that I allowed my staff to do that, like, Hey, how did this client do? Oh, well, you know, the one thing that our main objective didn&#8217;t quite get there, but we have these KPIs that are showing progress towards it. I&#8217;m like really? Is that really? Or are you just trying to keep your job?<br \/><br \/><strong>Jason Yormark: <\/strong>Yeah. I love it. Love the TLC reference. First one of the podcasts. I can&#8217;t imagine we get another, but awesome. I love this stuff. So just a couple of quick hits here. One of the things I love asking everybody, what&#8217;s a piece of technology, a gadget, a book anything that you&#8217;ve consumed or used recently that just kicks ass that that you recommend for folks.<br \/><br \/><strong>Michael Buzinski:<\/strong> Well, I think we already touched on it and that&#8217;s Mike Michalowicz&#8217;s profit first. You got to read that book. If you&#8217;re a business owner, don&#8217;t care what business you&#8217;re in that book will change your life. If he had wrote that book another five years earlier, I wouldn&#8217;t be where I&#8217;m at right now. And I&#8217;d be a lot more wealthier.<br \/><br \/><strong>Jason Yormark: <\/strong>I&#8217;m reading that. I don&#8217;t read a lot of books, but recommendations like that. [35:55 inaudible]. <br \/><br \/><strong>Michael Buzinski:<\/strong> eBook, make it an eBook. So you can take the notes because that&#8217;s the only way to do it. Cause he does walk you through it and he&#8217;s really down to earth, New Jersey boy. Real cool guy.<br \/><br \/><strong>Jason Yormark: <\/strong>Excellent. I love that. Awesome. Anything I didn&#8217;t ask you that you want to share with the audience that we touched on today?<br \/><br \/><strong>Michael Buzinski:<\/strong> Well, if you&#8217;re interested in what I was talking about with the rule of 26, go to www.ruleof26.com to check it out. That is a free download. You will put your email in, I will not spam you. I promise.<br \/><br \/><strong>Jason Yormark: <\/strong>You beat me to the last question was how can people find you so they can, obviously they can get that any other places that people can find you, or any of the stuff that you are involved in.<br \/><br \/><strong>Michael Buzinski:<\/strong> www.Buzzworthy.Biz is our main website. And that is actually in the midst of a rebuild. So you&#8217;re going to see something that&#8217;s been around for about two years. It was just kind of your generic firm, but we&#8217;re reinventing how we&#8217;re talking about digital marketing and being able to really display the DIY through DFY journey so that people can have a choose your own adventure with a digital marketing firm. So we&#8217;re really excited about that. And that&#8217;ll be out, let&#8217;s see probably right around the beginning of June.<\/p>\r\n<p><strong>Jason Yormark: <\/strong>Okay. Awesome. Well, thank you so much for carving out some time. Awesome stuff. I love talking to other agency owners, these episodes, I think they&#8217;re going to go one way and they go in another and that&#8217;s just shows that they&#8217;re organic and not scripted. And that&#8217;s the way they need to be. I love it when that happens.<br \/><br \/><strong>Michael Buzinski:<\/strong> It great to talk with you, Jason. <br \/><br \/><strong>Jason Yormark: <\/strong>Absolutely. Thank you so much. Yeah. Thank you so much for being on the show and that&#8217;ll do it for this week&#8217;s episode of Socialistics. Make sure you like, share, review all that good stuff. Thanks for listening. And we&#8217;ll catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment.  Learn more about Michael at https:\/\/buzzworthy.biz\/ Find Socialistics at www.socialistics.com    &nbsp; Jason Yormark: Hello and welcome to a [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7882,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics<\/title>\n<meta name=\"description\" content=\"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. \" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. \" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-31T15:00:30+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-07T17:30:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"33 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#webpage\",\"url\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/\",\"name\":\"How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#primaryimage\"},\"datePublished\":\"2021-05-31T15:00:30+00:00\",\"dateModified\":\"2021-05-07T17:30:21+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment.\\u00a0\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"How To Build A Scaleable, Culture Rich Virtual Agency Team\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics","description":"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. ","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/","og_locale":"en_US","og_type":"article","og_title":"How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics","og_description":"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. ","og_url":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-05-31T15:00:30+00:00","article_modified_time":"2021-05-07T17:30:21+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png","size":"full","id":7882,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"33 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/04\/The-Incredible-Journey-Of-A-19-Year-Old-Agency-Owner-4.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#webpage","url":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/","name":"How To Build A Scaleable, Culture Rich Virtual Agency Team - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#primaryimage"},"datePublished":"2021-05-31T15:00:30+00:00","dateModified":"2021-05-07T17:30:21+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week I sat down with Michael Buzinski from Buzzworthy Integrated Marketing and we dove into the challenges and strategies in being able to build a high performing, culture rich agency time in a virtual environment. ","breadcrumb":{"@id":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/how-to-build-a-scaleable-culture-rich-virtual-agency-team\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"How To Build A Scaleable, Culture Rich Virtual Agency Team"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7879"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7879"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7879\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7882"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7879"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7879"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7879"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}