{"id":7967,"date":"2021-05-17T08:00:16","date_gmt":"2021-05-17T15:00:16","guid":{"rendered":"https:\/\/socialistics.com\/?p=7967"},"modified":"2021-05-17T09:45:39","modified_gmt":"2021-05-17T16:45:39","slug":"inside-the-world-of-agency-sales","status":"publish","type":"post","link":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/","title":{"rendered":"Inside The World Of Agency Sales"},"content":{"rendered":"\r\n<p>This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What&#8217;s worked, what doesn&#8217;t, and the wins, losses and challenges we&#8217;ve been facing trying to grow our social media agency. <\/p>\r\n<p>Learn more about Socialistics at: <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8478805\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8478805-inside-the-world-of-agency-sales.js?container_id=buzzsprout-player-8478805&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p><iframe title=\"YouTube video player\" src=\"https:\/\/www.youtube.com\/embed\/eKffoL-G-SI\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\r\n<div class=\"page\" title=\"Page 1\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p>&nbsp;<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Hello, and welcome to another episode of the socialists podcast. This is Jason Yormark. Thank you for listening. We&#8217;re going to switch things up this week a little bit, and normally we have guests, but I think it&#8217;s kind of good to kind of take a step back and kind of talk about how the agency&#8217;s going and who better to help me navigate that conversation than one of my trusted and awesome teammates, Ashley Ohl, who is our now she&#8217;s our director of business development, which is a relatively new role for her, but we&#8217;re excited to have her on the show again, welcome to the show, Ashley.<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> Hi, excited to be here again and in a different role this time. Last time we got on this, I was doing more of the content management and account management and have been loving my transition into business development over the last couple of months. So super excited about this new chapter in my Socialistics career,<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Me too. Because it&#8217;s going to make my life easier, which is a good thing. So for those of you that listen, that have agencies or thinking about having an agency, one of the interesting transitions of an agency when it&#8217;s successful is that the owner or the person that starts it, you have to kind of start to remove yourself from running the business and trusting others to kind of do some of the things that you&#8217;ve got kind of grown accustomed to doing. And that&#8217;s kind of where Ashley&#8217;s kind of comes in for us now. I kind of thought that, you know, oh, we&#8217;re going to have to hire a salesperson, which is a whole difficult thing to navigate. And the fact of the matter is Ashley was the perfect person to kind of step in and take some of those sales responsibilities off of my plate. And she&#8217;s fantastic at it. And it&#8217;s awesome to have somebody that can kind of come in and do that that&#8217;s familiar with what you&#8217;re doing instead of bringing somebody in new, who&#8217;s going to have to kind of get ramped up. So Ashley, tell me what, since starting this role what&#8217;s been the most, what&#8217;s stood out more than anything in terms of something that you&#8217;ve learned or just something that you&#8217;re really excited about or just something that stands out altogether.<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> You know, one of the biggest things I have done other sales have had other sales roles in my career, and I’ve always said, definitely not a used car salesman. I can&#8217;t sell you something if I don&#8217;t believe in it. But if I believe in it, I can sell the crap out of it. And that passion really is what drives my motivation. But the cool part about this role is I am selling Socialistics as a product, but I have had the experience and everything, but the paid part of the agency. So I can fully talk to prospective clients about what it is like working with our team, because I have been a part of that team. And I know what the client experience is. I also know the types of clients that our team wants to work with, and what&#8217;s important to them when finding a new client and what do we need from a potential new client for it to be a good fit for socialistic. So being able to be armed with all of that information from both sides has been an exciting part of getting new clients and talking to them, because I feel like I&#8217;m bridging the gap between potential new clients and our team. And it helps me sell better because I can talk about everything with full confidence and in full confidence of my team, I am not just selling a product and having new clients come on and then like, oh, well, it&#8217;s not my problem anymore. I&#8217;m fully invested in that process. So that&#8217;s been the most exciting part of this new role.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 2\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Jason Yormark:<\/strong> Good. I like it. So what&#8217;s, I know obviously I’ve been knee deep in, you know, having these conversations with potential clients and, you know, one of the things that we&#8217;ve kind of graduated towards is kind of being in a position to be more selective about who we work with and making sure that we just don&#8217;t take everything that we could get. And obviously not everybody&#8217;s in that position, a lot of agencies that start to have to kind of take whatever they can get, but seeing that we can be more selective, it&#8217;s become interesting to kind of see what the signals are for when something, maybe isn&#8217;t a good fit for us. And in your first month or two of doing this, you know, what have some of those signals been for you, or how are you navigating those initial conversations to kind of determine if a client&#8217;s a good fit? Like, what are the things that are red flags that have come up for you?<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> Yeah. So there are a lot of times that I end up comparing agency life to dating. And I feel like anytime you meet somebody new, at least in my history within a couple of minutes of talking with somebody and getting them on the phone or seeing them on a zoom call, I can tell if it&#8217;s going to be a good natural fit or not. So I think having that emotional intelligence and picking up on maybe some awkwardness or, you know, they&#8217;re really stiff in their communication, at socialists we are all about building relationships with our clients. So if we can&#8217;t have that natural communication to begin with, then it probably isn&#8217;t going to be a good fit. So I usually try to start the conversation with kind of just, you know, talking about life or trying to let them loosen up and open up. And if they&#8217;re resistant to that, then I&#8217;m like, maybe this isn&#8217;t a good fit. If we have this banter back and forth or communication in these first couple of minutes, then how are you going to communicate with my team. When their stuff is good or when things are bad, if that initial communication does not feel natural it probably won&#8217;t be a good fit. You know, something we talk about a lot of new clients have really lofty goals and what they want to do, and not always, you know, they don&#8217;t always have the budget to back that up. So I think managing expectations and seeing how a potential new clients take that feedback. You know, if we try to bring them back to reality a little bit on that is how we can manage their expectations about what we can do for them.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 3\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Jason Yormark:<\/strong> Yeah, it&#8217;s an interesting around the strategy piece. We&#8217;ve noticed that a lot of times when we have those initial calls with folks, they, you know, they want a really deep strategic analysis of their situation and, you know, traditionally like, that&#8217;s, you pay for that. And I think more and more clients are kind of approaching us with, you know, they kind of, they want that to help them make a decision. And while to a certain extent, I can understand that at the same time, you can&#8217;t just, you know, manufacture a strategy for somebody quickly and easily and not everybody&#8217;s the same. It takes time. And, you know, if you&#8217;re a successful experienced agency, you know, you&#8217;re going to spend 10, 15-ish hours digging into their ad accounts and really doing a deep dive and flushing out a strategy that makes sense for them. That&#8217;s a lot of resources and time that goes into that sort of thing. So but I think, I think you can agree with this. We&#8217;re starting to experience that. I mean, agency life, It&#8217;s competitive. I think more and more agencies are bringing more to the table and offering to do things that may be most would typically charge for. So it gets tough to compete when you may be have agencies that are willing to spend, you know, 10 plus hours developing a strategy to win a piece of business. You know, it&#8217;s all relative. If you&#8217;re talking about, you know, six figure contract versus somebody that&#8217;s maybe spending, you know, a thousand bucks a month, it&#8217;s, you know, obviously you&#8217;re going to pick and choose your battles, but you know, we&#8217;ve had to really kind of take a deeper look at how do we compete, how do we make sure that we put our best foot forward and how do we help them navigate, you know, what&#8217;s a typical process for, you know, vetting out agencies and what they should expect. But I think it&#8217;s evolving quite a bit in terms of what we have to do to be able to compete. But I know that you&#8217;ve been, Ashley has been pretty involved in kind of taking our pitch deck to a 2.0 version. So what are some of the things that have kind of stood out for you in terms of what we&#8217;ve had to kind of evolve with or what you think you know, we&#8217;re going to need to do moving forward to continue to compete?<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> Yeah, no, I think changing platforms was a huge step for us to be able to have a little bit more of a sexy pitch deck and feel a little bit more updated. So I’ve been loving getting to know Qwilr and getting to you know, take that to a next level. But when you said, you know, I&#8217;m going to go back to what you said about prospective new clients wanting a lot of strategy in the proposal. You know, I think unfortunately what I’ve learned from some of my conversations with new clients in the last month or two, was that a lot of them have been burned in the past and they kind of want something to help ease their anxiety and stress of trusting somebody new with their social media. Again, in a lot of times we have to come in and kind of clean up what the last agency did. So I think, you know, being able to provide a level of strategy, competitive analysis, and information about how we break things down and how we tackle each client, we need to add that in there, but in a way that isn&#8217;t over promising. Because a lot of times until we get in there, until our paid team and our content team can test things and try things out, we really don&#8217;t have a good idea of exactly what we are able to accomplish. And I think we need, you know, there needs to be part, you know, changing our proposal deck a little bit to give prospective clients more of what they want, but also the education piece of even though social media is an instantaneous platform and people are posting things in the moment that from the paid side of things, in the strategy side of things, it&#8217;s still like traditional marketing where we need the AB testing and we need, you know, a couple of months of data to really be able to hone in and take their social media to the next level.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 4\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Jason Yormark:<\/strong> So for those of you that may be watching on YouTube, we&#8217;re testing a new platform here called Ecamm live, which has this cool feature where we can, I can swap cameras. So I just tested it with Ashley. I think it&#8217;s working. So I click a button and then it&#8217;s just me. And then I click a button and it was just her. And then I can have both on there. So if you&#8217;re watching this on YouTube and it&#8217;s a little wonky, you know, cut us a little bit of slack, we&#8217;re still figuring out the video side of things.<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> You definitely made me nervous. I thought that I lost&#8230;I was like wait, where did Jason go?<\/p>\r\n<p><strong>Jason Yormark:<\/strong> I just realized that I&#8217;m like, she might not think that I&#8217;m not here, so it&#8217;s working trust me. And we got these cool sound effects here. I got a studio audience here. See, these are the cool things you can do before we were using, I was using squad cast to record podcast, and now I&#8217;m using Ecamm live, which was referred to us. And it&#8217;s pretty cool. So speaking of cool tools you know, we were originally using a platform called Proposify for our proposals, which has been great, you know, we&#8217;ve used it since day one. And I mean, there&#8217;s a lot of great things about it, especially from the business side, in terms of how it connects to CRMs and just it&#8217;s fantastic, but the delay out and that, like the design side of it was really prohibitive. It&#8217;s not really designed for like pitches. So I don&#8217;t know. We found, we used to do just proposals. Like we create a proposal and send it off and fingers crossed and with our follow-ups, and then it just seems so silly that that&#8217;s how we used to do it. The pandemic hits and the world changes, and we&#8217;re not doing as many in person things. And now, you know, everything&#8217;s got to be a pitch. Like it&#8217;s got to be delivered. Our philosophy is if a client isn&#8217;t willing to, you know, carve out 45 minutes an hour of their time to have you take them through a pitch then, are they really that serious about this? So that&#8217;s another good way to kind of vet whether, you know, an opportunity is a good opportunity. But the problem is Proposify is not really designed for presenting in real time. So we kind of went on the lookout for something that was just a little bit more visually powerful and design, and we landed on Qwilr, which we&#8217;ve been testing out and, and kind of enjoying, I mean, they&#8217;re not without the shortcomings on the business side of things, it&#8217;s like pick your poison, but it&#8217;s been kind of really cool to just kind of be able to kind of just do some visual things that just look better and feel a little bit more dynamic. I know, Ashley you&#8217;ve been kind of tasked with really kind of developing that side of things out, but you know, what are some takeaways that you&#8217;ve had in terms of that shift from Proposify to Qwilr and what are the things that you really like about what we&#8217;re doing now versus what we were doing that seemed to work more effectively?<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 5\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Ashley Ohl:<\/strong> Yeah, I mean, I think the biggest part is, you know, being a social media agency, it is all visual, social media is very visual. So having a proposal platform now that is in alignment with our creativity and you know, just being a little bit more artsy and fun. It&#8217;s also really cool to be able to have video in there. We can have video banners, we can have I know we have in one of my pages that I built, I have one of our socialist sticks videos for a client that I, a potential client. I pitched to last week. Some of their leadership team wasn&#8217;t able to be on the call when I did the presentation live. So I was able to record the zoom call, and then I was able to embed the video of the zoom call, right within the proposals, though, it just streamlines things. My other favorite thing about it is I’ve been able to, instead of just sending somebody to a link to my Calendly, I have been able to build a page that integrates my calendar, a little description about me. I can also, you know, sneak in a case study or two or a about our core values, or if we have a new blog posts, I&#8217;m able to, you know, they go to click to book a call with me, but then they also get a little bit of information you know, to back up what we do. But the cool thing is there are built-in analytics that track, if you know, somebody went to book a call with me, it would let me know if they also clicked on one of our case stories or the podcast or the blog. So I actually, I love that analytic part of things where we get to see where potential clients are calling when we send them this information.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> I do get it too, I think we&#8217;re going to stick with that. Camera one, camera two, camera one, sorry those of you listening, just playing around with stuff here for the video stuff. So go check it out on YouTube if you&#8217;re just listening on something. So let&#8217;s pivot here. I want to, I think when I have folks from the team on, I think it&#8217;s always interesting to kind of share agency tips or agency stories. So I&#8217;m going to go first, cause I&#8217;m going to give Ashley a little bit of time to think about what hers is, but basically, I&#8217;m going to basically share kind of a key learning that we, I, and the team had, especially me around when it comes to you know, pitching work or making sure that you position your pitch appropriately. So we had a potential opportunity whose name I will not reveal. And you know, I had a conversation with this gal and at the time I thought, you know, she was kind of who I&#8217;d be dealing with in the decision maker and had a really good rapport. That&#8217;s always key, sounded good, set up the pitch. And then you know, we&#8217;re kind of developing the pitch and then eventually they pull in her boss who was like a director of marketing or, you know, director level. So obviously she wasn&#8217;t the decision maker. So that was obviously going to be a red flag. You know, when you don&#8217;t have a decision maker involved from the get-go, it can get a little weird because in most cases, the person that you&#8217;re talking to is probably not giving them all of the context about your conversation, right. They&#8217;re just pulling them in probably just saying, Hey, they&#8217;re doing a pitch show up at this time. And that&#8217;s exactly what happened in this particular case. Where I gave realistic expectations with the person I talked to, this is what it&#8217;s to be. We&#8217;re not doing deep dive on strategy here. This is really just kind of giving you an introduction into what the work would look like, who we are just to kind of help you navigate making a decision. And she was totally on board with that. So we get into the pitch and literally, you know, 15 minutes in, the person that, you know, this director of marketing over, just kind of, you know, I think I paused actually, I said, Hey, do you know, I just want to stop here and see, do you have any questions or any thoughts before we kind of keep going? And she just immediately just like, just railed on us. Like, I don&#8217;t know what this is. I&#8217;m not seeing anything that has anything to do with us. And just being really just abrasive about, you know, what this was. And my immediate reaction was, I&#8217;m not sure what your expectations were, but based on the conversation that I had with this particular, like, this is what this is, this is what we do. And, you know, you pay for strategy. Like, if you want us to spend 10 or 15 hours to dive deep and deliver something that&#8217;s specific and customized for you, we can do that, but that&#8217;s not what this is. And, you know, long story short, you know, she&#8217;s like fine, okay, whatever, that&#8217;s really abrasive. And I knew at that moment, like, well, this isn&#8217;t going to happen, but, you know, I wanted to see it through, we were halfway through, we finish it, you know, and it was just, you know, we covered a little bit like the gal that I did talk to kind of did step up and say, Hey, yeah, actually, this is what it was. So, and, you know, they said that they wanted to, you know, review it and kind of make a decision or not make a decision, but they&#8217;ll get back to us. And, you know, once we had that experience, the team and I were like, Nope, this is not somebody that we want to work with.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 7\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p>Like, this is a no for us. So I sent her an email. I said, you know, thank you but no thank you. You know we&#8217;ve done this a long time and we know when a situation is a right fit for both sides. We don&#8217;t think that this is going to be a conducive for us and, you know, good luck with your search. And we went our separate ways. So the moral of the story, the advice that I would have for folks is make sure that you are dealing with a decision maker upfront. If that person is not who you are talking to on your intro call, and you can&#8217;t get them on that call, then make sure that the person you&#8217;re talking to like have a process in place where you ensure that that decision maker is getting context, they&#8217;re getting complete visibility into what it is that you&#8217;re doing, what to expect around that pitch. So that they&#8217;re up to speed. So they&#8217;re not coming in dark because that can really get ugly real quick. So we&#8217;ve learned that. So it&#8217;s either get them involved early and, or make sure that you&#8217;re providing resources that get passed on to that individual, so that they&#8217;re in the know. So if you&#8217;re starting an agency, then make sure you&#8217;re dealing with decision makers either directly or they&#8217;re involved in the process right from the beginning. So that&#8217;s my story slash advice. Have I given you enough time, Ashley, to think of one that you&#8217;ve got?<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> Yes. I mean, I have a couple, but you know, I just, I want to add something to yours, but I had a call recently and had a 45 minute call with a potential lead. And the conversation was amazing. She couldn&#8217;t stop talking about how nice it felt to talk to somebody who felt like understood them. And, you know, it was real and authentic and, you know, it was great. I left feeling great. I thought it was a 90% chance of a close on a pitch. And then to your point, we get on the pitch call and the decision maker is on the call and they&#8217;re more of a numbers person. And they, again, left the pitch, not feeling like they had been given all the information that they need, because although the person I talked to valued, having that genuine connection in that feel the decision-maker, that wasn&#8217;t as important. So, you know, then we left the call and I felt, you know, just like a gut punch with that. So I think again, you know, learning the lesson of making sure that the decision makers are involved from the beginning. But, you know, right now, I just, I think other people are feeling this too, but I am just racking my brain on how to genuinely connect with prospective clients, without networking, without trade shows, without in-person speaking events. I have been spending a lot of my time trying to come up with creative ways to reach potential new clients in an authentic way. So, you know, I think always, you know, a lot of companies you know, have had to turn to social media because some of their traditional marketing methods don&#8217;t work because of COVID. And I think, you know, always staying on top of the ball on things changing and the times changing and keeping aware of how people are feeling right now. So one of the things that I’ve started to do is integrating Loom videos into my intro emails and, and other communication to really start the conversation with a genuine connection or you know, with that same client who came back to us when the decision maker wasn&#8217;t super impressed with what we did when she said they might go in a different direction. I got on, I made a Loom video and I sent her, I sent it to her asking her for a chance and a conversation to discuss things further. And she looked at it right away and I was able to get another call. So I think, you know, always staying on top of being you know, staying authentic and genuine connection and using technology and the things that are out there to create human connection when there&#8217;s a lack of it right now.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 8\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Jason Yormark:<\/strong> I agree. Do you agree, studio audience? That doesn&#8217;t sound like a very impressive studio. I need a new sound. It sounds like maybe four people. I need a sound effect where it&#8217;s like 30, so I’ll work on that.<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> Well, hopefully 2021, 2022, we&#8217;ll be able to get back out on the trade show circuit or networking events or something. Cause I just, I love, nothing beats actually getting to talk to people in person.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> I even think that way. And I&#8217;m an introvert, you know, I was made for a pandemic, but you know, I&#8217;m definitely ready to kind of get back out and shake hands and just talk to people in person. And it&#8217;s almost like I forgotten what that&#8217;s like at this point. So hopefully pretty soon we&#8217;ve got a trade show that we were committed to like in 2020. And again, moved out like now it&#8217;s in April of 2022. So hopefully by then, we&#8217;re still doing that, but I guess we&#8217;ll see. But in the meantime, that&#8217;s, you know, that&#8217;s where loom videos and getting super creative about how to get in front of people digitally is you know, that&#8217;s never going to go away. But we&#8217;ve certainly figured some of that out. So what else you got? Anything else you want to share that you&#8217;re just dying to record on a podcast before we wrap things up?<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> You know, I think just, you know, my goal in this role is to, you know, show people that there are other good humans out there that not all agencies are out to get you and, and fill you with vanity metrics. And that, you know, really it comes down to working with good people and believing in what they do. And those are the connections that we want with clients. We want to authentically believe in what they do. And, you know, I hope that we have the chance to, you know, show some people have been burned in the past that not all agencies are bad and toxic and turn and burn that we, if given the chance that we will show you that not all agencies are created equal.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n<div class=\"page\" title=\"Page 9\">\r\n<div class=\"layoutArea\">\r\n<div class=\"column\">\r\n<p><strong>Jason Yormark:<\/strong> Yeah. Well, that&#8217;s a great point. That&#8217;s what I tried, I think every pitch I get on, I really try to break it down from, I said, all things being equal, talented agencies, if you&#8217;ve got two or three of them lined up strategy, execution, tactics, all of those things, look, if they&#8217;re good agencies, they&#8217;re going to get it done. You want to know what the two things that are going to make a difference between one agency and another, or in terms of your results. You want to know the two things that are going to impact the velocity of your success and your results there&#8217;s only two things really. Size of your ad budget and how passionate is the team about the work. Those are the two things that are going to dictate how quickly and how significant your results are, bar none. And that&#8217;s what we try to focus our pitches on. And everything that we do is designed around making sure that, you know, we&#8217;re spending time on work that we really are passionate about and want to do, and that they have realistic goals and expectations and budgets in terms of all that aligning up, that if that&#8217;s there, that&#8217;s going to be the difference between one agency versus the other. So awesome. Well, you rock, you know that. Thank you for being on the show again, I&#8217;m going to bring you on again of course, this won&#8217;t be the last time, but good stuff. Good change of pace. Love all my guests, but they also love kind of bringing folks on the team. So I’ll have to snag Joanna or somebody else on that team to do this too. Kicking and screaming, even if they don&#8217;t want to. But I think it&#8217;s good to kind of just bring folks on from the team and provide some additional insights. So thank you for joining us today on this episode.<\/p>\r\n<p><strong>Ashley Ohl:<\/strong> You are welcome and I&#8217;m glad I got to try out this new platform.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> I know. We&#8217;ll see if this goes on video. I don&#8217;t know. We&#8217;ll give it a shot, but all right, well that does it for this week&#8217;s episode of Socialistics, you know, the drill like us, subscribe, share all that good stuff. Thank you for listening and we will see you next time.<\/p>\r\n<\/div>\r\n<\/div>\r\n<\/div>\r\n","protected":false},"excerpt":{"rendered":"<p>This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What&#8217;s worked, what doesn&#8217;t, and the wins, losses and challenges we&#8217;ve been facing trying to grow our social media [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":7968,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[29,24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Inside The World Of Agency Sales - Socialistics<\/title>\n<meta name=\"description\" content=\"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What&#039;s worked, what doesn&#039;t, and the wins, losses and challenges we&#039;ve been facing trying to grow our social media agency. \" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Inside The World Of Agency Sales - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What&#039;s worked, what doesn&#039;t, and the wins, losses and challenges we&#039;ve been facing trying to grow our social media agency. \" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-17T15:00:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-17T16:45:39+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"315\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"23 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg\",\"width\":560,\"height\":315},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#webpage\",\"url\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/\",\"name\":\"Inside The World Of Agency Sales - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#primaryimage\"},\"datePublished\":\"2021-05-17T15:00:16+00:00\",\"dateModified\":\"2021-05-17T16:45:39+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What's worked, what doesn't, and the wins, losses and challenges we've been facing trying to grow our social media agency.\\u00a0\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Inside The World Of Agency Sales\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Inside The World Of Agency Sales - Socialistics","description":"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What's worked, what doesn't, and the wins, losses and challenges we've been facing trying to grow our social media agency. ","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/","og_locale":"en_US","og_type":"article","og_title":"Inside The World Of Agency Sales - Socialistics","og_description":"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What's worked, what doesn't, and the wins, losses and challenges we've been facing trying to grow our social media agency. ","og_url":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-05-17T15:00:16+00:00","article_modified_time":"2021-05-17T16:45:39+00:00","og_image":[{"width":560,"height":315,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg","size":"full","id":7968,"alt":"","pixels":176400,"type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"23 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/05\/episode_28_banner.jpg","width":560,"height":315},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#webpage","url":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/","name":"Inside The World Of Agency Sales - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#primaryimage"},"datePublished":"2021-05-17T15:00:16+00:00","dateModified":"2021-05-17T16:45:39+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week we take a break with our interviews and I bring Ashley Ohl back to the show. Ashley has recently been promoted to our Director of Business Development, and we talk all things agency sales. What's worked, what doesn't, and the wins, losses and challenges we've been facing trying to grow our social media agency. ","breadcrumb":{"@id":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/inside-the-world-of-agency-sales\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Inside The World Of Agency Sales"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7967"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=7967"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/7967\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/7968"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=7967"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=7967"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=7967"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}