{"id":8003,"date":"2021-06-14T08:00:20","date_gmt":"2021-06-14T15:00:20","guid":{"rendered":"https:\/\/socialistics.com\/?p=8003"},"modified":"2021-06-27T11:10:53","modified_gmt":"2021-06-27T18:10:53","slug":"agency-stories-wayne-mullins-from-ugly-mug-marketing","status":"publish","type":"post","link":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/","title":{"rendered":"Agency Stories: Wayne Mullins From Ugly Mug Marketing"},"content":{"rendered":"\r\n<p>This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.<\/p>\r\n<p>Learn more about Wayne at <a href=\"https:\/\/needclientsnow.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/www.uglymugmarketing.com\/<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8479020\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8479020-agency-stories-wayne-mullins-from-ugly-mug-marketing.js?container_id=buzzsprout-player-8479020&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<p><b>Jason Yormark:<\/b> Hello, and welcome to another episode of the socialistic social<br \/>media agency stories podcast. I&#8217;ve got another great guest this week. Someone that<br \/>I&#8217;m sure I have quite a few things in common with. So I’ll be interested to kind of<br \/>hear how they do what they do. So I want to welcome Wayne Mullins from ugly<br \/>mug marketing. Welcome to the show.<br \/><br \/><b>Wayne Mullins:<\/b> Thank you so much, Jason. I&#8217;m excited for our conversation and<br \/>I&#8217;m really looking forward to it.<br \/><br \/><b>Jason Yormark:<\/b> Awesome. Well, let&#8217;s just jump right in. Tell me your agency<br \/>story. Where did you start? How did it come to be? And you know, who are you<br \/>guys and what do you do?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, absolutely. So this journey actually started back when I<br \/>had a lawn and landscape company. So while back I had a lawn and landscape<br \/>company and over the course of about a three year period, we grew that company<br \/>very rapidly. And as a result of that growth, I started having some of our clients. So<br \/>clients of the lawn and landscape company come to me asking me, what are you<br \/>doing to grow? How are you marketing? How are you advertising? What are you<br \/>doing? And so I started just giving advice on the side, you know, here&#8217;s what we&#8217;re<br \/>doing, here&#8217;s what you should be doing or could be doing. And it was out of those<br \/>conversations that eventually ugly mug marketing would be born.<br \/><br \/><b>Jason Yormark:<\/b> Got it. And how long ago did that happen? How long have you<br \/>been in business as that brand?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, so the lawn company would have been way back in the<br \/>day of 2003 through 2006. I sold that company in 2006 and at that point I actually<br \/>already had some people paying for marketing advice, marketing help. I didn&#8217;t<br \/>officially start ugly mug marketing though until 2009.<br \/><br \/><b>Jason Yormark: <\/b>Okay. So you&#8217;ve been in business for a while. So tell me about<br \/>who you guys are, what you do, what&#8217;s your team like? Kind of give me the<br \/>lowdown.<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, so we focus primarily on three core areas web, web<br \/>development, social media marketing, and then traditional marketing, everything<br \/>from television, radio, print, direct mail you name it. That&#8217;s the three core areas<br \/>that we stay focused in. You know, I don&#8217;t know, I know this is very cliche, but<br \/>you know, like a lot of agencies, we love to say that we focus on results and that&#8217;s<br \/>what matters most to us and to our clients.<br \/><br \/><b>Jason Yormark:<\/b> Gotcha. And tell me a little bit about how you built, was it just<br \/>you to start out? Did you have some folks with you? Tell me about your trajectory<br \/>and how you guys kind of got to where you are today?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, absolutely Jason. So, you know, when I first started, what<br \/>had originally grown my lawn and landscape company so rapidly was I was a<br \/>devout student of direct response marketing. I studied direct response marketing. I<br \/>read every single book I could get on it and I utilized direct response marketing,<br \/>and therefore highly believed in it. And so that&#8217;s what I was advising people to do.<br \/>That&#8217;s what I was people to do. Now, keep in mind the town that we&#8217;re located in,<br \/>the city has a population of 48,000 people. So we&#8217;re not talking big population.<br \/>We&#8217;re not talking big businesses, kind of rural town, rural community, so to speak.<br \/>And as I launched at ugly mug marketing, my belief and passion was that<br \/>businesses needed to be doing direct response. And so I attempted to go out and<br \/>convince business owners, entrepreneurs, that that is what they needed to be<br \/>doing. And it was a very long, difficult road. I was so set on this idea that it had to<br \/>be direct response, that I would ignore what they actually were asking me to do. So<br \/>they asked about designing something or they asked about helping with production<br \/>on something. My answer was always no, but here&#8217;s what we can do. We need to<br \/>be doing, you know, my things that I think are best for you based on my<br \/>experience. And it didn&#8217;t work well for me, to be honest with you, I spent more<br \/>time trying to convince them of the things they should be doing than I actually did<br \/>helping other people. And then one day as luck or chance would have it, I finally<br \/>said, you know, one of the things that kept coming up was can you help with a<br \/>website? Can you help with a website? And my answer was always, no, we don&#8217;t<br \/>do web. And finally out of desperation, I said, the next person who says, can you<br \/>do a website? Can you help with a website? My answer is going to be yes. And I<br \/>will figure it out and sure enough, it wasn&#8217;t long somebody asked. I want to say<br \/>that, that I quoted that person $400 for the website. I want to say that the<br \/>gentleman I paid to build that website charged $350. So as you can see, I wasn&#8217;t a<br \/>very astute businessman when it came to figuring this out.<br \/><br \/><b>Jason Yormark:<\/b> Gotcha. So tell me a little bit about your team, I looked at your<br \/>website, it looks like a pretty good size team. How did you build that? How did<br \/>you build your team and what does that look like today?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, the answer would be very slowly. But that was because of<br \/>my stupidity, as I just illustrated with the previous story. You know, my expertise<br \/>was around marketing specifically. And so when I started growing the team started<br \/>building out the team, you know, we&#8217;re a little over 12 years old now as a<br \/>company. You know, for the first, I would say eight years, we would have one or<br \/>two employees at a time that was the extent of it. Plus myself. And then four years<br \/>ago, we really began making the transition to building out a team. So it was less<br \/>about just specifically doing client work. It was more about being intentional,<br \/>about building a team that could get results and then finding the work for those<br \/>people. And so, you know, that&#8217;s the process we went through. The advice that I<br \/>got back then to pay steak and eat hot dogs, pay steak, and eat hot dogs. And that<br \/>advice doesn&#8217;t go over too well, especially when you&#8217;ve been struggling for years<br \/>to get your business off the ground, especially when you&#8217;ve been pouring your<br \/>heart, your soul, everything you&#8217;ve got into this business. And then you get the<br \/>advice of, you know, you actually need to pay yourself less or not increase your<br \/>pay and pay the people you recruit more. And so that mindset really was the shift<br \/>for me. It&#8217;s that team members are not an expense, team members are an asset that<br \/>they&#8217;re an investment into the future of the company.<br \/><br \/><b>Jason Yormark:<\/b> I absolutely love that. I couldn&#8217;t agree more. I love that analogy<br \/>that you used. I think a lot of business owners, agency owners probably don&#8217;t<br \/>naturally think that way. I think it&#8217;s pretty rare. And I certainly do. So I fall into<br \/>that same method of thinking. A lot of it has to do with just, you know, I think a lot<br \/>of it comes down to, are you just that kind of person, you know, are you the kind of<br \/>person that can be comfortable with that and has a good heart or you&#8217;re generous,<br \/>or you just, you know, but at the same time, you know, recruiting and interviewing<br \/>and hiring and turnover, all of those things are tremendously time consuming and<br \/>expensive, and I would argue, and I&#8217;m sure you probably agree by paying people<br \/>more, but they&#8217;re worth maybe even more sometimes, there&#8217;s a higher propensity of<br \/>those people sticking around longer, and you&#8217;re not having to constantly replace<br \/>people and have a revolving door. So ultimately it ends up saving you money<br \/>because you&#8217;re not having to go through that sort of thing over and over again.<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, absolutely. And generally speaking when you&#8217;re willing to<br \/>pay more, you&#8217;re able to attract a different caliber of people to that position. So<br \/>yeah, I completely agree with that.<br \/><br \/><b>Jason Yormark:<\/b> Gotcha. And have you, so in that regard, and I probably already<br \/>know the answer to this question, so have you had the luxury of having people on<br \/>your team that have kind of been you with you for an extended period of time and<br \/>if so, how has that benefited your agency?<br \/><br \/><b>Wayne Mullins:<\/b> Absolutely. So I have you know, currently the longest running is<br \/>four years. I had somebody else prior to that that was four years. And you know,<br \/>those people are still here, so that clock is still ticking up. It&#8217;s still increasing you<br \/>know, the thing that&#8217;s uniquely challenging about where we&#8217;re located is that most<br \/>of the talent doesn&#8217;t stick here. So most of the talent in marketing, in advertising<br \/>doesn&#8217;t stay around here just because there aren&#8217;t that many jobs available. And so<br \/>they end up in bigger marketplaces. And so for us, recruiting is very, very difficult.<br \/>Hiring is very difficult. Part of that also has to do with our level of expectation.<br \/>You know, for us, this is not an exaggeration, but for every hundred applicants that<br \/>we get, we will probably talk to about 30 of those people of those 30, we will<br \/>probably actually interview less than 10 of those people and we may end up hiring<br \/>one of them. So it&#8217;s a lot of moving pieces to find the right people.<br \/><br \/><b>Jason Yormark: <\/b>Well, that&#8217;s a lot of work. I should have asked these questions.<br \/>So are you, the work that you do, is it predominantly local to your region or is it<br \/>more national, a mix of both?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, great question. It&#8217;s a mix of both. I would say the mix<br \/>varies a little bit from season to season, time to time, but we are roughly, probably<br \/>65% in the state in Louisiana, 35% scattered across the country and occasionally<br \/>across the way.<br \/><br \/><b>Jason Yormark:<\/b> Gotcha. And do you guys have a physical office where your<br \/>team, do you work out of a physical location, or do you have a virtual element to<br \/>any of what you do?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, we do have a physical location. We have an actually quite<br \/>nice building that we&#8217;ve been in for about two years now, right in downtown of our<br \/>town that we&#8217;re located in. And most of us work here in the office. We do have one<br \/>person who recently moved and is working remotely at this point.<br \/><br \/><b>Jason Yormark:<\/b> Gotcha. What has the with the pandemic, has that changed<br \/>anything for you guys in any capacity, whether logistically, operationally, fiscally,<br \/>I&#8217;m just kind of curious how it&#8217;s impacted you guys.<br \/><br \/><b>Wayne Mullins:<\/b> So, you know, initially we were shut down for a period of time in<br \/>terms of not able to come together in the office. But you know, to be honest with<br \/>you, we came through it very strong. We came through it you know, very well as a<br \/>team. We worked really hard over those initial weeks to connect with every single<br \/>client, make sure they were doing okay, have conversations with them, not just<br \/>about business, but about life, you know, how are they coping with everything<br \/>taking place. So I really think that, you know, we created unintentionally, but there<br \/>was some intent behind it. We created a lot of Goodwill during that period of time.<br \/>One of the things that we did, we didn&#8217;t know what to do like so many you&#8217;re kind<br \/>of caught off guard and you don&#8217;t know what to do. We have a decent sized<br \/>following on Facebook, you know, 6,000, 7,000 followers in typically what we&#8217;d<br \/>done in the past is we used our platform. We use the Facebook platform, we would<br \/>go in there and do Facebook lives, do webinars, etc. During the pandemic, we<br \/>decided that we would reach out to our clients. We would reach out to people in<br \/>our community, business owners, we&#8217;d reach out to vendors. We&#8217;d reach out to<br \/>anybody that we thought could benefit from some exposure during that time. And<br \/>over the course of a six period, we actually interviewed 60 people live on<br \/>Facebook during that six week window as everything was shutting down. And the<br \/>intent behind that was simply this, that we have this platform that we typically use<br \/>in quote unquote self-serving ways. Sure, we broadcast, and we put out good<br \/>content for our followers, but we wanted to open that up to other people. So I know<br \/>you didn&#8217;t ask specifically about that, but that&#8217;s one of the ways that we actually<br \/>use that time to better serve our clients and better serve our community.<br \/><br \/><b>Jason Yormark:<\/b> I love it. No, actually, we are more of a virtual agency. So we<br \/>don&#8217;t have that hometown feel, a lot of our maturation as a business actually<br \/>happened during the pandemic. So even if we had wanted to kind of move in that<br \/>direction, our hands are kind of tied because we didn&#8217;t really have that to begin<br \/>with. So I could definitely see how, you know that would change and give you<br \/>more. I mean, that&#8217;s one of the things that I often think about that, you know, I<br \/>envy is that, you know, being kind of that marketing agency that&#8217;s well-known and<br \/>has a really strong footprint in a specific area just because of the intimacy of what<br \/>that type of setup can provide. And certainly that aligns nicely to social media. So I<br \/>just certainly know the benefits, but you know, what is your, I mean, what is your<br \/>kind of like 5, 10 year plan? I mean, are you one of those agencies that&#8217;s like, we&#8217;re<br \/>kind of happy with what we are and what we represent, or do you kind of have<br \/>aspirations to take it a step further, which I would imagine would require doing<br \/>more work outside of your area? I&#8217;m just kind of curious about what your future<br \/>plans are as an agency owner.<br \/><br \/><b>Wayne Mullins:<\/b> The reality is Jason, I don&#8217;t have an easy answer or simple answer<br \/>to that. I probably should, but what I would say is this, that, you know, my goal for<br \/>the company is simply this, that every single day, we&#8217;re getting a little bit better.<br \/>And I know that&#8217;s like the most cliche thing that someone could possibly say. But I<br \/>view it as this. So when someone comes and they become a part of our team, my<br \/>goal for that person, regardless of position, regardless of how long they&#8217;re going to<br \/>stay, my goal for that person is when they leave here, they are a better person, both<br \/>personally and professionally than when they got here. And so that is the mentality<br \/>though, that like flows through to the clients. It flows through to every aspect of<br \/>what we do. You know what I think so uniquely challenging about what we do in<br \/>the agency world is this, that what is exceeding expectations today, tomorrow will<br \/>become under exceeding expectations, right? So when you exceed expectations<br \/>day after day, that becomes the new expected norm. And so then you have to push<br \/>again. So you have to get a little bit better, or if not the latest, the greatest thing, the<br \/>next thing that comes along that promises something extraordinary in the way of<br \/>results, everyone&#8217;s going to flock to that company, to that thing, that app, whatever<br \/>that quote unquote magic thing may be.<br \/><br \/><b>Jason Yormark:<\/b> Yeah. And you know, that&#8217;s a challenging environment to work<br \/>in some curious, when you&#8217;re looking for folks to join your team. What are your<br \/>non-negotiables like when you&#8217;re looking for folks, like what are the two or three<br \/>things that the person, the people that you want to bring into your family, your<br \/>work family, that they absolutely must check that box? Like, what are those things<br \/>for you?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah. The very first one would be core values alignment. So the<br \/>skills can be taught. Skills can be taught day in and out. So we could take<br \/>somebody that knows nothing about social media. We can teach them those skills.<br \/>We can teach them ads manager, we can teach them whatever the things may be.<br \/>You cannot teach core values. You specifically cannot teach core value alignment.<br \/>Meaning if their personal values don&#8217;t align with what we stand for, there is<br \/>virtually no chance that overtime we&#8217;re going to convince them to align their values<br \/>with ours. Not saying it couldn&#8217;t happen, but it&#8217;s probably not worth the time<br \/>investment to make that happen. So number one would be alignment with core<br \/>values. The second thing would be this idea, which it ties back into one of our core<br \/>values, but of being a lifelong learner. We want people who are passionate about<br \/>learning something new, so it doesn&#8217;t have to be about marketing. It doesn&#8217;t have to<br \/>be about business necessarily, but it does have to be about learning. They got to<br \/>have that mindset of, I don&#8217;t know as much as I should know about this area, I&#8217;m<br \/>going to keep learning. I&#8217;m going to keep pushing, I&#8217;m going to keep growing. So<br \/>those will be two things.<br \/><br \/><b>Jason Yormark:<\/b> Excellent. So I want to talk a little bit about how you guys, how<br \/>you inbound leads, outbound leads. Like what is your process or what&#8217;s been your<br \/>areas of success for attracting and gaining new clients?<br \/><br \/><b>Wayne Mullins: <\/b>Yeah, you know, for the longest I felt guilty about this, Jason<br \/>because we were terrible marketers. All of our business came from word of mouth,<br \/>actually a hundred percent. And to this day, you know, 95 plus percent of our<br \/>business is word of mouth. We&#8217;ve gotten better though at leveraging how to get<br \/>word of mouth. We&#8217;ve gotten better at being intentional in attracting word of<br \/>mouth. So an example of what I mean by that would just simply be this. So, you<br \/>know, when launch a new website for somebody, for example, we will make a post<br \/>on social media that says, congratulations to X, Y, and Z. We will then spend<br \/>money promoting it to people who like that page, who are interested in that page if<br \/>we&#8217;re able to target. So, in other words, if that audience is big enough and we can<br \/>target that group, we&#8217;re going to target that group. And the reason is this, because<br \/>then everyone in that circle sees, oh, you know, this place I like just got a new<br \/>website. Oh, that&#8217;s interesting. This company did it. And so what that does is, it&#8217;s a<br \/>psychological trigger. It&#8217;s that social proof that, huh? If they use them, they&#8217;re<br \/>probably a decent company. So, you know, when the website conversation comes<br \/>up, I&#8217;m going to at least give them consideration, at least reach out and try to<br \/>connect with them.<br \/><br \/><b>Jason Yormark:<\/b> I love that. That&#8217;s a great tip. What percentage of your, you had<br \/>mentioned, you said web, social and some traditional marketing, what&#8217;s the<br \/>percentage breakdown in terms of the work that you do. Do you have a sense of<br \/>that?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, so in the past, it&#8217;s roughly been a third, a third, a third and<br \/>that&#8217;s [18:55 inaudible] over the years. We&#8217;re currently at roughly 40% on<br \/>traditional marketing and then the other two departments are roughly splitting the<br \/>remaining. So that&#8217;s where we currently are. So 30, 30, 40 is that math right. Don&#8217;t<br \/>challenge me on my math here because math is not my thing.<br \/><br \/><b>Jason Yormark:<\/b> I&#8217;m not going to do that. So do you find it easier to kind of get an<br \/>entry point with clients with a tangible thing? Like when you talk about a website,<br \/>it&#8217;s like this physical thing, it&#8217;s like, we need this thing, you build this thing, we can<br \/>see it, we can hear it, like it&#8217;s tangible. And then that opens up the door to maybe<br \/>some of the things that they can&#8217;t touch, taste, or feel like, you know, social media.<br \/>I mean, yeah, you can see the content, but like it&#8217;s often a big mystery for a lot of<br \/>clients that we come across in terms of how that can actually work and drive real<br \/>results for their business. So a lot of times you know, it&#8217;s more of a struggle for us<br \/>because there isn&#8217;t that tangible thing that a client may know that they just, we<br \/>physically need this thing. And then that kind of opens up that opportunity to do<br \/>other things when you have projects like that. Are you finding that your entry<br \/>points with clients typically lead that way or is it just kind of a mix?<br \/><br \/><b>Wayne Mullins:<\/b> Yeah, no, what you&#8217;re saying is absolutely true. So our number<br \/>one salesperson for a new website for us is the competitor of the person who called<br \/>us. So let&#8217;s just use a dentist office. So a dentist&#8217;s office calls us and says, Hey,<br \/>we&#8217;re interested in getting a quote on a new website, 9 times out of 10. We come to<br \/>find, later we find out that one of their competitors just got a new website. And so<br \/>they&#8217;re like, oh, that website looks great. Ours looks terrible. We need this new<br \/>quote, unquote, like you said, thing. One of the ways that we combat that, because<br \/>that is a thing. So with social, you know, a very common thing as well, my<br \/>nephew&#8217;s boyfriend can take care of this. He&#8217;s got a hundred thousand followers on<br \/>Instagram. He&#8217;s, you know, all these things. And so one of the things that we do to<br \/>combat that as well, again, we use social proof and so we will highlight clients. In<br \/>other words, we&#8217;re excited to be celebrating our third anniversary of working with<br \/>client X, Y, or Z on, specifically on their social media. So we&#8217;ll talk about in that<br \/>post, what are we doing. So we will specifically call out social media. We will<br \/>specifically mention a few of the things that we&#8217;re doing or have done for that<br \/>client over that time period. And again, what we&#8217;re looking to create with that is<br \/>recreating some tangible evidence of this other otherwise kind of mysterious, like<br \/>digital thing that really any kid with a smartphone could do so to speak. And when<br \/>we do that, what that does is it enables that person, even though they may not<br \/>know that other client to sell on our behalf, because they think in the back of their<br \/>head, they think, well, if they&#8217;re going to spend whatever the amount is, X dollars a<br \/>month paying this company for the last two years to do it, there&#8217;s got to be a logical<br \/>reason, right? It&#8217;s not just some random person who decided to waste a bunch of<br \/>money with a local agency on their social media. There has to be a logical ROI<br \/>behind that. The only other thing I&#8217;d say that we always attempt to do is we always<br \/>attempt to identify the low hanging fruit first with any client and, so this would be<br \/>on social or on traditional marketing. And we attempt to replace our fee, whatever<br \/>we charge with new revenue as quickly as possible. So we will be pretty adamant<br \/>in some instances on what are the first things we need to do. Because the sooner,<br \/>we know that the sooner we can cover our own fee with new revenue, we&#8217;ve got a<br \/>client for life. We&#8217;ve got a client for life. And so always look for the low hanging<br \/>fruit first. In other words, what are the things that could be done that would drive<br \/>revenue that you can show that traction to, right? You can take what you&#8217;ve done<br \/>and say, here&#8217;s what we&#8217;re doing. Here&#8217;s the new revenue generated. Here&#8217;s how<br \/>we&#8217;re able to connect those two pieces. When you can do that, you will have clients<br \/>for quote unquote life.<br \/><br \/><b>Jason Yormark:<\/b> I love that. One of my favorite questions I love to ask agency<br \/>owners because I think it provides some really great insight for those that are just<br \/>starting out or thinking about starting out is, you know, if you went back and could<br \/>do something differently around your building your agency, you know, missteps<br \/>that you made or things that you took you awhile to kind of figure out, what&#8217;s one<br \/>or two things that kind of come to mind that you would&#8217;ve done differently, or if<br \/>you were recommending to somebody who&#8217;s looking to kind of get this that they<br \/>really need to be thinking about.<br \/><br \/><b>Wayne Mullins:<\/b> Yeah. Great question. I&#8217;m going to give you two answers. One&#8217;s<br \/>going to be more tactile, more specific. The other, one&#8217;s going to be kind of a, not<br \/>so much that, and I’ll start with the first one, which is, I wish I hadn&#8217;t believed the<br \/>stories that I told myself for so long. So let me give you a specific example of that.<br \/>So for the longest time I carry this story around with me that I wasn&#8217;t a great leader<br \/>or a great manager. And for that matter that I wasn&#8217;t even a good manager or a<br \/>good leader. I carried that story with me for so long that it continually played out in<br \/>my business. Now that&#8217;s just one example. There was a lot of examples of stories<br \/>that I carried over from my previous experiences into this agency that I believe to<br \/>be true, which weren&#8217;t actually true. When I shifted those stories, the business<br \/>began to shift. So that&#8217;s kind of the more mystical or more woo woo answer. The<br \/>more tactile one is this. I wish that I had increased prices sooner. I wish I had<br \/>increased prices sooner. So, you know, we always go into things and we go in a<br \/>little bit timid, right? We go in walling, we were coming from a position of need<br \/>instead of a position of abundance. And so when we come from that perspective,<br \/>we come in at a price that devalues our services. It devalues even our entire<br \/>industry, right? You choose one of those buckets, marketing, social, or web. It<br \/>devalues those because we pride ourselves so low that we&#8217;re now frustrated by the<br \/>fact that we got the project, because we&#8217;re charging so little, we&#8217;re frustrated.<br \/>Therefore we don&#8217;t give them everything that we know they need or deserve. They<br \/>get frustrated because they&#8217;re not seeing the results that they hope for. And so it&#8217;s<br \/>this horrible cycle that we get into, all because we weren&#8217;t confident enough in our<br \/>skills and our ability to price ourselves at the level they need to be priced at.<br \/><br \/><b>Jason Yormark:<\/b> That is a phenomenal piece of advice and incredibly timely. I<br \/>was actually, I&#8217;m part of a mastermind group in where we were talking about price<br \/>and how, So, I mean, I went through that exercise of feeling uncomfortable raising<br \/>prices. And like you had said, like operating out of need and not really charging<br \/>what you&#8217;re worth. And, you know, we&#8217;ve gotten past that for the most part. But I<br \/>constantly see, it&#8217;s almost like every agency owner goes through that. There&#8217;s not a<br \/>single agency owner that doesn&#8217;t experience that struggle. And it really isn&#8217;t<br \/>anything more than just training yourself to get comfortable with it. It&#8217;s a mindset,<br \/>you know, it&#8217;s really just getting past this idea that you&#8217;re going to lose an<br \/>opportunity because you&#8217;re charging too much. But the fact of the matter is if that&#8217;s<br \/>the case, they&#8217;re not the right fit for you. And to your point, which I love is that.<br \/>And I talk about this all the time, the power of saying, no, you have to be<br \/>comfortable saying no, sometimes a particular client isn&#8217;t the right fit for you<br \/>fiscally. And you know, maybe sometimes, sometimes the bigger clients can pay<br \/>for some of the smaller ones and you take those on, you know, but generally<br \/>speaking, you know, everybody&#8217;s not going to be a fit and you don&#8217;t want to get<br \/>into a situation where you&#8217;re charging less than what you&#8217;re worth. It frustrates you,<br \/>it frustrates your team. It impacts results. It&#8217;s a recipe for disaster. So I love that.<br \/>And I could not agree with that more. It&#8217;s definitely something that most agency<br \/>owners experience in some capacity.<br \/><br \/><b>Wayne Mullins:<\/b> That was true for me. I would say, you know, two ways to<br \/>combat that would be one, just whatever you&#8217;re currently quoting, you know,<br \/>whatever the service is at. Just make a commitment to yourself that you&#8217;re going to<br \/>increase it by 10% with every single new project you get until you start hearing<br \/>more no’s, right. Just keep increasing it at 10%. The other advice that I got way<br \/>back in the day was you know, what would you normally quote for the project? So<br \/>the price, you know, the quote would normally be $2,000. Okay. At what price<br \/>would make you very uncomfortable to give them. So maybe that&#8217;s $3,000. Okay,<br \/>so $3000 is my kind of threshold. My internal threshold of what&#8217;s kind of way too<br \/>expensive possibly for this client to pay. And so I was actually challenged at the<br \/>time by a coach to go to that threshold and quote those prices to people. And I can&#8217;t<br \/>tell you the amount of resistance and the amount of pushback that I gave in this<br \/>process, but I wish I had listened to that much sooner.<br \/><br \/><b>Jason Yormark:<\/b> So you just got to do it. You just put it out there and you&#8217;ll be<br \/>shocked at how it turns out. I mean, I think a much more favorably than most<br \/>people ever think. So that&#8217;s great stuff. So a couple one last question I&#8217;d like to ask<br \/>is what is, a favorite piece of technology, a book, a show, a resource, an article<br \/>what&#8217;s something that&#8217;s really stood out to you recently that has really made an<br \/>impact for you in some capacity across any of those sorts of things.<br \/><br \/><b>Wayne Mullins:<\/b> Yeah. So I&#8217;m an avid reader, I read a lot. And so the question of<br \/>what one book is always a challenge because it&#8217;s like the book I&#8217;m currently<br \/>reading is the best book I’ve ever read usually. And so it&#8217;s like, that&#8217;s a tough one<br \/>for me. I just read a book called straight line leadership, which really was a<br \/>powerful book for me. It just talks about how we often over-complicate so much<br \/>and we work ourselves in circles or we zigzag our way to success when the reality<br \/>is, we can draw much more of a straight line than we believe as possible if we just,<br \/>those points along the way that we need to hit. So that&#8217;s a book I&#8217;d recommend.<br \/>Another would be, you know, one of the things that I’ve been very intentional<br \/>about this year is I’ve switched back to a physical planner for my calendar. I still<br \/>use Google calendar, but I didn&#8217;t take it and I put it in my physical or I will start<br \/>sometimes with the physical and then take it over to Google. It&#8217;s made a huge<br \/>difference in my productivity. For one, it&#8217;s not nearly as distracting as getting in<br \/>Google. Two, it’s just enables me, I use one that&#8217;s called the calendar itself is<br \/>called planner pad. And it enables me to see the entire week at one time with all of<br \/>my action items, all my to do&#8217;s in one spot. So for me as somebody who&#8217;s more of a<br \/>big picture person by seeing every single day laid out like that, I&#8217;m able to then like<br \/>segment those things off in my head and not worry about what am I forgetting?<br \/>What am I missing?<br \/><br \/><b>Jason Yormark:<\/b> Nope. I love that. As much as a digital technology guy. I still<br \/>like the old school notebooks or things for note taking and things of that nature. So<br \/>I totally get that. So, well that&#8217;s awesome. Anything that I didn&#8217;t ask you or<br \/>anything that you&#8217;d want to add, that you didn&#8217;t get the opportunity to kind of share<br \/>that relates to kind of what we talked about?<br \/><br \/><b>Wayne Mullins: <\/b>Yeah. The only other thing I would kind of add is that, you<br \/>know, when it comes to building an agency, when it comes to building a team for<br \/>the longest for me personally, that I thought culture was just this thing that was just<br \/>like, you know, latest buzzword. And that culture was this thing that, you know,<br \/>Silicon Valley companies took care of. And, you know, it was all about the<br \/>napping pods and the stock kitchens and all this crazy stuff. But what I finally<br \/>realized was that if we are unintentional about our culture, then we are<br \/>intentionally creating a bad culture. So for unintentional about the culture, we are<br \/>intentional about creating a bad culture and when I embrace that, when I begin<br \/>putting in effort and really thinking through what culture are, we creating, things<br \/>begin to shift. So that is when, what I would call the term I would use is that is<br \/>when we began building out a self-accountable, high performance team, that<br \/>mentality shift for me was huge. It was profound. And so I would challenge<br \/>anyone listing to be intentional about your culture. And if you want to know what<br \/>your culture currently is for your agency, your culture litmus test is this, how do<br \/>people perform when the boss is away? So if you&#8217;re the agency founder, and you&#8217;re<br \/>listening to this, when you&#8217;re going on vacation and not checking in all the time,<br \/>what&#8217;s the performance look like of your team. That is what your true culture is.<br \/>That is the definition, that&#8217;s the litmus test for your company culture. And so for<br \/>me, I want a culture that is self-accountable and high performance. And so I then<br \/>work backwards from that. We&#8217;ve worked backwards literally over the last four<br \/>years on figuring out what are the pieces and components that help us build out<br \/>that type of culture.<br \/><br \/><b>Jason Yormark:<\/b> I love that. Yeah, no, culture is very important to me, even more<br \/>so because we&#8217;re virtual, you know, we&#8217;re not in the same space, so even more<br \/>challenges inherently with that. So you really have to make that a priority to build<br \/>even more so I would argue in that particular case, cause you don&#8217;t get the<br \/>opportunity to kind of get that face to face. So I love that. I love that. I love<br \/>everything you&#8217;ve shared. This is why I love doing this because it&#8217;s somewhat<br \/>therapeutic and it&#8217;s just, it always feels good to be able to have these conversations<br \/>with folks that just understand what I’ve gone through. And that&#8217;s great. I love<br \/>what you guys are doing and I really appreciate you carving out some time to kind<br \/>of share your story and really look forward to just kind of stand and touch and<br \/>watching you guys do your thing. So thanks for being on the show today.<br \/><br \/><b>Wayne Mullins: <\/b>Thank you so much, Jason. Likewise enjoyed our conversation<br \/>and always enjoy learning and listening to other people, you know, kind of in the<br \/>same field doing the same thing that we&#8217;re doing. So thank you for the invite.<br \/><br \/><b>Jason Yormark:<\/b> Sure. One last thing. Where can people find and learn more<br \/>about you and or your agency?<br \/><br \/><b>Wayne Mullins:<\/b> Sure. Just www.Uglymugmarketing.com, email address,<br \/>telephone number is there, social links are there. So it&#8217;s all in that one spot.<br \/><br \/><b>Jason Yormark:<\/b> Awesome. Well, that&#8217;s easy enough to remember. Thanks again.<br \/>That is it for this week&#8217;s episode of socialistic. Thanks for listening. Like share,<br \/>subscribe, all that good stuff. We will catch you next time.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team. Learn more about Wayne at https:\/\/www.uglymugmarketing.com\/ Find Socialistics at www.socialistics.com    [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":8010,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics<\/title>\n<meta name=\"description\" content=\"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-14T15:00:20+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-27T18:10:53+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"28 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#webpage\",\"url\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/\",\"name\":\"Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#primaryimage\"},\"datePublished\":\"2021-06-14T15:00:20+00:00\",\"dateModified\":\"2021-06-27T18:10:53+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they\\u2019ve built a successful full service marketing agency and the importance of building a world class culture rich team.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Agency Stories: Wayne Mullins From Ugly Mug Marketing\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics","description":"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/","og_locale":"en_US","og_type":"article","og_title":"Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics","og_description":"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.","og_url":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-06-14T15:00:20+00:00","article_modified_time":"2021-06-27T18:10:53+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png","size":"full","id":8010,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"28 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Agency-Stories-Wayne-Mullins-from-Ugly-Mug-Marketing-1.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#webpage","url":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/","name":"Agency Stories: Wayne Mullins From Ugly Mug Marketing - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#primaryimage"},"datePublished":"2021-06-14T15:00:20+00:00","dateModified":"2021-06-27T18:10:53+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week I sat down with agency owner Wayne Mullins from Ugly Mug Marketing where he shares his agency story, how they came to be, how they’ve built a successful full service marketing agency and the importance of building a world class culture rich team.","breadcrumb":{"@id":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/agency-stories-wayne-mullins-from-ugly-mug-marketing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Agency Stories: Wayne Mullins From Ugly Mug Marketing"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8003"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=8003"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8003\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/8010"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=8003"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=8003"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=8003"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}