{"id":8026,"date":"2021-06-28T08:00:24","date_gmt":"2021-06-28T15:00:24","guid":{"rendered":"https:\/\/socialistics.com\/?p=8026"},"modified":"2021-06-27T11:07:52","modified_gmt":"2021-06-27T18:07:52","slug":"alternative-ways-to-build-an-agency-with-elizabeth-pampalone","status":"publish","type":"post","link":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/","title":{"rendered":"Alternative Ways To Build An Agency With Elizabeth Pampalone"},"content":{"rendered":"\r\n<p>This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.<\/p>\r\n<p>Learn more about Elizabeth at: <a href=\"https:\/\/www.sidneyclevinger.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/getabsolutemarketing.com\/<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8614736\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8614736-alternative-ways-to-build-an-agency-with-elizabeth-pampalone.js?container_id=buzzsprout-player-8614736&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Hello, and welcome to another episode of socialistic, social media agency stories. My name is Jason Yormark. I am excited about our guest today. Her name is Elizabeth Pampalone from absolute marketing. Elizabeth, welcome to the show.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Thanks for having me.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. So let&#8217;s just go ahead and jump right in. I find your story pretty fascinating, and I&#8217;m going to dig into some things. But let&#8217;s just get started with your story. How&#8217;d you get started, kind of work me through your career progression and where you&#8217;re at today and what you&#8217;re doing.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, I actually started with website design about 20 years ago. So hand coding and HTML back in the day, notepad++ was my jam. So I started back with that and then I moved into WordPress. I did that for about 10 years and for the last five years I’ve been running my current agency, which is like my second or third iteration of it. And that is absolute marketing, which is a formula that I developed, and I’ve been working in pretty much all aspects of marketing for small businesses. And it&#8217;s really the formula that I had used for myself and all the businesses that I’ve created and run and sold. And so I was like, you know what? I really should probably use this for my clients because it&#8217;s really effective. So that&#8217;s what I built about four years ago.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Gotcha. So am I hearing correctly and correct me if I&#8217;m wrong. Have you always been self-employed entrepreneur? Did you have any traditional nine to five experiences before you kind of jumped into that world?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> I did. I was right out of college, I worked for a software development firm and I coded in access. I did the lowest of the low job you could possibly get.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> How long did that last?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, it was unfortunate because I probably would&#8217;ve done it longer. It lasted eight months and then I went through a divorce after three months of marriage, my husband left me. And so I really had to start my life over. And when I did that, my parents were moving to Florida. So I moved to Florida about, you know, several thousand miles away and from where we were originally, and I just started a business. My mom was like, he just started business. Cause you cannot be employed. I was overqualified for these jobs under-qualified for those jobs and it was during the recession. So it was like, you just had to start a business.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> So how long have you been on your own?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> 15 years.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> 15 years. Well, congratulations on that. It took me, I always knew that I was wired to do that. It took me longer to kind of get there, but it&#8217;s always interesting to hear people&#8217;s stories about how they got there. Cause they&#8217;re so different. You know, some people figure it out pretty early in life and some people figure it out later in life. And I don&#8217;t think that there&#8217;s a right or wrong way. It&#8217;s just everybody&#8217;s circumstances are different. So it&#8217;s always interesting to about that. So tell me a little bit more about what you do, you said you work with small businesses, which is a very, always a difficult phrase because some people define small business as the mom and pop shop on the corner. And some will say they&#8217;re a $50 million business and they&#8217;re a small business, which I&#8217;m like, no, you&#8217;re not. So it&#8217;s a very vague term. So I&#8217;m very curious about how do you define small business and what type of clients do you work with and what does that, those engagements typically look like?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Yeah. So anybody from one person in the business, so solopreneurs all the way up to people who do not have in-house marketing departments. I think once you get an in-house marketing department, you&#8217;re kind of up there, you know, your medium to large and most companies can even do that with having less than 50 employees. And by in-house marketing, I mean, maybe you have one person who&#8217;s in your company who you pay full time, who does the website, who does the social, who does, you know, whatever. So when they&#8217;re not at that stage yet, then I work with them. Sometimes I’ve worked with people who have just brought in that student that they just hired and they&#8217;re fresh out of college. They know nothing. And they&#8217;ll hire me to basically train this person and to learn how to run a marketing department of one, if you will. So really everything from the solopreneur, all the way into, you know, people who don&#8217;t really have a marketing department and they should, or they&#8217;ve just hired that person to start that process.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> So is it just you, do you have a team kind of give me a better sense of scope of your business?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Yep. We do have a team. There are four people currently and my sister, she is just graduating in 2021 this year and she is going to be coming on full-time with us. So I&#8217;m very excited about that.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> That&#8217;s great. So I was looking through your website and it looks like you have a couple of different paths for people to, or companies to work with you. You kind of framed them up as do it for you, do it with you. I&#8217;m kind of curious what, the percentage of breakdown of the businesses that you work with. How many of them are or what percentages, do it with them versus do it for them.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Do it for you is, has to be the lowest. This is the person that says, Hey, I don&#8217;t really care what it looks like. Here&#8217;s my brand colors, make me all the things right. And they&#8217;re kind of leaving it up to our discretion to really create everything they sign off on it. And they&#8217;re good with it because they&#8217;re really focused in other areas. And this is a rare type of person, but we have had clients like that in the past. So I leave it there as an option. But with the, do it with me, like we&#8217;re doing it with someone you know, we&#8217;re working one-on-one side by side. That is our most popular because a lot of people that come to us, they are startups. They are in that mid stage. Maybe they&#8217;ve been in business 30 years and they&#8217;ve never had a website, or they have an old website from 1992. And so they&#8217;re kind of at this stage where they say, you know what, I don&#8217;t really know if I need to have enough money to pay a marketing firm for, you know, all this extra stuff. But I do want to know what is happening. I do want to know how this stuff works. I want to be involved in the process and then I’ll know who to hire, how to delegate this, etc. So a lot of people just come to us without the knowledge of these things. And this is what the done with you is really for that we actually are able to train them or whoever they bring with them. You know, I have up to two or three people in the room sometimes.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> So would you say that the do it with them approach is really about just filling some gaps there. They&#8217;re still owning some deliverables in their world and you&#8217;re just kind of teaching them and getting them to a point where they can bring a lot of that stuff. In-House in essence working, you&#8217;re working out of a relationship or at least lesser of one. Is that accurate?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Yeah. Yeah. And that&#8217;s the way I prefer because I want to set companies up to be self-sufficient. I want them to be able to hire that summer intern, take an afternoon, teach them some things, which they know, and they know how to do, and they&#8217;ve been doing for months and teach them a few things and get that off their plate. But then also when that summer intern goes back to school, they can take that stuff back over because they know how to do it. It&#8217;s easy, it&#8217;s very quick and something they can pick back up. And with turnover and staff, you know, I’ve experienced this many times. I like people, the owners, especially to know the every aspect of what they&#8217;re doing. They need to know all their financials. You know, I just recommend that in general, but they need to know that things like that, they need to know how their business works, how their sales work, how their marketing works. Because as long as they know how it works, they can pick up that slack if needed because you know, turnover happens, and things happen with people that you really can&#8217;t control.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Yeah. I find that fascinating cause we, the world that we live in is quite the opposite, you know, companies, and it could be just a matter of a different segment of businesses that, you know, each of us are targeting the ones that we come across are, we don&#8217;t want anything to do with this. We don&#8217;t know it. We don&#8217;t have any interest in knowing it. We know that we need to do it and we just want to pay somebody to do it. So I&#8217;m fascinated by you living in a world where it&#8217;s a little bit different. How do you, in terms of you know, client acquisition, like what does that look like for you? How much of it is inbound versus outbound and you know, how do you find clients to work with kind of fit that model for you?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> I do a ton of speaking and that&#8217;s when I really find the best clients. You know, the whole webinar thing kind of as, has been a fad for a while. And I never jumped on that bandwagon because I really feel like a live presentation that is promoted by someone else it&#8217;s often more effective. And whether it&#8217;s in person, which we used to have and is starting to come back or whether it&#8217;s online you know, actually a webinar, but it&#8217;s a live presentation. It&#8217;s not, you know, a prerecorded thing. So I’ve definitely found that that&#8217;s probably my number one way of getting clients because they get to know you, you get to experience things with them and they also, you can help them a little bit. You can give them that value right there on the spot and you can basically endear them to you immediately. I also find that through podcasting has been another great way. I have my own podcast and I also have the guested on numerous podcasts in the last year and networking too.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> I want to dive into that because again, I was looking at your website and was just amazed at the volume of work that you&#8217;re doing around podcasting yourself, being a guest, doing speaking gigs. And I&#8217;m jealous because it&#8217;s a combination of, I haven&#8217;t quite figured out how to do more of that and a time thing, which just tells me I need to make the time and get out of the business a little bit, but take me through what&#8217;s your process. How do you get yourself, more so being a guest on podcasts and speaking engagements, like what do you do to kind of create a pipeline for yourself of opportunities to do those sorts of things?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, I will start with this. I&#8217;m an experiment kind of girl. Like I like to just take a random thing and say, this is what I&#8217;m going to do this year, or this is what I&#8217;m going to do this month. And I did an experiment a few years ago, I guess, about seven or eight years ago now. And I networked three times a day, every single day for one year. And my goal was not to get more business to fill my pipeline. My goal was to become the most well-known person in my city. So my local area. At the end of that, like about nine or 10 months in, so pretty much towards the end of the year, I ended up at a meeting, there was a hundred women in the room. I stood up the last person to give my little speech. And I said, does anybody here not know who I am? Because I literally knew every single person in the room and no one, this one girl just raised her hand. I didn&#8217;t even say my name or anything. I just said, I’ll talk to you after. And I knew at that point I had accomplished my little quote unquote goal. And the reason that I did that was because people were saying, oh, did you get business from it? Didn&#8217;t you increase your bottom line? Well, of course I did, but that wasn&#8217;t my goal. So I wasn&#8217;t looking at it in a monetary way. I did the same thing with podcasting last year, all my networking was taken away. I was going two or three times a week to events and now it&#8217;s gone. And so I said, how can I create this one-to-one? And one to many situations that I get with networking, how can I create that in another way? And I was like, well, duh it&#8217;s podcasting. And I started to go on to the directories. I started to apply. I kind of made it almost my full-time job at that point because there were so many things that were removed from our lives at that situation, I was like, well, now I have all this extra time. This is what I&#8217;m going to devote it to. And I also found a company called pod scout and they actually apply to the podcast for you, which I think is amazing. And so they apply to like 35 a month for you, which is really great. But I started applying in the beginning by myself before I found them, and I applied to about 400 and I got on about 140 total that I actually was on in 2020.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Well, I see the problem for me is that I am a closet introvert. So the thought, I’ve always said to people it&#8217;s such a strange dynamic. I can get in front of a room of like a thousand people and do a presentation and feel not only comfortable with it. Like I enjoy it, but you put me in a room of like 10 people and I’ve got to go and initiate one-to-one conversations. I&#8217;m horrible at that. And it gives me anxiety. So that&#8217;s my problem. Luckily, I don&#8217;t, luckily depending on how you look at it, you know, obviously with the pandemic that it&#8217;s not really even been an option, but I know that once the world returns back to normal, that that&#8217;s a thing that I&#8217;m going to have to get comfortable with, but it makes sense. I mean, I totally get it. I think the thing that&#8217;s pretty amazing about what you&#8217;ve done is just making that commitment over that extended period of time to have a goal of like, I&#8217;m going to do this this many times and stick with it and it&#8217;s this and I always say that it&#8217;s the same thing with like social media. It&#8217;s like, why am I going to post social media? Well, it&#8217;s the sum of what you do over an extended period of time, that delivers results. So you can&#8217;t think of it, like, why am I doing this today? Like no, today&#8217;s what is going to really drive and it&#8217;s sticking to it and doing it. Cause you never know when you&#8217;re going to come across a situation. So that&#8217;s really great. And I&#8217;m definitely going to check out pod scout.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> One actual podcast that I was on is the one that it just took one and we had a $15,000 sale from that show.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> You just don&#8217;t know.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> And it was, yeah, it was later in the year too. It was, you know, I&#8217;d been doing it for like six months already.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Cause you just don&#8217;t know, you probably do like 50 of them and you don&#8217;t know when that one opportunity presents itself. So that&#8217;s awesome. So I want to learn a little bit more about this whole program you have where and I don&#8217;t know if I&#8217;m getting it right, but basically something along the lines of where you help clients kind of develop social media content for a year, which seems crazy to me, obviously we&#8217;re a social media agency. We think a month in advance, and we think that that&#8217;s pretty awesome. So I&#8217;m kind of take me through just a little high level about, you know, what is that, how does it work when you&#8217;re working with clients to do something along those lines?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, it&#8217;s actually only one of our five days and it&#8217;s 12 months of social media in a day. So it&#8217;s even more crazy. It makes me even more insane. But the process for that was the fact that this is what I did for my companies when I was running them, I was running a computer repair company, a marketing agency, a networking company, and a training all at the same time. And it was insane. The amount of, oh, and also, I was networking. I was running 13 networking groups a month. So I&#8217;m running all these companies, I&#8217;m running these networking groups. How do I promote them all on a consistent regular basis, keep the brands out there. And so I developed these formulas that allow me to create this much content all at once. And I would, when I would start a new business, when I would pick up, you know, the new year would come around in December, I&#8217;d just devote one day to creating all the social media. And then another day, all the emails for each company, for each thing, it took me like two weeks to get all this done because it was so much content. But for all of those companies, it was one day for each thing. And I started to use that with clients. I was doing websites and social media and everything that traditional way, and I was never getting anywhere. Clients would drag the process out. They would go past deadline. They never had quote unquote time for me, you know and so I was like, this is not working. And they took everything off my website in 2017 and then said, the next person that calls me, I&#8217;m only working one day with them and they&#8217;re getting whatever product they need in that day. They&#8217;re going to sit with me one-On-One face-to-face and the first person that called me, she ended up booking three days, a branding day, a website day, and the social media day. And she&#8217;s still my client to this day.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> That&#8217;s awesome. So, in terms of the pandemic, how&#8217;s that I&#8217;m assuming, tell me if I&#8217;m wrong here, but pre pandemic, that type of offering would be in person. Is that accurate typically? Okay. So if that&#8217;s the case, how has your business been affected by the pandemic? Not being able to be face-to-face with people and how have you kind of pivoted to be able to continue to do what you do without being able to do that?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> I haven&#8217;t pivoted at all and it hasn&#8217;t affected it at all. It&#8217;s surprising. But I actually was meeting with people. Our office was still open. Even during the pandemic, they were allowing certain private meetings, which all my meetings are private meetings. There was no large groups or anything. And so we would go in, we&#8217;d wear masks, we&#8217;d sit, you know, one person at each end of the conference table. And we would work. I did several throughout April, May, and July, especially of last year. And then of course, Florida, where I am opened up. So we were able to do more. But it was very surprising that people were still willing to go. They were willing to show up and there&#8217;s been a couple people who, you know, weren&#8217;t able to travel. Cause I used to travel to them, or they would travel to me and we did them through like zoom or whatever. And that was very difficult. And I found that people have to be on the tech savvy side to do a really good session using zoom. If they&#8217;re not on the tech savvy side, I really do need to be in person with them. So I can literally turn my screen around and say, does this look like what you were thinking? You know, and go through things like that with them. And also, it&#8217;s better to be in person because you have that energy, you&#8217;re reading the person, you&#8217;re looking at, you know, is their foot tapping? Are they nervous? Do they like what I just said, what was their facial expression? And so with zoom, it&#8217;s a little harder to do all that. And I feel like people don&#8217;t get as good of an experience, but we&#8217;ve still been doing in-person sessions. We&#8217;ve been doing a couple of zoom sessions here and there, but mostly in person.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> That&#8217;s great. So is your business predominantly local? Like your clients are locally, do you work with them the outside?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> No. People fly from all over the place to, to see me. And I I’ve flown to other places and I have offices all over the country. So I go and say, Hey, this is my office. This is the location whatever&#8217;s closest to them. And then I do add a travel fee to those sessions, but when I add the travel fee, most people are like, I’ll come to Florida. No problem.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> That is awesome. That&#8217;s great. I was going to ask, and I just lost my train of thought there. You know, when you think about the business that you&#8217;ve built, we all kind of have our stories about like things that we learned the hard way. So I always like to kind of get insight from folks that I talked to, like what&#8217;s to the aspiring entrepreneur or agency starter somebody that&#8217;s in marketing that wants to start a consulting thing. What&#8217;s one or two things that kind of stand out for you that you would have done differently that you kind of learn the hard way, like the best advice that you would give to somebody just starting out to kind of really think about when it comes to kind of jumping into something along these lines.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> I would say that definitely took me a year or two to stick with my niche. So I was saying, okay, the next person that comes along, I&#8217;m only going to do this. And I ended up developing the full five day program over the course of several months, as clients came to me and said, Hey, I need this. Can you do it? Hey, I need this. Can you do it? And what I found was that once I had that program and I had those formulas and I had this, like this whole set that I would just do, a client would show up and we would do the set and our client would show up and we&#8217;d do the set. Now, obviously it changes for each one it&#8217;s customized and customizable. But for the most part, it&#8217;s the same group of five days that we have to alternate days that we have as well, but same grouping. And it&#8217;s the same, we stick to our way of doing things. And I found that when I would take on clients and they would ask me to do things that were outside of that, that were on the edge of it, that were outside of my comfort zone to the point where I didn&#8217;t feel like it was going to be helpful to them. Because I didn&#8217;t know enough about the product that they were trying to use. I hadn&#8217;t done any research and they just kind of threw it at me. And I was like, okay, okay, we&#8217;ll try. You know, and I was just trying to say, okay, I’ll open my horizons a little bit, broaden that. But I found that, my formula was so specific and work for specific people that, that person wasn&#8217;t my client. And I took on a few clients that I don&#8217;t think I should have. I ended up helping them in the long run, but for me it was just laborious and lots of research. And it was very tumultuous for our business internally to try and make these things happen for them. Obviously, we did, that&#8217;s what we do. But I realized that the clients that didn&#8217;t request those things and didn&#8217;t have those special needs, if you will, they were much easier to deal with. We were happier. We were more calm internally. And so I thought, you know what? I need to stick to my guns here. And if a client comes to me and says, well, I want you to do XYZ. And I say, we don&#8217;t do it that way. We may not be for you. Let them go. Even if they had a five figure deal on the table, a six-figure deal, I’ve said no, and I can&#8217;t even tell you how many times I’ve had to say no to people and they&#8217;ve turned away and they&#8217;ve walked away and they&#8217;ve gone to a competitor, which is fine with me because it&#8217;s not going to cause that internal stress on our company. And that has been a huge, huge help. So I didn&#8217;t do it in the beginning. I can see definitely where that would put strain on us. And I would say, you know, make sure that once you have that thing you know works, stick to it. You can be you and do it. And not everybody&#8217;s going to be your client.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> You&#8217;re preaching to the choir, that the power of saying no, which I have said time and time again, which is, it&#8217;s very empowering. It&#8217;s hard for people just starting out. Cause it&#8217;s like, you take whatever you can get, but you definitely have to get to a point where you can be comfortable saying no and walking away from things. And we&#8217;ve learned that the hard way, you know, we&#8217;ve said yes to things and then it just doesn&#8217;t go well and it&#8217;s stressful and it creates crappy morale and it&#8217;s just not worth it. So I could not agree more with that once we can get to the point to saying no and being true to who you are is a recipe for success. Awesome. All right. Just a couple more questions. One, I ask everybody this, what is your favorite piece of what&#8217;s your favorite thing right now, professionally a book, a blog article you read, a piece of technology that you&#8217;re using, a service that you use. What&#8217;s something that stands out that you love that helps with you professionally or for the business.<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, there&#8217;s two books actually. One is called marketing outrageously and that one is by Spoelstra or Spoelstra, Spoelstra and that one is very interesting. It&#8217;s an older book, but it&#8217;s very interesting. And the other one that I read about three and a half years ago, and it literally saved my business. And especially through COVID, I mean, we probably wouldn&#8217;t be talking right now if I hadn&#8217;t read this book three years ago which is profit first and that book saved my business. I was making, I was on my own at that point making six figures cause we had downsized our team during the recession. So this is 2017. Everything was starting to pick back up. This is when I revamped everything and started over and with my business and I read that book, I was making six figures and I was paycheck to paycheck. And after I read that book, I can&#8217;t even tell you, it took me maybe three months to get to where I needed to be with it and get to his numbers, to get to his, you know, allocations. He was like, this is where you need to be at this bracket. It took me a less like three-ish months. And it was hard. It was annoying. It was frustrating, but I was like, I can&#8217;t even tell you. And I’ve gone away from it a couple of times during the last couple years, just to like, oh, I take a break. Oh, I don&#8217;t need to do that right now. And it totally messes me up. So then I always go back to it.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Very cool. No, I love that. I&#8217;m going to check that one out. I&#8217;m sure I could use that help. Awesome. Is there anything that I didn&#8217;t ask you that you feel it&#8217;d be useful to share based on what we&#8217;ve talked about today?<\/p>\r\n<p><strong>Elizabeth Pampalone:<\/strong> Well, I have two free things that I wanted to give your audience if they need this. On my website, www.getabsolutemarketing.com at the very top of the site, there&#8217;s something called the pro tool kit. It&#8217;s all the tools that I use every single day. It&#8217;s stuff that I vet, and I constantly change that list. So once you get access, you have access for life. And I am constantly adding to it, changing it, updating it. If I get great deals on things, I put those in there as well. And then, and I only put stuff in there that I use. So if it&#8217;s not on there, you know, if it&#8217;s on there, I’ve used it or I do use it currently, actually. And then I also have a membership. So anybody who is looking for marketing help or wanting to do more with, you know, actually learning to become an agency owner, then I actually have a membership it&#8217;s free to join. I have tons of free courses and free challenges in there. I also have some paid courses and I do monthly sessions as well. There&#8217;s a guest expert session. We do a monthly training and a monthly networking event.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Outstanding. I don&#8217;t know where you find the time to pull this off. I&#8217;m going to have to check some of this out and educate myself. So thank you so much for carving out some time today. Really great stuff. Where can people find you? I know you talked about the tools, but just the easiest way to kind of find you in general.<\/p>\r\n<p><strong> Elizabeth Pampalone:<\/strong> Yeah. Www.Getabsolutemarketing.com. All the socials are there and yeah, let&#8217;s book a chat. I&#8217;d love to talk with anybody who wants to talk about marketing.<\/p>\r\n<p><strong>Jason Yormark:<\/strong> Awesome. Thank you so much, Elizabeth. That will do it for this week&#8217;s episode of Socialistics. Make sure you like share, subscribe, all that good stuff and we will catch you next episode.<\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business. Learn more about Elizabeth at: https:\/\/getabsolutemarketing.com\/ Find Socialistics at www.socialistics.com    &nbsp; &nbsp; Jason Yormark: [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":8028,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics<\/title>\n<meta name=\"description\" content=\"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-28T15:00:24+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-27T18:07:52+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"25 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#webpage\",\"url\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/\",\"name\":\"Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#primaryimage\"},\"datePublished\":\"2021-06-28T15:00:24+00:00\",\"dateModified\":\"2021-06-27T18:07:52+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Alternative Ways To Build An Agency With Elizabeth Pampalone\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics","description":"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/","og_locale":"en_US","og_type":"article","og_title":"Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics","og_description":"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.","og_url":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-06-28T15:00:24+00:00","article_modified_time":"2021-06-27T18:07:52+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png","size":"full","id":8028,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"25 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/06\/Alternative-Ways-To-Build-An-Agency.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#webpage","url":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/","name":"Alternative Ways To Build An Agency With Elizabeth Pampalone - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#primaryimage"},"datePublished":"2021-06-28T15:00:24+00:00","dateModified":"2021-06-27T18:07:52+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week I sat down with Elizabeth Pampalone from Get Absolute Marketing and we discussed her unique agency and how they service clients differently as well as how to build a healthy pipeline of speaking gigs to help grow your business.","breadcrumb":{"@id":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/alternative-ways-to-build-an-agency-with-elizabeth-pampalone\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Alternative Ways To Build An Agency With Elizabeth Pampalone"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8026"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=8026"}],"version-history":[{"count":1,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8026\/revisions"}],"predecessor-version":[{"id":8035,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8026\/revisions\/8035"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/8028"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=8026"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=8026"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=8026"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}