{"id":8043,"date":"2021-07-12T08:00:42","date_gmt":"2021-07-12T15:00:42","guid":{"rendered":"https:\/\/socialistics.com\/?p=8043"},"modified":"2021-07-06T22:10:23","modified_gmt":"2021-07-07T05:10:23","slug":"legal-tips-and-advice-for-agency-owners-with-ruth-carter","status":"publish","type":"post","link":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/","title":{"rendered":"Legal Tips and Advice for Agency Owners with Ruth Carter"},"content":{"rendered":"\r\n<p>This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners. We chat primarily about some of the legal things agency owners should be thinking about, as well as some thoughts about how to tackle book projects that could set you up for success.<\/p>\r\n<p>Learn more about Elizabeth at: <a href=\"https:\/\/carterlawaz.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/carterlawaz.com\/<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8614782\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8614782-legal-tips-advice-for-agency-owners-with-ruth-carter.js?container_id=buzzsprout-player-8614782&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Hello, and welcome to another episode of the Socialistics podcast. This is Jason Yormark. Thank you for listening. Really excited about today&#8217;s guest. They bring some legal expertise, which I am in desperate need of. So I&#8217;m looking forward to the conversation. We&#8217;ll see if I can glean anything and get some wisdom that the audience can get some value out of as well. So welcome Ruth Carter to the show.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Hello. And now the truth comes out as to why you wanted me here. Free information. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Yeah, for sure. But I&#8217;m telling you, I will hire you if you&#8217;re a good fit for me because I am looking for it. So let&#8217;s just go ahead and jump right in. Tell us a little bit about your story, your background, where you kind of started where you&#8217;re at, where you&#8217;re headed, all that good stuff.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> All right. So I am a licensed attorney in Arizona and my practice focuses on business, intellectual property, and internet law. And my practice really grew out of my own needs and my friends&#8217; needs. So when I was in law school, I got involved with blogging and some of the social media stuff. And I had a lot of questions about like, how far can you push the envelope before you cross the line? What can, and can&#8217;t you put on the internet, things like that. So from that, I just started naturally looking into these issues, taking classes, and my business has really grown organically. I&#8217;ve been an attorney for almost 10 years now, and I&#8217;ve written three books, including the legal side of blogging, how not to get sued, fired, arrested, or killed. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Very interesting. So I&#8217;ve been blogging for about, well, a very long time, and I don&#8217;t know that I&#8217;ve ever thought about legal ramifications, what I&#8217;ve done. I don&#8217;t think I&#8217;ve ever done anything that put me at risk, but what does that look like? Like in terms of, you know, how you&#8217;ve advised folks around that or how to keep them out of trouble when it comes to that sort of stuff?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Oh, it&#8217;s incredible because we jumped into this new technology without realizing that the same laws that apply in the real world still apply on the digital world and the law doesn&#8217;t always keep up. And so it&#8217;s sometimes confusing to determine like, what is and is not legal. But then there are things that are blatantly illegal, like stealing images that you find through Google image search. A lot of people think, well, if I found it on the internet, I&#8217;m allowed to use it. And they&#8217;re even guru type people who will say, oh yeah, use whatever you want. As long as you give an attribution and a link back. And I looked at that and say, oh, no, that sounds like you&#8217;re committing copyright infringement, admitting it, and telling the person about it. Yeah. So it&#8217;s all that stuff like that I run into on a daily basis.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Yeah. Now that you say that I did learn that the hard way. I used an image. I don&#8217;t know if it was on purpose, but Getty images, like something like the scary legal I&#8217;m like, I&#8217;m like, geez, I&#8217;m nobody. I don&#8217;t have anything fine, I&#8217;ll take it down. Like, so I did, I do remember experiencing that wisely use you know, images that you&#8217;re allowed to use and whatnot. So that&#8217;s a good point. So you own your own practice, is it you, you&#8217;re kind of self-employed your own thing.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> I&#8217;m in a really interesting situation where I have my own law practice that I use for speaking and writing, but then I&#8217;m an independent contractor to a firm called Venturas where I do all my client work litigation and things like that. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Gotcha. What got you, I&#8217;m curious about the book stuff. So I&#8217;m in the middle of a book, I&#8217;m writing a book called the anti-agency and it&#8217;s been an interesting journey. I&#8217;m looking forward to seeing how that plays out, but how did that come to be for you in terms of, you know, writing books and how has those experiences complemented what you do professionally? And I&#8217;m just kind of tell me a little bit about that, those journeys.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Well, I&#8217;ve always loved writing. And so when I was in law school, I did a blog series about like how to get sued, fired, arrested, or killed because of your blog or what you post online. And so it kind of naturally grew into the book. I just expanded it and added in information that I gleaned from my various IP classes. And I did, I wrote some type of paper in my cyberspace law class that spoke specifically to what you can and can&#8217;t post online. So I had all these pieces that were preexisting that I was able to bring together. And then expand on and write this little book because I realized there really isn&#8217;t a book out there written for Joe average people that explains, okay, here&#8217;s how the rules work for these issues that I run into on a daily basis. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Yeah. What&#8217;s the best piece, I&#8217;m just curious about this again, selfishly, but I know that there&#8217;s a lot of folks that think about writing a book. What&#8217;s the number one piece of advice you would give for somebody that&#8217;s interested in taking on a project like that? When it comes to writing a book.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> So like what&#8217;s my advice for fellow book writers. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Yeah, yeah, sure. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Okay. A couple pieces of advice. One make time for writing. The only reason why my books got written was because I had a really diligent schedule about, I&#8217;m going to be writing Monday through Friday during these hours. You&#8217;re not done for the day until your word count is done. And I was just, I was really strict about that. And so that&#8217;s how the first drafts got written. And then my other piece of advice is have a good editor. Nobody should ever publish a book that hasn&#8217;t been edited by somebody who edits professionally, not just your friend. Who&#8217;s a really good writer, or who&#8217;s really good at grammar. You want an editor. And for me, it was really important to use a lay person for my book written for lay people so that she could read it and tell me whether or not what I was saying made sense, because I had been in law school for three years. So I speak pretty fluent legalees at this point. So I needed to be able to make sure I could communicate to my audience. And there were a couple of points where she was like, okay, I think I know what you&#8217;re saying, but is this it&#8217;s like, oh no, that&#8217;s not, it it&#8217;s this other thing. And so we had to do some tweaking and yeah, editors are worth their weight in gold because they make me sound so much better than what I put down on paper.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Those are the two pieces of advice that have been pretty consistent over the years that I&#8217;ve heard is the carving out consistent time and having an editor. So not shocking to me, good to hear that reinforced. So tell me a little bit more about who you, like from a legal standpoint, like the work that you do, what are the types of clients that you&#8217;re typically working with and the challenges that they&#8217;re facing that you help them kind of deal with? Obviously, not specifically, but just generally.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><br \/><b>Ruth Carter:<\/b> Right. I mean, the easy answer is who you know, who do I work with? People who pay me. But I do a lot of work with contracts, whether I&#8217;m drafting their contracts, reviewing their contracts, dealing with contract disputes. Sometimes clients come to me and they say, this is the contract we signed. Now we have a problem. How do we fix it? Or sometimes they come to me with like, my client&#8217;s not paying me. How do I get them to pay? And I start with, well, what is your contract say? And sometimes they say, well, we didn&#8217;t have one. It&#8217;s like, okay, this project just got substantially more complicated because I&#8217;m going to have to piece together what the agreement was based on things You&#8217;ve said, emails, text messages and your actions, which takes a long time. Versus if you just hand me a contract and I can read it. I also get to do like terms of service and privacy policies for websites. I do a fair amount of work with trademarks. Both registering them with the US trademark office and also defending them. I have a client who&#8217;s really adorable and diligent about checking for potential infringers on a monthly basis. And she&#8217;ll send me like these links saying, I found these people using something similar to our name is this infringing. And then I look at it and say yes or no. And then we talk about, or usually what happens is, we send a cease and desist letter, but the first draft is, comes from her to the infringer. So it&#8217;s like owner to owner. Even though I wrote the letter but it&#8217;s in her name. And so we try to resolve it that way. And then if that doesn&#8217;t work, then the lawyer, then I get to write the second letter and write like the nasty gram to say, okay, you need to stop or else we will take further legal action. And then sometimes I get to do actual litigation where we&#8217;re doing motions, we&#8217;re going to court. Things like that when a dispute can&#8217;t be resolved in other ways.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>What&#8217;s the typical size of clients that you work with? So our audience is, I&#8217;m guessing predominantly agency owners, aspiring agency owners, folks that work at agencies, I guess, in that regard, what&#8217;s the typical size client that you work with?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Oh, wow. I work with kind of everybody from like small mom and pops to like some of the biggest businesses in my area. Not a ton of giant businesses, mostly like small, medium size businesses. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>All right, well, I&#8217;ve got a very, very timely and relevant question for you based on what you just shared with me. I think this is something that a lot of the people that listen to this show will find a tremendous amount of value in. So let me give you a little bit of context. We&#8217;ve been predominantly a month, a month agency with our clients. My line of thinking is really just noble, I guess, in the sense of, I feel like businesses should have some flexibility in their ability to navigate their agency relationships. And it was a huge disruptor for us in terms of when we were starting out as an agency to create kind of a risk-free environment to work with us. And it&#8217;s been fantastic up to this point. It&#8217;s not without its challenges, but part of what I also realized is that I&#8217;d never, part of my opinion was that look, if a client doesn&#8217;t want to pay you, they&#8217;re not going to pay you. well, what am I going to do? Take them to court. I&#8217;m not big enough. I don&#8217;t have the time and the resources to pursue that legally. I&#8217;m not there yet. So it&#8217;s like, what&#8217;s the point of having a long-term contract if it&#8217;s not going to really be that enforceable anyway. And I&#8217;ve had folks kind of share with me, you know, if services like, you know, if they cancel on you, if you had a long-term contract and they cancel with you, you&#8217;re going to have a real hard time collecting if services aren&#8217;t rendered, like, you know, charging for fees, cancel fees, or like, if you didn&#8217;t provide those services, it could get easily thrown out. So I&#8217;m like, what&#8217;s the point I might as well continue to be month to month. So my question to you is one, you agree with that at all. And the follow-up to that is what are just some level guidance that you can give in terms of whether marketing agency owners, should they even, you know, long-term contracts, are they, can they be enforceable? And if so, what are the type of high level things they need to be thinking about in order to kind of put it in a direction that&#8217;s going to, you know, make it so?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> All right. So the way I look at contracts is they are a relationship management document. They are their purpose is to put everybody involved on the same page in this master document. So if anybody has any questions about who&#8217;s responsible for what and how are we going to resolve problems, It&#8217;s all in this one master document. And the way I approach a contract for the first time is I try to envision the relationship between the people involved and I&#8217;m a visual person. So I try to just map out in my head, what does this look like from first conversation to parting ways and what are the pitfalls I have to help them avoid like non-paying clients and try to write the contract in such a way that it&#8217;s in the best interest of the client to pay versus not, and put my client in a position where if your client isn&#8217;t complying with, whether they&#8217;re not paying you, they&#8217;re not being responsive to you. They&#8217;re just a jerk that you can kind of hold their feet to the fire. And say like, we&#8217;re not going to give you your deliverables until you pay us or be in a situation where you can fire somebody for any reason. So if you want to fire a client, because they&#8217;re a jerk, fine, have that in your contract. We can part ways for any reason we know with so many days’ notice. So in terms of agency a couple of things that I would want to see more often in these contracts has to do with more specifics about what the deliverables are. Who&#8217;s going to own the intellectual property in said deliverables because the client assumes, they own it, but that&#8217;s not always the case. And it should be crystal clear. And if the client is getting ownership of the IP, they should be paying more for that because they&#8217;re getting more. I think agencies should decide if they&#8217;re going to do trademark searches or not, or recommend that to their client before their client goes running off with their new brand. I mean, as a risk adverse lawyer, I would say, tell them, run this by a lawyer before you use it. Because we&#8217;re not experts at using the trademark database and they are. but some agencies I know do, but most don&#8217;t. So that could be a setup for a client to have problems down the line. If they&#8217;re using a brand that&#8217;s already registered as somebody&#8217;s trademark, even if it&#8217;s like some little Podunk company on the other side of the country, that&#8217;s not even in competition with them because they have a registered trademark. They still have exclusive rights that are superior to yours. Another thing I would love to see in more agency contracts, this is [<\/span><span class=\"s2\">15:07<\/span><span class=\"s1\"> inaudible] I&#8217;m representing agencies. I would love to see an indemnification clause. So in the event that your client gets sued or a cease and desist letter or something, because of what you created for them, that&#8217;s on them. And they&#8217;re responsible for the associated attorney&#8217;s fees. Not you, you have to probably put something in there that says like all of our work is original to us and we didn&#8217;t knowingly use anything that, you know, belongs to somebody else or something to that effect. Oh, one more thing. If the client is getting ownership of the IP, the agency needs a license back to put a copy of the work in its portfolio. Otherwise you can&#8217;t do that because you might be violating their IP because they own it, not you. So that&#8217;s a clause that I frequently don&#8217;t see in contracts that should be there. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Gotcha. So a follow up question, in your opinion, I know like with a lot of agencies, what they&#8217;ll do is in terms of termination clauses, it&#8217;ll say something along the lines of, you know, you have to give 30 day notice and if it&#8217;s like a 12 month contract and they&#8217;re canceling three or four months in, or roughly whatever, they&#8217;re obligated to pay like 50% of the balance of the rest of the contract or something like that as like a cancellation fee, is something like that in your opinion, enforceable. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><br \/><b>Ruth Carter:<\/b> Yes. You can put anything you want in the contract, as long as it&#8217;s not illegal, to my knowledge, it is not illegal to put in a cancellation fee.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Gotcha. Okay. Good to know. Good to know. Do you have any, if you, like, do you have any experience with I don&#8217;t know what the actual term would be, but like employment law, like hiring employees versus contractors. Okay. I&#8217;m getting a head nod. So next question that is very relevant to this audience as well. Should agency owners be concerned or careful when it comes to, if they&#8217;re only hiring contractors, like, do they need to be careful about that? I feel like we live in such a different evolving world that where so many more people are wanting to be 1099 contractors and have that freedom. But I know from a government legal standpoint, you know, there&#8217;s, you kind of have to be careful about that. Just kind of curious what some high-level advice you might have when it comes to agency owners, the dynamic of their workforce being contractors versus employees, and when they might need to, you know, be careful with those sorts of things.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> So I would say, always check with your accountant on these things as, as your lawyer, because there&#8217;s implications on both sides. And it&#8217;s important for companies to remember. It&#8217;s not as important as what title you use for your workers, whether you&#8217;re calling them employees versus contractors, as much as what are the actual dynamics of the relationship. So if you&#8217;re calling somebody a contractor, but everything about your arrangement with them looks like they&#8217;re an employee, they&#8217;re an employee. So, you know, if it looks like a duck and talks like a duck, it&#8217;s a duck, you can&#8217;t just call them like a contractor to suddenly like, decide, like I don&#8217;t have to give you health insurance anymore. Things like that. So I would look at what is the actual nature of the relationship versus what you want to call your people before deciding what you&#8217;re going to call them. And then have really clear contracts with if you&#8217;re going to on boat, regardless. So that it&#8217;s clear what your worker&#8217;s obligations are, especially in regard to intellectual property. If they are contractors, you need to have terms that say that, that the agency will own everything that they create. They&#8217;re not the owner. So that way you&#8217;re not in a situation where you can&#8217;t deliver your deliverable because your contractor actually owns it. You don&#8217;t. So you want to be clear about that. You got to think about like depending on where you live, if non-compete agreements are legal. do you want your contractor to also be your competition? Especially if they&#8217;re going to be privy to maybe some of the trade secrets of your agency, that may not be a good idea if the non-competes aren&#8217;t allowed in your state. So you have to kind of play that, you know, play the tape forward to see how could this play out in the long-term you know, for good, for bad and decide what&#8217;s the right thing to do and what you&#8217;re allowed to do based on your state laws, because a lot of these issues are based on your state laws, not, federal.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>That actually brings up another good question is should again, we live in a different world, like our agencies virtual. Do you think when it comes to a business looking for, you know, legal guidance or hiring somebody like yourself should they be predominantly looking for somebody in state or does that not matter as much these days?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> The answer to every legal question starts with, it depends. So if you&#8217;re in a niche industry where you really need to have the legal expert, you know, in that area to help you, that may only be a handful of people. So it may make sense to look out of state, but there are times when it makes more sense that you want someone local, because they know the local laws, like non-compete agreements, things like that. You need to look at if there&#8217;s a dispute, how and where is it going to be resolved. So with my clients who are out of state, oh, and there&#8217;s sometimes rules about out of state lawyers, can&#8217;t always help you. Like certain states are like, no, if you&#8217;re not licensed that you can&#8217;t represent clients in the state unless you&#8217;re paired up with another law firm who is local, and then the client&#8217;s basically paying double and it&#8217;s like, no, don&#8217;t do that. But a lot of times other states are like, yeah, sure. As long as you&#8217;re just doing like transactional work, like, work with anyone you want. for those clients, if I am doing their contracts, I usually write it to say that all disputes will be resolved in Maricopa county where I live in Arizona, even if my clients often like Montana or wherever, because it&#8217;s cheaper for my client, if I don&#8217;t have to get on an airplane. So for their legal dispute. So you&#8217;d have to look at those issues too. So yeah, so it can make sense to have an out-of-state lawyer, but it depends on you, what your business needs, what you need. Some people want to be in the same room with their lawyer. So if that&#8217;s important to you, well, then you need to find someone who&#8217;s local or be willing to get on an airplane.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>I love it. Just a couple more things, I always like to ask the folks that come on, what is your, just a favorite piece of technology, book, show something that you recently just can&#8217;t get enough of? What might that be these days?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Oh God, that is a hard one. That&#8217;s kind of evil. Because you don&#8217;t know this, I was in a car accident 16 days ago and I&#8217;m getting over a concussion. So you&#8217;re making my, so you&#8217;re asking my brain to think right now. [<\/span><span class=\"s2\">22:45<\/span><span class=\"s1\"> inaudible]. I think I&#8217;d have to say because of my car accident, I had to buy a new car. So I went from driving a little Toyota Corolla, 2006 to now I have a 2018 RAV4. So this is my first time having a backup camera and all, you know, even a touch screen in my car. And so I think just getting used to that and just like, oh, I have more buttons when I drive. And so I think that&#8217;s been my new latest piece of technology, which has nothing to do with agencies.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>I&#8217;ll take it. I just like hearing what people are enjoying in their lives these days. So, awesome. Well anything that I didn&#8217;t ask you, anything that you want to share with this audience that we didn&#8217;t cover today.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> I guess one thing that I run into with agencies with a lot of entrepreneurs is that they are run by really smart people and you know how to work the Google machine. So you can find a lot of great resources online, that is not a substitute for quality legal advice. So when it comes to things like drafting your contracts, which are going to be like the bedrock of your relationship with your clients, this is what you&#8217;re going to rely on when things go sideways, that is worth the investment to have a professional drafted for you, because you don&#8217;t want to be in the situation where things go sideways with that client, you go running to the lawyer, they look at your contract and they go, oh my God, your contract sucks. like a lot of your problems could have been avoided, had you had a, someone who understands your industry and understands contract law, draft this for you. So most legal issues are avoidable.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>I agree. And I&#8217;m going to be taking you up on that advice. So, awesome, well, thank you for jumping on the show and you know, really great stuff. It&#8217;s super pertinent, I know a lot of people that listen to this, so I know that that&#8217;s super helpful. So where can people find you or any of your stuff?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> The best place to find me is www.geeklawfirm.com that has links to all my socials and a little bit more information about what I do. And that&#8217;s just, yeah, all in one place.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Awesome. Well, thank you so much for being on the show today. Wish you the best of luck. Hopefully, your recovery from this automobile accident is going well, but thank you for your time today. And thanks for joining the show.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Ruth Carter:<\/b> Thank you so much for having me. <br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark: <\/b>Awesome. That&#8217;ll do it for this week&#8217;s episode of Socialistics. Make sure you like, subscribe, all that good stuff and we&#8217;ll catch you next episode.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"> <\/span><\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners. We chat primarily about some of the legal things agency owners should be thinking about, as well as some thoughts about how to tackle book projects that could set you up for success. Learn [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":8044,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics<\/title>\n<meta name=\"description\" content=\"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-12T15:00:42+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-07T05:10:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"21 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#webpage\",\"url\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/\",\"name\":\"Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#primaryimage\"},\"datePublished\":\"2021-07-12T15:00:42+00:00\",\"dateModified\":\"2021-07-07T05:10:23+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Legal Tips and Advice for Agency Owners with Ruth Carter\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics","description":"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/","og_locale":"en_US","og_type":"article","og_title":"Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics","og_description":"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.","og_url":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-07-12T15:00:42+00:00","article_modified_time":"2021-07-07T05:10:23+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png","size":"full","id":8044,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"21 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/Legal-Tips-for-Agency-Owners.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#webpage","url":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/","name":"Legal Tips and Advice for Agency Owners with Ruth Carter - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#primaryimage"},"datePublished":"2021-07-12T15:00:42+00:00","dateModified":"2021-07-07T05:10:23+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week I sat down with Ruth Carter, writer, speaker and lawyer who has worked with quite a few agency owners.","breadcrumb":{"@id":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/legal-tips-and-advice-for-agency-owners-with-ruth-carter\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Legal Tips and Advice for Agency Owners with Ruth Carter"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8043"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=8043"}],"version-history":[{"count":0,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8043\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/8044"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=8043"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=8043"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=8043"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}