{"id":8046,"date":"2021-07-26T08:00:09","date_gmt":"2021-07-26T15:00:09","guid":{"rendered":"https:\/\/socialistics.com\/?p=8046"},"modified":"2021-07-07T21:19:29","modified_gmt":"2021-07-08T04:19:29","slug":"the-power-of-storytelling-and-how-it-can-transform-your-business","status":"publish","type":"post","link":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/","title":{"rendered":"The Power of Storytelling and How It Can Transform Your Business"},"content":{"rendered":"\r\n<p>This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication. He currently serves as President &amp; CEO of nine dots, a visual content agency that helps businesses share their message through graphics, video and animation. Geoffrey’s diverse professional experience includes working in the film industry, living in Manchester, England where he worked in both real estate and at a creative design agency.<\/p>\r\n<p>Geoffrey is a gadget and cufflinks enthusiast, and in his spare time he enjoys spending time with his wife and three kids, whether it’s baking, basketball or board games.<\/p>\r\n<p>To find out more about Geoffrey, go to: <a href=\"https:\/\/ninedotsmedia.com\/\">www.ninedotsmedia.com<\/a><\/p>\r\n<p>Find Socialistics at <a href=\"http:\/\/www.socialistics.com\/\" target=\"_blank\" rel=\"noopener\">www.socialistics.com<\/a> <\/p>\r\n<div id=\"buzzsprout-player-8614850\"> <\/div>\r\n<p><script src=\"https:\/\/www.buzzsprout.com\/1232381\/8614850-the-power-of-storytelling-how-it-can-transform-your-business.js?container_id=buzzsprout-player-8614850&#038;player=small\" type=\"text\/javascript\" charset=\"utf-8\"><\/script><\/p>\r\n<p>&nbsp;<\/p>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<div class=\"wp-block-columns\">\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.apple.com\/us\/podcast\/socialistics-social-media-agency-stories\/id1525297047\"><img class=\"wp-image-5110\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/Apple_Podcasts_Listen_Badge_RGB.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/open.spotify.com\/show\/24xvFoLjKXzVQ01mNWpFob\"><img class=\"wp-image-5111\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/spotify-podcast-badge-blk-grn-660x160-1.png\" alt=\"\" width=\"172\" height=\"42\" \/><\/a><\/figure>\r\n\r\n\r\n<\/div>\r\n\r\n\r\n\r\n<div class=\"wp-block-column\">\r\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https:\/\/podcasts.google.com\/feed\/aHR0cHM6Ly9mZWVkcy5idXp6c3Byb3V0LmNvbS8xMjMyMzgxLnJzcw==\"><img class=\"wp-image-5112\" src=\"https:\/\/socialistics.com\/wp-content\/uploads\/2020\/07\/EN_Google_Podcasts_Badge_8x-1024x260.png\" alt=\"\" width=\"173\" height=\"43\" \/><\/a><\/figure>\r\n<\/div>\r\n<\/div>\r\n\r\n\r\n\r\n<p>&nbsp;<\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Hello, and welcome to another episode of Socialistics, social media agency stories. My name is Jason Yormark, and we have another terrific guest today. We&#8217;re going to talk about the power of storytelling, and I am a huge advocate of that. A lot of what we do is all about telling stories. So I am excited to have Geoffrey Klein from Nine Dots. Jeff, welcome to the show.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Thanks, Jason. Appreciate being here.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Absolutely. Well, let&#8217;s just jump right in. Let&#8217;s start like I do with most of my guests. Just give us a little bit of a background. What have you been doing past, present, future, all that good stuff?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Well it depends off how far you go back, but I’ve had a fairly non-linear career. So I worked for a marketing genius named Seth Godin was my first job out of college. I then went back to law school. I&#8217;ve got a legal family history. People joke, I was a law school dropout because I left after my second year, I moved to California. I had a dream to work in the film industry, which I fulfilled. I worked in the industry for six years once at a talent agency. My first job was in the story department, which seems fitting, I ended up reading a lot of bad screenplays. And then I went to go work for both the head of production at paramount pictures and then MGM and learned how movies got made. And it was awesome. I then met and fell in love with a beautiful girl who I ended up married and is now my wife. And we moved to her hometown Manchester, England. Where I started real estate company because that&#8217;s what my father-in-law did. And I did that for a number of years and was kind of frustrated. Eventually I&#8217;m like, I got to get back to doing something more creative. So I worked for design agency in Manchester, England. We then eventually came back to Philadelphia. I worked for brand marketing agency and then about five years ago, I started my own content production company. And we focus on visual content. So video graphics and animation, and my belief is that everything begins with the story.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Yeah, well, I could probably sit here and talk to you for the entire episode about the movie stuff. Cause I was like a hair close to going down that path. I was in college and got accepted to film school and didn&#8217;t do it because of a girl. And I was thinking about man, if I had pulled that trigger, cause I’ve always felt like that was like in an alternate universe. That&#8217;s the other version of me is doing something in that regard. So that&#8217;s awesome. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Yeah. Sometimes it feels like it was another universe. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Yeah, I bet, I bet. But so one interesting thing before we kind of jump into the story stuff you know, obviously as an agency on up kind of just a little curious about just kind of some highlights, highlights, low lights, what you&#8217;ve learned in terms of starting an agency what&#8217;s worked, what hasn&#8217;t, I think that&#8217;s always good insight. Not only for me, you know selfishly that&#8217;s always interesting to hear that from other folks, but I think it&#8217;s helpful for the audience to get to hear a little bit about that journey and how that&#8217;s shaped out for you.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Yeah. And it&#8217;s evolved. So first of all, you know, I’ve been in business almost five years and I still think of myself as a startup. And you know, I do keep kind of a lean mean fighting machine, a company, one of things that has changed and what I’ve learned is that focus is important. And at least it has been for me. When we started, I&#8217;m like, what do you need? You know cause I didn&#8217;t want to turn business away. So we literally did everything from brand strategy, social media logo, website, SEO. And I would basically partner with people based on what my clients needed. And two things emerged as I kind of grew. And one was, I don&#8217;t like all of that. Like there&#8217;s elements of marketing that don&#8217;t get me excited and having been an industry that I didn&#8217;t like and coming to one that I do love, you know, finding out what you really like to do is really important because I think A, you&#8217;re happier and B you produce better work because you&#8217;re working on projects that are meaningful to you. And so when I do an animation, I&#8217;m a producer, I&#8217;m not an animator. Let me be clear. When I&#8217;m in the process of either doing video or during animation, I love it. You know, it gets me excited, you know, creating that and crafting that story. So I think that when some agencies are trying to grow and scale it can be a challenge if they&#8217;re trying to, you know, take on too much. And so you spread yourself too thin and you end up getting diluted. And so therefore you&#8217;re doing a couple of different things, you know okay as opposed to really being that subject matter expert in what you do. Now at the same time as a producer, you have to know your strengths. So I&#8217;m not a technical person in terms of, I&#8217;m not designer, I&#8217;m not, you know, an animator. But I have a really high creative sense. I&#8217;m a writer. And so when you think about story, even though I do visual content, everything starts with the story and often the script of what we&#8217;re going to create. And I think that&#8217;s really important to understand when you&#8217;re starting something. And so, you know, we do a lot of execution, but it&#8217;s also important, no matter what you&#8217;re doing to think about the strategy and the business objective you&#8217;re trying to solve and you&#8217;re trying to accomplish. Because I think a lot of people just go and that planning can really help. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> In terms of your agency, kind of, where are you at as an agency. Are you still working in the business? Like you actually do the work or have you kind of built out a team to the point where you&#8217;re working on the business and not so much in it, I&#8217;m just curious about your dynamic.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> I would call it a hybrid. So I have a team of animators and designers that do the execution. I still am involved in every project, you know, as the producer. So therefore, and I&#8217;m usually also the point of contact. So I work with my wife and she does all the backend stuff, invoicing and things like that. And then I have, you know, another bookkeeper, I have all the other kind of professional things, my lawyer, and things like that. But in terms of the products that we do and the clients that I serve, I&#8217;m still the face. And I think it&#8217;s important for us as a small business because when they&#8217;re, when they&#8217;re deciding to work with us, I&#8217;m a big reason why they are. Now, what they don&#8217;t realize is part of the reason they&#8217;re working, my skill is also making sure that my creative team can deliver what they need to do. And so I always talk myself as I&#8217;m kind of the interpreter between the business side and the creative side, and that&#8217;s again, focusing on, well, that&#8217;s what I&#8217;m good at and kind of taking a project from the beginning, you know, and making sure it&#8217;s both on strategy on brand and then delivers what the client needs.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Gotcha. What&#8217;s the biggest piece of advice that you would give somebody that&#8217;s starting an agency or thinking about starting an agency. Is there something that stands out more than anything that maybe you learned the hard way or just naturally was able to bring to the table that allowed you guys to be successful? Is there something that&#8217;s kind of stands out that you would advise folks to be thinking about when they&#8217;re kind of taking that leap?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Yeah, I think, you know, there&#8217;s, and I’ve written a blog about, you know, you are the sum of the, you&#8217;re the average of the people you surround yourself with. So I think it&#8217;s not, you know, there are lots of people who can do a specific task or a specific skill, but you need to find people that align with your values and align with your sensibility. And so I think, again, even though someone, you know, there are animators out there who are really talented, but they don&#8217;t fit with my vision of how I want to the process or the delivery or the style, although there&#8217;s a variety of styles. So I think people is the thing, you know, and relationships. I think that&#8217;s the one thing I would say, you know, I was talking with someone on LinkedIn live and he talked about, you know, ROI, everyone talks about ROI and he came up with ROR, which is return on relationships. And so I think the one piece of advice is you want to leverage, nurture, develop those relationships that are going to, you know, whether it&#8217;s your tribe, however you want to describe it. I think it&#8217;s really important to find, you know, people that are going to help you achieve what you want to achieve. And it may be clients, it may be partners. But I was for a while, I was a really big fan of Gary Vaynerchuk, Gary V. And, you know, he said, you know, the conventional wisdom, which is, you know, work on things that you&#8217;re not good at. Like I need to work on this. I need to work on that. I believe and ascribe to, you double down on your strengths. So whatever you&#8217;re good at, really lean into that and get great at it. And then those things you&#8217;re not so good at have other people do them, you know, there&#8217;s enough support systems, whether it&#8217;s a VA or you bring on a junior person to do whatever it is, my advice is A, build and nurture those relationships and focus on what you love and are good at.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Yeah, no, I couldn&#8217;t agree more. I&#8217;ve gotten to the point where I have surrounded myself with people that run the business, you know, it&#8217;s my job to kind of be the face of it and, you know, do things like this, you know, do podcast episodes, and create great content and stuff like that. So that&#8217;s awesome. So let&#8217;s dive a little bit into storytelling, which I&#8217;m super passionate about personally and professionally, you know, every time we come across clients, I&#8217;m looking for the bones, or just like the early makings of a story with a client. Cause I always tell them, like, if you don&#8217;t have interesting stories, you know, if you have boring products or services, or if there&#8217;s not, you know, a compelling reason why you do what you do you know, all the marketing in the world, isn&#8217;t going to make much of a difference. So there&#8217;s a lot of time and investment that has to go into figuring out what that is and telling those stories over time, because, you know, people, I mean, storytelling feels back to the beginning of time, you know, everybody gravitates towards that. And I think a lot of businesses fail miserably at it, which is why agencies like ours exists because we help them with it. So let&#8217;s just kind of dive into, you know, how do you, when you&#8217;re kind of engaging with a client for the first time and jumping in, like, how do you frame up those conversations and how do you determine where stories exist, how to develop them, or at the very least talk to potential clients about the importance of storytelling.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Yeah. So as a speaker and I gave a TEDx a couple of years ago on the power of story and for me, there&#8217;s, I have a keynote I do called the science of story. And so I often share with people the scientific reason why story is so powerful and it&#8217;s how our brains work and how we relate when, what happens when we hear a story, as opposed to a lot of us do, we&#8217;ll just talk about their features and benefits and that kind of information. And lots of studies have been done about the fact that when you incorporate that data into a story, you&#8217;re going to be much better able to explain and have people understand it and much more likely for them to remember it. And if you&#8217;re marketing and you&#8217;re a new business or whatever business you&#8217;re in, those two things are pretty critical for people to know your value proposition and understand what you&#8217;re talking about. And then they remember you so that they pick you versus someone else who they didn&#8217;t remember. So, and I think as an agency owner approaching a client or a potential client, the most important part in terms of extracting those stories is being curious, asking lots and lots of questions. Because I think the businesspeople sometimes, you know, they think they know what they know. They don&#8217;t know what they don&#8217;t know. And so my job is to try and be an excavator, you know, an explorer, maybe an archeologist of their story. And the place I often start is how do you help people? You know, what is the problem you solve for your clients? And that&#8217;s where, you know, so if you think about case studies are great ways to tell your business story, because it always starts with a client who comes to you with a problem. You then have to express, you know, how you fixed it. And that&#8217;s a way that people can relate. And you can tell it in a narrative form rather than saying, we are the best, or we do this. And I developed a specific tool called the story pad that any business can use. And it&#8217;s really simple. So first of all, I always think that, you know, when you&#8217;re telling the story, I believe in the kind of Aristotle foundation, you need a beginning, middle, and end, maybe coming from the, you know, movies or that&#8217;s, you know, you have the 3X structure. People can break it, but only if you&#8217;re, you know, a genius like Chris Nolan or something like that, you know, for the most part, people should stick to the script and stick to the 3X structure. So I developed something called the story pad, PAD, and the PAD represent the beginning, middle and end of the story. So the P is the problem or pain of your customer. Because as I like to say, no one cares about what you can do. They only care about what you can do for them. So when you start with the pain or the problem, you&#8217;re immediately connecting to those people who need you, you know, your services. I often cite, you know, personal injury attorneys, when you see their ads in there, I&#8217;m not a huge fan of them, but they do this really well. Have you been injured in an accident? That&#8217;s a problem right away. And if you have been injured in an accident, that&#8217;s going to resonate with you. So then you get to the middle of the story, which is the A, which is the answer to that problem, or your services, your product or service. So you have a problem. And now, Hey, guess what? We can help you with it with this tool, this strategy, this, you know, service that we provide. And that&#8217;s where a lot of people stop. So again, it&#8217;s, you know, like you&#8217;ve been injured in an accident and our legal services can help. The D which is the end of the story, is about the difference or the impact it makes on their business or their life. And I think that&#8217;s a critical piece that some businesses forget to tell. So it&#8217;s like, you have a problem. We have the solution. And if you use this, this is what&#8217;s going to happen. These are the results beyond the immediate, like we&#8217;re going to fix this issue. What&#8217;s the bigger difference and impact it&#8217;s going to make. And so we use that structure in a lot of the animations that we do, and I get it, it&#8217;s simple. We&#8217;re not, you know, don&#8217;t try to overcomplicate things, the simpler you make. It, it&#8217;ll be easier for you to communicate it and easier for someone to digest and appreciate it. <\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> I love that. That&#8217;s great. Do you come across I would imagine, I know that we do, to a certain extent you come across maybe new opportunities or you come across businesses that have varying degrees of stories to tell, like, you know, some that just have an incredible framework with work, with which to work with. And then some that are just like, man, there&#8217;s not a lot here to work with. Like, I&#8217;m just kind of curious what you&#8217;ve experienced and what you guys do as an agency. Do you tend to kind of walk away from situations where a client maybe just doesn&#8217;t have a whole lot of depth, or do you just see that as a bigger challenge and you kind of have to dig deeper? I&#8217;m just kind of curious how you deal with a varying degrees of the types of opportunities that come your way.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Well, it&#8217;s interesting, when I pitch networking meetings and things, one of the things I say I&#8217;m looking for is people who have a challenge explaining what they do. So they have a complex business because the nature of creating the story is to be able to tell it in a way that people will understand so that, you know, and we talk about explainer videos, that&#8217;s what we&#8217;re doing. We&#8217;re taking that information and making it digestible by putting it in the framework of the story. So we&#8217;ve, you know, we&#8217;ve worked with clients who don&#8217;t have something that I would call, you know, it&#8217;s not necessarily appealing on its own, you know, so we have a client who does, you know, vehicle lock accessories. So not exact something that you&#8217;re going to go, oh, man, this is going to, and we&#8217;ve created a series for them. And these little stories are awesome for them. It&#8217;s a B2B play, so we&#8217;re basically taking the story of how they help people in terms of the use case, the end use case of what their technology does. So I don&#8217;t shy away from any of those kinds of things. I think in some ways they&#8217;re almost easier in some ways because they&#8217;re so complicated the challenge, yes, it&#8217;s a challenge, but it&#8217;s an opportunity and it&#8217;s an opportunity to be like, okay, let&#8217;s dig in and let&#8217;s strip back some of these, the jargon and some of these things. And we can explain it to someone who&#8217;s in your, you know, your target audience in a way that they&#8217;re going to get it and want to, you know, understand it. I love doing that. And I think that&#8217;s some of the beauty is when you can take something, that where I think we thrive, we take something complicated and we simplify it so that people can understand and then engage with the content, with the message.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> What are some of your I mean, obviously the web and social media and technology is evolving all the time. What are you like as a passionate storyteller, like what are the technologies or platforms that you see that excite you the most in terms of opportunity around being able to tell stories that resonate with people.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> That&#8217;s actually an easy answer for me because it&#8217;s something that I&#8217;m getting more and more excited about or, I haven&#8217;t found the tool cause [<\/span><span class=\"s2\">17:45<\/span><span class=\"s1\"> inaudible], but for me, it&#8217;s interactive video. Because then what you&#8217;re doing is you&#8217;re involving the audience. And I think that&#8217;s that engagement. So I’ve seen, I saw a video where it was talking about what happens if someone young has a heart attack. And so they actually have the video play, you see the guy fall, and then it asks you a question, you know, what should we do? Call 911, just [<\/span><span class=\"s2\">18:11<\/span><span class=\"s1\"> inaudible] on the sofa. And so they&#8217;re taking you through the story, you&#8217;re a part of the story and that kind of decision tree, should you do this? Or should you do that? I think is important two ways. One, this was an educational thing. So you&#8217;re learning by being involved in that story, but also, it&#8217;s a way of taking your buyer through the journey to make sure they end up where they want you to. So if you have several things that you&#8217;re trying to do, it&#8217;s a good way to kind of vet and pre-qualify. So, you know, you have your kind of workflow and your flow chart, and it&#8217;s like, okay, do you have this problem? You do, great. Let&#8217;s go into this one. Do you have this problem? And so you can do things in that way where you&#8217;re, I just think it&#8217;s compelling. And I think, again, people, what they&#8217;ve shown with some of the studies they&#8217;ve done, people are spending a lot more time on these videos because they want to find out what&#8217;s going to happen. And if they&#8217;re structured well, people want to find out what&#8217;s going to happen in the end.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> So Basically what you&#8217;re saying is that we&#8217;re incorporating, choose your own adventure books from my youth into a digital environment. I love those books. I&#8217;d love the books.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><br \/><b>Geoffrey Klein:<\/b> Yeah, well, because we have control or that&#8217;s the perception, we had had control. But I think that&#8217;s the thing is that the more, you know, everyone talks about being customer centric, you know, and being, making sure that we&#8217;re thinking about the person at the other end, and this is, I don&#8217;t think you can get any more so, when they get to click where they go next. And so to me that choose your own adventure video is going to be, it&#8217;s going to grow. It&#8217;s going to blow up. There&#8217;s a bunch of tools out there they&#8217;re kind of expensive at the moment, but I think as that changes and then I think as people recognize how powerful they are, it&#8217;s going to be huge.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Yeah. I love that. If I were a business owner listening to this and I&#8217;m like, you know what, I like what I&#8217;m hearing here. I really need to be thinking about, you know what we&#8217;re doing when it comes to telling our stories, what some advice that you would give for maybe a business owner or somebody that&#8217;s not there yet. What are some of the things that they should be thinking about or preparing themselves for prior to maybe kind of engaging with an agency? What are some helpful things that would kind of get them, you know, kind of get the ball rolling for them. And coming in with the things is kind of a little bit farther along than maybe they wouldn&#8217;t be.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> I think one, the place to start is A, make sure you understand who your audience is, because it&#8217;s great to create content, but if you&#8217;re not sharing it with those that matter, then it&#8217;s, you just wasted all your time. So try and understand who are your best clients, that&#8217;s going to be critical for when you developed it, in terms of thinking about your story itself. You know, I would think about, again, case studies, think about writing case studies in terms of what was the problem that they came to you with, how did you help them and what was the impact and having those down, because then you have the blueprint, you know, the outline for those, for creating that content. And I think, again, it goes back to, I&#8217;m a brand guy, so it&#8217;s all about, you know, how you kind of differentiate yourself. So I think you know, you&#8217;ve talked about, I think at the very beginning of the kind of start with why the Simon Sinek, which I&#8217;m a fan of. So I think, again, businesses of any size and shape need to think about what makes them different and why do they do what they do. Because when the people who are going to do the specific things, the what, but the why is going to be what makes you stand out.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> I love that. Well, I would be amiss to not ask you, you said in your bio, so I&#8217;m going to put you on the spot. You said you are a gadget enthusiasts. You said gadget and cufflinks. So I&#8217;m not a cufflink guy. So we&#8217;re going to talk some gadgets. And I ask everybody this, because again, for my own selfish reasons, I love hearing about this. So being a gadget enthusiast what is a gadget that you&#8217;ve been using lately that you just adore can&#8217;t get enough of one of your favorite things recently?<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> I think again, I default, and I’ve had it for a little while and I want to get a different one, but it is the drone. So we do drone video for people, and I have a drone operator, that&#8217;s what he does and he&#8217;s a professional and he does it, but I&#8217;m a drone enthusiast. And I love it. I love it. It&#8217;s just, you get a perspective you wouldn&#8217;t otherwise get, but even when I fly it above my house, I think it looks awesome. I think it&#8217;s really cool. We&#8217;ve done a couple of family things where we&#8217;ve had the drone up high and then it circles around. Then it comes down and then we give our birthday message to the person. Cause it&#8217;s just, people are like, what&#8217;s going on? And so yeah, I take the drone with me everywhere I go. And in fact, I took it on a video shoot recently just to have it. I was like, maybe I’ll do something. You know, we weren&#8217;t planning to do any drone video. And it turns out it was, you know, a hardware reseller and the building wasn&#8217;t that exciting. And so I was like, I guess we&#8217;re not going to drone this. But when we went inside, it turns out they had a 7,000 square foot warehouse. So I ended up taking some drone inside the warehouse that ended up coming and looking really cool. So you just, you know, again, it just gives you a perspective and I think anything that can bring, so when you think about things at time lapse, slow-mo, boomerangs all these little kind of unique ways of showing video and the drone I&#8217;m a big fan of it. <br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> I love that. I mean, [<\/span><span class=\"s2\">23:48<\/span><span class=\"s1\"> inaudible] is just so fascinating. I&#8217;ve thought about this. It&#8217;s just a matter of time, like with the world of influencers that they&#8217;re going to, the technology is going to reach a point where people have their own personal drone and that&#8217;s what we&#8217;ll be like, shooting them. Like there&#8217;ll be going, working out and they&#8217;re just going to have a drone that&#8217;s kind of, instead of like the selfie and the selfie sticks and all of that, like, it&#8217;s just going to be like your own personal drone, and it&#8217;s tied to your phone or whatever. And it just knows where to be. And it&#8217;s capturing all your stuff. Like, I guarantee that that is going to be a thing in the next, you know, 5 to 10 years and you&#8217;re going to see them all over the place like that.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> They do, the drone that I have DJI spark, which is the little one and it has a tracking ability. So it can be, I can go for a run and then he&#8217;ll follow me. <br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> It&#8217;s already here. It&#8217;s already here. <br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> There is already that ability to have it follow you around. Which is a little scary.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Yeah. Scary cool, but scary. True. Awesome. Well, this was some fantastic stuff in a short period of time. I really love everything that you shared today. Is there anything that I didn&#8217;t ask you that you wanted to add, that you feel might wrap things up or you didn&#8217;t want the audience to miss out on?<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> Yeah, I guess I think, you know, whether you use a professional or not, for whatever you&#8217;re going to be doing, you just want to start to shift to think what&#8217;s the story I can tell, you know, you said you&#8217;re talking about your story. I think you just need to shift your mindset in business to realize that story is the best way to communicate. And therefore, how are you using that to further your message?<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> I could not agree more. So I&#8217;m glad that our paths crossed and another champion of story, Cause I&#8217;m always, I don&#8217;t know that I can do it as eloquently as you, so I&#8217;m really glad I feel like this is going to be one of those episodes that I&#8217;m going to be referencing. You know, I’ve always said like the podcast for us doesn&#8217;t necessarily create leads as much as it cultivates them. So I know that I&#8217;m going to be on future calls where I&#8217;m talking about them. Like actually, you know what, go listen to this episode. This is really going to help you kind of understand the importance of story. So thank you so much for being on the show. Really good stuff. Where can people find you and learn more information?<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Geoffrey Klein:<\/b> First of all, thank you for having me. I appreciate it. I love having these conversations and I love talking with fellow champions of story. The best way to reach out to me is, there&#8217;s two places. Www.Ggklein.com is my speaker and kind of professional presenter and the www.ninedotsmedia.com is my visual content creation. So those links will give you all the social media, you know, and everything else you could need. And then you can just reach out to me. If someone has a question or wants to reach out to me, it&#8217;s my name Geoffrey@ninedotsmedia.com.<br \/><\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"><b>Jason Yormark:<\/b> Awesome. Well, we&#8217;ll make sure that we get all that information in the show notes. So make sure that you check them out and learn more. Thanks again for being on the show, awesome stuff. And thank you to those listening. Make sure you do that thing. You know what, subscribe, listen, and share all that good stuff. Thank you for listening. And we will catch you on the next episode of socialistic social media agency stories.<\/span><\/p>\r\n<p class=\"p1\"><span class=\"s1\"> <\/span><\/p>\r\n<p class=\"p1\"> <\/p>\r\n<p class=\"p1\"><span class=\"s1\"> <\/span><\/p>\r\n","protected":false},"excerpt":{"rendered":"<p>This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication. He currently serves as President &amp; CEO of nine dots, a visual content agency that helps businesses [&hellip;]<\/p>\n","protected":false},"author":9,"featured_media":8048,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[24],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v16.8 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Power of Storytelling and How It Can Transform Your Business - Socialistics<\/title>\n<meta name=\"description\" content=\"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Power of Storytelling and How It Can Transform Your Business - Socialistics\" \/>\n<meta property=\"og:description\" content=\"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/\" \/>\n<meta property=\"og:site_name\" content=\"Socialistics\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/socialisticsagency\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-26T15:00:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-07-08T04:19:29+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png\" \/>\n\t<meta property=\"og:image:width\" content=\"560\" \/>\n\t<meta property=\"og:image:height\" content=\"320\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:site\" content=\"@mysocialistics\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Jason Yormark\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"25 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/socialistics.com\/#website\",\"url\":\"https:\/\/socialistics.com\/\",\"name\":\"Socialistics\",\"description\":\"A B2B Social Media Agency\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/socialistics.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png\",\"contentUrl\":\"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png\",\"width\":560,\"height\":320},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#webpage\",\"url\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/\",\"name\":\"The Power of Storytelling and How It Can Transform Your Business - Socialistics\",\"isPartOf\":{\"@id\":\"https:\/\/socialistics.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#primaryimage\"},\"datePublished\":\"2021-07-26T15:00:09+00:00\",\"dateModified\":\"2021-07-08T04:19:29+00:00\",\"author\":{\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\"},\"description\":\"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.\",\"breadcrumb\":{\"@id\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"The Power of Storytelling and How It Can Transform Your Business\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941\",\"name\":\"Jason Yormark\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/socialistics.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g\",\"caption\":\"Jason Yormark\"},\"description\":\"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics.\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Power of Storytelling and How It Can Transform Your Business - Socialistics","description":"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/","og_locale":"en_US","og_type":"article","og_title":"The Power of Storytelling and How It Can Transform Your Business - Socialistics","og_description":"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.","og_url":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/","og_site_name":"Socialistics","article_publisher":"https:\/\/www.facebook.com\/socialisticsagency","article_published_time":"2021-07-26T15:00:09+00:00","article_modified_time":"2021-07-08T04:19:29+00:00","og_image":[{"width":560,"height":320,"url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png","path":"\/nas\/content\/live\/mysocialistics\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png","size":"full","id":8048,"alt":"","pixels":179200,"type":"image\/png"}],"twitter_card":"summary_large_image","twitter_creator":"@mysocialistics","twitter_site":"@mysocialistics","twitter_misc":{"Written by":"Jason Yormark","Est. reading time":"25 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/socialistics.com\/#website","url":"https:\/\/socialistics.com\/","name":"Socialistics","description":"A B2B Social Media Agency","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/socialistics.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#primaryimage","inLanguage":"en-US","url":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png","contentUrl":"https:\/\/socialistics.com\/wp-content\/uploads\/2021\/07\/The-Power-of-Storytelling-How-It-Can-Transform-Your-Business.png","width":560,"height":320},{"@type":"WebPage","@id":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#webpage","url":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/","name":"The Power of Storytelling and How It Can Transform Your Business - Socialistics","isPartOf":{"@id":"https:\/\/socialistics.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#primaryimage"},"datePublished":"2021-07-26T15:00:09+00:00","dateModified":"2021-07-08T04:19:29+00:00","author":{"@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941"},"description":"This week I chat with Geoffrey Klein, the Story Guy. He is a Tedx speaker, adjunct professor and a visual content producer who helps people and organizations communicate more effectively through the power of story and visual communication.","breadcrumb":{"@id":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/socialistics.com\/the-power-of-storytelling-and-how-it-can-transform-your-business\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"The Power of Storytelling and How It Can Transform Your Business"}]},{"@type":"Person","@id":"https:\/\/socialistics.com\/#\/schema\/person\/557e86d3e68443a2d100917d794d7941","name":"Jason Yormark","image":{"@type":"ImageObject","@id":"https:\/\/socialistics.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cb3fc3f4826432dafdcc12bf735ca4fe?s=96&d=mm&r=g","caption":"Jason Yormark"},"description":"Jason is a 20+ year marketing veteran including time spent at Microsoft overseeing social media for Microsoft Advertising &amp; Office for Mac. Once named to Forbes Power Social Media Influencers List, Jason is the owner and founder of Socialistics."}]}},"_links":{"self":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8046"}],"collection":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/comments?post=8046"}],"version-history":[{"count":1,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8046\/revisions"}],"predecessor-version":[{"id":8047,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/posts\/8046\/revisions\/8047"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media\/8048"}],"wp:attachment":[{"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/media?parent=8046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/categories?post=8046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/socialistics.com\/wp-json\/wp\/v2\/tags?post=8046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}